{
    "Case ID": "000393",
    "Crime_Name": [
        "Immigration and Refugee Protection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the enforcement officer err by failing to consider new evidence of risk to Simeon and pre-existing unassessed risks to the Etienne family?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act, s. 25(1) and s. 112(2)(b.1)"
    ],
    "Application_Facts": [
        "The officer ignored psychiatric evidence of Simeon’s PTSD and the family's prior claims of persecution in Turks and Caicos, which were never assessed."
    ],
    "Decision_Outcome": [
        "The court quashed the officer's decision due to failure to consider new and pre-existing risks, avoiding constitutional analysis."
    ],
    "Remedy_Requested": [
        "Judicial review application challenging removal decision"
    ],
    "Court_Ruling": [
        "Decision quashed; no need for reevaluation as circumstances changed; constitutional question not certified."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [
        "Enforcement officer failed to assess new and pre-existing risks before removal."
    ],
    "Grounds_for_Claim": [
        "Refusal to defer removal based on alleged risks not being properly evaluated."
    ],
    "Legal_Standard": [
        "Officers must assess new or unaddressed risks before removal under IRPA s. 25(1) and s. 112(2)(b.1)."
    ],
    "Assessment_Factor": [
        "Psychiatric evidence of PTSD, history of persecution in Turks and Caicos."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act"
    ],
    "Procedural_Issue": [
        "Failure to consider new evidence and unassessed risks, violating procedural fairness."
    ],
    "Review_Standard": [
        "Federal Court reviewed procedural fairness and risk assessment."
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Psychiatric evidence of Simeon’s PTSD, family's prior claims of persecution."
    ],
    "Legal_Provision_Cited": [
        "s. 25(1), s. 112(2)(b.1) of the Immigration and Refugee Protection Act"
    ],
    "Application_Basis": [
        "New evidence of risk and unassessed past persecution claims."
    ],
    "Evidence_Assessed": [
        "No—officer did not assess the submitted psychiatric and persecution evidence."
    ],
    "Relief_Sought": [
        "Quashing of removal decision, deferral of removal based on risk."
    ],
    "Governing_Rule": [
        "Under IRPA, officers must evaluate all relevant risk factors before removal."
    ],
    "Evidentiary_Deficiency": [
        "Failure to consider new psychiatric evidence and unassessed prior persecution claims."
    ],
    "Outcome": [
        "Decision quashed."
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Risk of harm due to PTSD and potential persecution if removed to Turks and Caicos."
    ],
    "Cause_Description": [
        "Refusal to defer removal based on alleged risks not being properly evaluated."
    ],
    "Evidence_Handling": [
        "New evidence was submitted but not considered by the officer."
    ],
    "Legal_Provision_Violated": [
        "s. 25(1) and s. 112(2)(b.1) of the Immigration and Refugee Protection Act"
    ],
    "Evidence_Issues": [
        "Relevant evidence was overlooked; lack of assessment of credibility or weight."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Immigration and Refugee Protection Act, s. 25(1), s. 112(2)(b.1)"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Officer failed to conduct required risk assessment on new and pre-existing evidence."
    ],
    "Decision_Rationale": [
        "Procedural unfairness due to failure to assess risks; decision quashed without remittal due to changed circumstances."
    ],
    "Country_of_Origin": [
        "Turks and Caicos"
    ],
    "Decision_Making_Body": [
        "Enforcement Officer, reviewed by Federal Court"
    ],
    "Evidentiary_Issues": [
        "Failure to consider new and previously unassessed evidence of risk."
    ],
    "Legal_Standard_Applied": [
        "Requirement to assess new and unaddressed risks under IRPA"
    ]
}