{
    "Case ID": "006776",
    "Crime_Name": [
        "Refugee Claim Rejection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Failure to exhaust state protection avenues"
    ],
    "Legal_Issue": [
        "Reasonableness of the Board's decision to reject the refugee claim"
    ],
    "Governing_Law": [
        "Principle that claimants in functioning democracies must exhaust available state protections unless exceptional circumstances exist"
    ],
    "Application_Facts": [
        "Ms. Camacho fled spousal abuse in Venezuela and Trinidad without seeking police or state protection, citing lack of trust in their effectiveness"
    ],
    "Decision_Outcome": [
        "Refugee claim rejected"
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed"
    ],
    "Claimant_Status": [
        "Refugee claimant"
    ],
    "Defendant_Behavior": [
        "Did not seek state protection in country of origin or transit country"
    ],
    "Grounds_for_Claim": [
        "Fear of spousal abuse in Venezuela and Trinidad"
    ],
    "Legal_Standard": [
        "Reasonableness standard of review"
    ],
    "Assessment_Factor": [
        "Objectively reasonable belief in ineffectiveness of state protection"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Standard of review in administrative decisions"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Board found Ms. Camacho's explanations for not seeking protection objectively unreasonable"
    ],
    "Evidence_Used": [
        "Available evidence on state resources and protection mechanisms in Venezuela and Trinidad"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Failure to demonstrate exhaustion of state remedies"
    ],
    "Evidence_Assessed": [
        "Effectiveness of police and state protection systems in Venezuela and Trinidad"
    ],
    "Relief_Sought": [
        "Overturning of the Board's rejection of refugee claim"
    ],
    "Governing_Rule": [
        "In functioning democracies, claimants must prove they exhausted all possible protections unless exceptional circumstances exist"
    ],
    "Evidentiary_Deficiency": [
        "Lack of evidence supporting exceptional circumstances justifying non-exhaustion"
    ],
    "Outcome": [
        "Board's decision upheld; judicial review dismissed"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Risk of harm due to spousal abuse"
    ],
    "Cause_Description": [
        "Ms. Camacho fled spousal abuse in Venezuela and Trinidad without seeking state protection, leading to the rejection of her refugee claim"
    ],
    "Evidence_Handling": [
        "Board assessed credibility and reasonableness of claimant's assertions regarding state protection"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Subjective fear not supported by objective evidence of state incapacity"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Board concluded that state protection avenues were available and could have been accessed"
    ],
    "Decision_Rationale": [
        "Decision was reasonable and supported by evidence"
    ],
    "Country_of_Origin": [
        "Venezuela"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Claimant failed to provide sufficient evidence of inability to access state protection"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness"
    ]
}