{
    "Case ID": "010080",
    "Crime_Name": [
        "Pre-Removal Risk Assessment (PRRA) Appeal"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Is the Officer's conclusion on state protection in a PRRA reasonable?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The applicant fled Saint Lucia due to domestic abuse and sought asylum in Canada, challenging a negative PRRA decision."
    ],
    "Decision_Outcome": [
        "The application for judicial review is granted; the case is referred back for reconsideration."
    ],
    "Remedy_Requested": [
        "Judicial review of the PRRA Officer's decision"
    ],
    "Court_Ruling": [
        "The court found the PRRA decision unreasonable and ordered a reevaluation by a different officer."
    ],
    "Claimant_Status": [
        "Asylum seeker"
    ],
    "Defendant_Behavior": [
        "PRRA Officer treated failure to seek state protection as fatal, relied on non-police agencies, disregarded country condition evidence"
    ],
    "Grounds_for_Claim": [
        "Inadequate state protection assessment, failure to consider relevant evidence"
    ],
    "Legal_Standard": [
        "The decision must be justified, transparent, and intelligible, falling within acceptable outcomes"
    ],
    "Assessment_Factor": [
        "State protection availability, credibility of claim, country conditions in Saint Lucia"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Judicial review analyzed the PRRA Officer's decision regarding state protection adequacy"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Country condition evidence on Saint Lucia, applicant's account of domestic abuse"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Risk of harm upon removal to Saint Lucia due to domestic violence"
    ],
    "Evidence_Assessed": [
        "Relevant country condition evidence was disregarded by the Officer"
    ],
    "Relief_Sought": [
        "Reconsideration of PRRA application"
    ],
    "Governing_Rule": [
        "The decision must be justified, transparent, and intelligible, falling within acceptable outcomes"
    ],
    "Evidentiary_Deficiency": [
        "Officer failed to properly assess country condition evidence"
    ],
    "Outcome": [
        "Application for judicial review granted; remitted for re-evaluation"
    ],
    "Decisional_Body": [
        "PRRA Officer"
    ],
    "Harm_Assessment": [
        "Risk of domestic abuse in Saint Lucia"
    ],
    "Cause_Description": [
        "Applicant fled Saint Lucia due to domestic abuse and sought asylum in Canada"
    ],
    "Evidence_Handling": [
        "Officer disregarded relevant country condition evidence"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Failure to consider relevant country condition evidence, overreliance on non-police protection sources"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The Officer did not adequately assess the evidence regarding state protection"
    ],
    "Decision_Rationale": [
        "The Officer unreasonably treated lack of prior state protection attempts as dispositive and relied on inadequate sources"
    ],
    "Country_of_Origin": [
        "Saint Lucia"
    ],
    "Decision_Making_Body": [
        "PRRA Officer"
    ],
    "Evidentiary_Issues": [
        "Disregard of country condition evidence, improper assessment of protection avenues"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard in administrative decision-making"
    ]
}