{
    "Case ID": "010688",
    "Crimes": [
        {
            "Crime_Name": "Overstaying visa",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration violation",
            "Legal_Issue": "Did the Board err in rejecting the applicant's refugee claim based on fear of spousal abuse and lack of state protection?",
            "Governing_Law": "Immigration and Refugee Protection Act",
            "Application_Facts": "Applicant overstayed her visa and sought refugee status due to fear of returning to Jamaica after experiencing spousal abuse.",
            "Decision_Outcome": "Board rejected the refugee claim based on credibility and lack of evidence on state protection.",
            "Remedy_Requested": "Judicial review to challenge the Board's decision.",
            "Court_Ruling": "Allowed judicial review, set aside the decision, and referred back for re-determination.",
            "Claimant_Status": "Applicant was a temporary resident who overstayed her visa.",
            "Defendant_Behavior": "Failed to leave Canada upon visa expiration and applied for refugee protection.",
            "Grounds_for_Claim": "Fear of spousal abuse and lack of state protection in Jamaica.",
            "Legal_Standard": "Patent unreasonableness for credibility; reasonableness simpliciter for state protection.",
            "Assessment_Factor": "Delay in claiming refugee status and sufficiency of evidence on country conditions.",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Proper assessment of evidence and application of legal standards by the Board.",
            "Review_Standard": "Patent unreasonableness and reasonableness simpliciter",
            "Credibility_Assessment": "Board dismissed subjective fear due to long delay in claiming.",
            "Evidence_Used": "Personal testimony, documentation on domestic violence in Jamaica.",
            "Legal_Provision_Cited": "Section 97 and Section 98 of IRPA",
            "Application_Basis": "Refugee protection under Convention grounds (membership in a particular social group).",
            "Evidence_Assessed": "Threats from former partner, history of abuse, response of Jamaican authorities.",
            "Relief_Sought": "Recognition as a protected person and permanent residency.",
            "Governing_Rule": "Standard of review depends on the nature of the issue (credibility vs. legal interpretation).",
            "Evidentiary_Deficiency": "Insufficient analysis of state protection mechanisms in Jamaica.",
            "Outcome": "Judicial review allowed; decision set aside.",
            "Decisional_Body": "Immigration and Refugee Board (IRB)",
            "Harm_Assessment": "Risk of gender-based violence upon return to Jamaica.",
            "Cause_Description": "Applicant overstayed visa and claimed refugee status due to spousal abuse and lack of protection.",
            "Evidence_Handling": "Board failed to properly consider available evidence on domestic violence and state response.",
            "Legal_Provision_Violated": "Section 117(1) of IRPA (obligation to leave after visa expiry)",
            "Evidence_Issues": "Inadequate consideration of objective evidence on country conditions.",
            "Residency_Compliance": "Non-compliant due to overstaying authorized period.",
            "Misrepresentation_Element": "Not applicable",
            "Legal_Provision": "Sections 2(1), 96, 97, 117 of IRPA",
            "Jurisdictional_Issue": "Federal Court jurisdiction over immigration decisions.",
            "Evidence_Assessment": "Incomplete evaluation of both subjective and objective components of fear.",
            "Decision_Rationale": "Errors in assessing credibility and state protection rendered the decision patently unreasonable.",
            "Country_of_Origin": "Jamaica",
            "Decision_Making_Body": "Immigration and Refugee Board",
            "Evidentiary_Issues": "Failure to address documented deficiencies in state protection for abused women in Jamaica.",
            "Legal_Standard_Applied": "Reasonableness for state protection findings; patent unreasonableness for credibility"
        },
        {
            "Crime_Name": "Failure to comply with removal order",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Non-compliance with immigration enforcement action",
            "Legal_Issue": "Did the Board err in rejecting the applicant's claim for refugee protection based on fear of spousal abuse?",
            "Governing_Law": "Immigration and Refugee Protection Act",
            "Application_Facts": "Applicant remained in Canada despite rejection of refugee claim and issuance of removal order.",
            "Decision_Outcome": "Board upheld removal order; refugee claim denied.",
            "Remedy_Requested": "Judicial review to overturn the Board’s decision.",
            "Court_Ruling": "Allowed judicial review, set aside decision, remitted for re-determination.",
            "Claimant_Status": "Failed refugee claimant under removal order.",
            "Defendant_Behavior": "Remained in Canada after refugee claim rejection and refusal to comply with removal order.",
            "Grounds_for_Claim": "Fear of persecution due to spousal abuse and lack of state protection in Jamaica.",
            "Legal_Standard": "Patent unreasonableness for credibility; reasonableness for state protection.",
            "Assessment_Factor": "Credibility of fear, adequacy of protection mechanisms in country of origin.",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Adequacy of reasons provided by the Board regarding state protection.",
            "Review_Standard": "Patent unreasonableness and reasonableness",
            "Credibility_Assessment": "Board ignored evidence of threats and ongoing fear from former partner.",
            "Evidence_Used": "Affidavit, police reports, expert reports on domestic violence in Jamaica.",
            "Legal_Provision_Cited": "Section 115(1) of IRPA (removal order compliance)",
            "Application_Basis": "Refugee protection based on risk of gender-based violence.",
            "Evidence_Assessed": "History of abuse, failure of Jamaican authorities to protect, specific threats.",
            "Relief_Sought": "Suspension of removal and re-determination of refugee claim.",
            "Governing_Rule": "State protection must be both available and effective.",
            "Evidentiary_Deficiency": "Board inadequately assessed Jamaica’s capacity to protect women from domestic violence.",
            "Outcome": "Decision set aside; case remitted to new panel.",
            "Decisional_Body": "Immigration and Refugee Board",
            "Harm_Assessment": "Real risk of harm due to past abuse and systemic failures in Jamaica.",
            "Cause_Description": "Applicant feared returning to Jamaica due to spousal abuse but faced removal after claim denial.",
            "Evidence_Handling": "Board failed to engage with key evidence supporting both subjective and objective fear.",
            "Legal_Provision_Violated": "Section 115(1) of IRPA (duty to comply with removal order)",
            "Evidence_Issues": "Selective use of evidence and disregard of country condition reports.",
            "Residency_Compliance": "Non-compliant with removal order post-claim denial.",
            "Misrepresentation_Element": "Not applicable",
            "Legal_Provision": "Sections 114, 115, 135 of IRPA",
            "Jurisdictional_Issue": "Federal Court’s supervisory jurisdiction over IRB decisions.",
            "Evidence_Assessment": "Insufficient reasoning on why state protection was deemed adequate.",
            "Decision_Rationale": "Board failed to provide reasonable justification for dismissal of protection concerns.",
            "Country_of_Origin": "Jamaica",
            "Decision_Making_Body": "Immigration and Refugee Board",
            "Evidentiary_Issues": "Lack of meaningful engagement with evidence on domestic violence response in Jamaica.",
            "Legal_Standard_Applied": "Reasonableness standard applied to state protection findings."
        },
        {
            "Crime_Name": "Domestic abuse (non-specific charges without more details, potential charges could include Assault, Criminal Harassment, Threatening Death under the Criminal Code of Canada)",
            "Crime_Type": "Violent Crimes",
            "Dispute_Type": "Intimate partner violence",
            "Sub_Crime_Type": "Spousal abuse",
            "Perpetrator_Type": "Former intimate partner",
            "Victim_Status": "Female survivor of domestic violence",
            "Location_of_Incident": "Jamaica",
            "Threat_Source": "Former partner",
            "Aggravating_Factors": "Repeated abuse, threats of death, lack of intervention by authorities",
            "Mitigating_Factors": "No prior criminal record of perpetrator noted",
            "Prior_Criminality": "Not specified",
            "Criminality_Severity": "High – involving physical assault and psychological intimidation",
            "Evidence_Sufficiency": "Sufficient to establish pattern of abuse and fear",
            "Evidence_Type": "Affidavit, medical records, police reports, expert opinion on country conditions",
            "Evidence_Credibility": "Found credible by reviewing court despite Board's skepticism",
            "Credibility_Assessment": "Subjective fear supported by consistent narrative and corroborative evidence",
            "Risk_Assessment": "High risk of re-victimization upon return",
            "Risk_Type": "Gender-based violence",
            "Risk_Nature": "Targeted personal harm due to relationship dynamics and societal context",
            "Targeted_Victimization": "Yes – based on being a woman in an abusive relationship",
            "Targeted_Individual": "Applicant",
            "Targeted_Individual_Status": "Survivor of domestic abuse",
            "Geographic_Context": "Jamaica",
            "Jurisdiction": "Canadian Federal Court (reviewing conduct abroad for protection purposes)",
            "Legal_Framework": "Refugee law intersecting with criminal and human rights protections",
            "Governing_Law": "Criminal Code of Canada, Immigration and Refugee Protection Act",
            "Applicable_Statute": "Sections related to Assault, Criminal Harassment, Uttering Threats (Criminal Code), IRPA s. 96–98",
            "Legal_Provision": "Criminal Code sections 264 (criminal harassment), 267 (assault), 264.1 (stalking), 264.2 (intimate partner stalking), 265 (assault), 265(2)(b) (threatening death)",
            "Legal_Provision_Cited": "IRPA s. 96 defining Convention refugee including membership in a particular social group (women in Jamaica)",
            "Standard_of_Proof": "Balance of probabilities for refugee claims",
            "Decision_Outcome": "Board initially rejected claim; overturned on judicial review",
            "Outcome": "Case remitted for re-hearing due to inadequate assessment of harm and protection",
            "Sentencing_Issue": "Not applicable – matter pertains to immigration protection, not criminal sentencing",
            "Procedural_Issues": "Improper burden shifting and insufficient reasoning by the Board",
            "Procedural_Stage": "Judicial review stage following administrative determination",
            "Legal_Procedure": "Application for judicial review under Rule 387 of the Federal Courts Rules",
            "Decision_Maker": "Immigration and Refugee Board (initial), Federal Court (reviewing)",
            "Government_Body_Involved": "Immigration and Refugee Board, Immigration, Refugees and Citizenship Canada",
            "Reviewing_Body": "Federal Court of Canada",
            "Review_Mechanism": "Judicial review under the IRPA and Federal Courts Act",
            "Authority": "Federal Court has authority to set aside unreasonable administrative decisions",
            "Decision_Standard": "Reasonableness for legal conclusions, patent unreasonableness for credibility"
        }
    ]
}