{
    "Case ID": "011435",
    "Crime_Name": [
        "Citizenship Application Denial"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency non-compliance"
    ],
    "Legal_Issue": [
        "Whether the citizenship judge erred in applying the Koo test rather than the physical presence test"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Ms. Huang argued that the citizenship judge improperly applied the Koo test; however, the court found that judges may choose among three tests: centralized mode of living, Koo test, or physical presence test. Inconsistencies were found in Ms. Huang’s evidence regarding her presence in Canada."
    ],
    "Decision_Outcome": [
        "Appeal dismissed"
    ],
    "Remedy_Requested": [
        "Overturn of citizenship denial and approval of application"
    ],
    "Court_Ruling": [
        "Federal Court upheld the citizenship judge's decision"
    ],
    "Claimant_Status": [
        "Applicant for Canadian citizenship"
    ],
    "Defendant_Behavior": [
        "Citizenship judge applied the Koo test to assess residency"
    ],
    "Grounds_for_Claim": [
        "Alleged error in legal test applied and procedural fairness concerns"
    ],
    "Legal_Standard": [
        "Koo test (regularly/normally/customarily lives), physical presence test, centralized mode of living"
    ],
    "Assessment_Factor": [
        "Residency patterns, consistency of evidence, language proficiency"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Challenge to procedural fairness in the assessment process"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Inconsistencies in Ms. Huang’s evidence affected credibility"
    ],
    "Evidence_Used": [
        "Testimony, documentation of travel and residence, language test results"
    ],
    "Legal_Provision_Cited": [
        "Sections of the Citizenship Act relating to residence and language requirements"
    ],
    "Application_Basis": [
        "Failure to demonstrate sufficient residential connection to Canada under the Koo test"
    ],
    "Evidence_Assessed": [
        "Patterns of presence in Canada, duration of stays, ties to Canada"
    ],
    "Relief_Sought": [
        "Granting of Canadian citizenship"
    ],
    "Governing_Rule": [
        "The Koo test is an acceptable method for assessing residency under established jurisprudence"
    ],
    "Evidentiary_Deficiency": [
        "Inconsistent evidence regarding time spent in Canada"
    ],
    "Outcome": [
        "Denial of citizenship application upheld"
    ],
    "Decisional_Body": [
        "Citizenship Judge, Federal Court"
    ],
    "Harm_Assessment": [
        "No harm established due to reasonable application of law"
    ],
    "Cause_Description": [
        "Ms. Huang's application for Canadian citizenship was denied due to alleged non-compliance with residency requirements"
    ],
    "Evidence_Handling": [
        "Court reviewed applicant's evidence and identified inconsistencies"
    ],
    "Legal_Provision_Violated": [
        "Residency requirement under the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Discrepancies in self-reported presence and supporting documents"
    ],
    "Residency_Compliance": [
        "Not satisfied according to the Koo test"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act – Residency and language proficiency requirements"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Judge conducted factual analysis based on available evidence"
    ],
    "Decision_Rationale": [
        "The citizenship judge reasonably applied the Koo test within accepted legal framework and supported by evidence"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Federal Court of Canada"
    ],
    "Evidentiary_Issues": [
        "Inconsistencies in applicant's account of physical presence"
    ],
    "Legal_Standard_Applied": [
        "Koo test for determining habitual residence"
    ]
}