{
    "Case ID": "011899",
    "Crimes": [
        {
            "Crime_Name": "Overstaying visa",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration status violation",
            "Legal_Issue": "Did the Board err in rejecting the applicant's refugee claim due to lack of subjective and objective fear and inadequate state protection analysis?",
            "Governing_Law": "Immigration and Refugee Protection Act",
            "Application_Facts": "Applicant overstayed her visa and sought refugee status based on fear of spousal abuse in Jamaica.",
            "Decision_Outcome": "The application for judicial review is allowed; case referred back to a different panel of the Immigration and Refugee Board for re-determination.",
            "Remedy_Requested": "Judicial review of the Board's decision",
            "Court_Ruling": "Allowed",
            "Claimant_Status": "Applicant seeking refugee protection",
            "Defendant_Behavior": "Overstayed visa and failed to leave Canada upon expiration of authorized stay",
            "Grounds_for_Claim": "Fear of spousal abuse in Jamaica",
            "Legal_Standard": "Patent unreasonableness for credibility findings; reasonableness simpliciter for state protection findings",
            "Assessment_Factor": "Credibility of fear, adequacy of state protection in Jamaica",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Judicial review of administrative decision",
            "Review_Standard": "Patent unreasonableness and reasonableness simpliciter",
            "Credibility_Assessment": "Board found lack of subjective and objective fear; court found this assessment patently unreasonable",
            "Evidence_Used": "Testimony of applicant, documentary evidence on country conditions in Jamaica",
            "Legal_Provision_Cited": "Section 97 and Section 98 of IRPA regarding refugee protection",
            "Application_Basis": "Refugee claim based on well-founded fear of persecution due to domestic violence",
            "Evidence_Assessed": "Threats from ex-partner, history of domestic abuse, response of Jamaican authorities",
            "Relief_Sought": "Recognition as a Convention refugee and protection from removal",
            "Governing_Rule": "Standard of review depends on nature of issue: credibility vs. state protection",
            "Evidentiary_Deficiency": "Board ignored key evidence showing credible fear and inadequate state protection",
            "Outcome": "Decision set aside, remitted to new panel",
            "Decisional_Body": "Immigration and Refugee Board of Canada",
            "Harm_Assessment": "Risk of serious harm due to domestic violence upon return to Jamaica",
            "Cause_Description": "Applicant overstayed visa after entering Canada lawfully and claimed refugee status fearing return to abusive partner",
            "Evidence_Handling": "Board failed to properly consider or address relevant evidence",
            "Legal_Provision_Violated": "Section 117(1) of IRPA (failure to comply with conditions or expiry of status)",
            "Evidence_Issues": "Selective use of evidence, disregard of corroborative documentation",
            "Residency_Compliance": "Failed to maintain legal status beyond authorized period",
            "Misrepresentation_Element": "Not applicable",
            "Legal_Provision": "IRPA sections 2(1), 96, 97, 117",
            "Jurisdictional_Issue": "Federal Court jurisdiction over immigration decisions",
            "Evidence_Assessment": "Insufficient and unreasonable evaluation of applicant’s evidence",
            "Decision_Rationale": "Board’s conclusions were not supported by the evidence and lacked proper analysis",
            "Country_of_Origin": "Jamaica",
            "Decision_Making_Body": "Immigration and Refugee Board",
            "Evidentiary_Issues": "Failure to account for documented patterns of domestic violence and ineffective police response in Jamaica",
            "Legal_Standard_Applied": "Patent unreasonableness and reasonableness"
        },
        {
            "Crime_Name": "Failure to comply with removal order",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Non-compliance with removal order",
            "Legal_Issue": "Did the Board err in rejecting the applicant's claim for refugee protection based on fear of spousal abuse?",
            "Governing_Law": "Immigration and Refugee Protection Act",
            "Application_Facts": "Applicant feared returning to Jamaica due to spousal abuse and applied for refugee protection in Canada.",
            "Decision_Outcome": "Application for judicial review allowed; case referred back to the Board for re-determination by a different panel.",
            "Remedy_Requested": "Judicial review of the Board's refusal of refugee protection",
            "Court_Ruling": "Allowed",
            "Claimant_Status": "Applicant under removal order seeking relief based on risk upon return",
            "Defendant_Behavior": "Remaining in Canada after issuance of a removal order",
            "Grounds_for_Claim": "Fear of spousal abuse and lack of state protection in Jamaica",
            "Legal_Standard": "Patent unreasonableness for credibility findings; reasonableness for state protection analysis",
            "Assessment_Factor": "Credibility of threats, effectiveness of state protection mechanisms in Jamaica",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Judicial review challenging procedural fairness and substantive assessment",
            "Review_Standard": "Reasonableness and patent unreasonableness depending on issue type",
            "Credibility_Assessment": "Board dismissed fear; court found such dismissal unreasonable given supporting evidence",
            "Evidence_Used": "Personal testimony, country condition reports on domestic violence in Jamaica",
            "Legal_Provision_Cited": "Section 96 and Section 97 of IRPA",
            "Application_Basis": "Refugee protection claim grounded in gender-based persecution and state inability to protect",
            "Evidence_Assessed": "History of abuse, police inaction, ongoing threats from ex-partner",
            "Relief_Sought": "Cancellation of removal order and recognition as a protected person",
            "Governing_Rule": "Review standards vary by nature of legal issue",
            "Evidentiary_Deficiency": "Board misinterpreted country conditions and overlooked critical evidence",
            "Outcome": "Decision set aside, remitted for redetermination",
            "Decisional_Body": "Immigration and Refugee Board of Canada",
            "Harm_Assessment": "High risk of domestic violence and potential fatality if returned to Jamaica",
            "Cause_Description": "Applicant remained in Canada despite removal order due to fear of life-threatening domestic abuse",
            "Evidence_Handling": "Inadequate consideration of documentary evidence on systemic failures in Jamaica",
            "Legal_Provision_Violated": "Section 44(1) of IRPA (failure to comply with removal order)",
            "Evidence_Issues": "Misinterpretation and selective reliance on country information",
            "Residency_Compliance": "Failed to depart Canada as required by removal order",
            "Misrepresentation_Element": "Not applicable",
            "Legal_Provision": "IRPA sections 44, 96, 97",
            "Jurisdictional_Issue": "Federal Court authority to review final decisions of the IRB",
            "Evidence_Assessment": "Flawed analysis of both personal and country evidence",
            "Decision_Rationale": "Board’s conclusion was unreasonable due to insufficient engagement with evidence",
            "Country_of_Origin": "Jamaica",
            "Decision_Making_Body": "Immigration and Refugee Board",
            "Evidentiary_Issues": "Failure to recognize pattern of domestic violence and institutional neglect in Jamaica",
            "Legal_Standard_Applied": "Reasonableness and patent unreasonableness"
        }
    ]
}