{
    "Case ID": "012007",
    "Crime_Name": [
        "Administrative Error in Immigration Process"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the immigration officer properly notify Mr. Ilahi of his scheduled interview?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Mr. Ilahi diligently updated his contact information and requested adequate notice. The respondent lacks direct evidence that the interview notice was sent to the correct address."
    ],
    "Decision_Outcome": [
        "The application for judicial review is allowed, and a re-assessment by a different officer is ordered."
    ],
    "Remedy_Requested": [
        "Judicial review of the decision denying Mr. Ilahi's application"
    ],
    "Court_Ruling": [
        "In favor of Mr. Ilahi"
    ],
    "Claimant_Status": [
        "Applicant in immigration process"
    ],
    "Defendant_Behavior": [
        "Failure to provide evidence of proper notification"
    ],
    "Grounds_for_Claim": [
        "Alleged failure to attend an interview due to non-receipt of notice"
    ],
    "Legal_Standard": [
        "The respondent must prove that an interview notice was sent to the correct address, which the applicant is responsible for keeping updated."
    ],
    "Assessment_Factor": [],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Whether proper procedures were followed in notifying the applicant"
    ],
    "Review_Standard": [
        "Judicial review"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Lack of direct evidence that notice was sent"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Request for judicial review based on procedural error"
    ],
    "Evidence_Assessed": [
        "Absence of proof of mailing or delivery of interview notice"
    ],
    "Relief_Sought": [
        "Reassessment of application with proper interview"
    ],
    "Governing_Rule": [
        "Respondent bears burden of proving notice was sent to correct address"
    ],
    "Evidentiary_Deficiency": [
        "Respondent lacks direct evidence that the interview notice was sent"
    ],
    "Outcome": [
        "Application for judicial review allowed; new assessment ordered"
    ],
    "Decisional_Body": [
        "Court"
    ],
    "Harm_Assessment": [
        "Unfair denial of application due to potential lack of notice"
    ],
    "Cause_Description": [
        "Mr. Ilahi's application was denied due to alleged failure to attend an interview he claims he never received notice of."
    ],
    "Evidence_Handling": [
        "Court noted absence of documentation confirming mailing"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "No verifiable proof of notification sent"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Insufficient evidence from respondent to prove compliance"
    ],
    "Decision_Rationale": [
        "Applicant kept address updated; burden on respondent to prove notice, which was not met"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Immigration authority (initial), Court (review)"
    ],
    "Evidentiary_Issues": [
        "Lack of documentary or electronic proof of notice dispatch"
    ],
    "Legal_Standard_Applied": [
        "Burden of proof on respondent to demonstrate proper notification"
    ]
}