{
    "Case ID": "017810",
    "Crimes": [
        {
            "Crime_Name": "Overstaying visa",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration Violation",
            "Legal_Issue": "Can the court grant a stay of execution of a departure order under s. 18.2 of the Federal Court Act?",
            "Governing_Law": "Federal Court Act, s. 18.2; Immigration and Refugee Protection Regulations, s. 27(1)(a)",
            "Application_Facts": "Applicant overstayed her visa, married in Canada, and had a child. She claims irreparable harm due to family separation if removed.",
            "Decision_Outcome": "Stay request denied",
            "Remedy_Requested": "Stay of departure order to challenge adjudicator's decision",
            "Court_Ruling": "Court has jurisdiction but dismissed application due to lack of irreparable harm",
            "Claimant_Status": "Applicant with expired visa, married to Canadian resident",
            "Defendant_Behavior": "Voluntary overstay of authorized period without applying for status extension",
            "Grounds_for_Claim": "Family ties in Canada, risk of separation from spouse and child",
            "Legal_Standard": "Demonstration of irreparable harm required for interim stay under s. 18.2",
            "Assessment_Factor": "Potential for family separation, availability of voluntary departure to avoid deportation",
            "Applicable_Legislation": "Federal Court Act, s. 18.2; Immigration and Refugee Protection Regulations, s. 27(1)(a)",
            "Procedural_Issue": "Judicial review of refusal to sever inquiry from spouse's case",
            "Review_Standard": "Reasonableness and jurisdictional scope under statutory framework",
            "Credibility_Assessment": "Not explicitly challenged, but claims not supported by medical or psychological evidence",
            "Evidence_Used": "Marriage certificate, birth certificate of child, personal affidavit",
            "Legal_Provision_Cited": "Federal Court Act, s. 18.2; Immigration and Refugee Protection Regulations, s. 27(1)(a)",
            "Application_Basis": "Request for interim relief pending judicial review",
            "Evidence_Assessed": "Affidavit evidence on family life in Canada",
            "Relief_Sought": "Interim stay of departure order",
            "Governing_Rule": "Stay requires irreparable harm and serious issue under s. 18.2",
            "Evidentiary_Deficiency": "No proof of grave harm (e.g., threat to life, safety, or health); no expert evidence on psychological impact",
            "Outcome": "Application dismissed; no stay granted",
            "Decisional_Body": "Federal Court",
            "Harm_Assessment": "Family separation acknowledged but not deemed irreparable under law",
            "Cause_Description": "Applicant overstayed visa and received departure order; sought stay to pursue legal challenge",
            "Evidence_Handling": "Affidavit evidence considered but found insufficient to establish irreparable harm",
            "Legal_Provision_Violated": "Immigration and Refugee Protection Act (implied through overstay)",
            "Evidence_Issues": "Lack of objective or expert evidence to support severity of claimed harm",
            "Residency_Compliance": "Failed to maintain legal status after visa expiration",
            "Misrepresentation_Element": "Not applicable",
            "Legal_Provision": "Federal Court Act, s. 18.2",
            "Jurisdictional_Issue": "Whether court has authority to stay a departure order",
            "Evidence_Assessment": "Subjective claims accepted but not sufficient to meet legal threshold",
            "Decision_Rationale": "Voluntary departure avoids deportation consequences; no irreparable harm shown",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Federal Court of Canada",
            "Evidentiary_Issues": "Absence of medical or psychological documentation supporting harm claim",
            "Legal_Standard_Applied": "Irreparable harm standard under s. 18.2 of the Federal Court Act"
        },
        {
            "Crime_Name": "Misrepresentation under Immigration Act",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration Misrepresentation",
            "Legal_Issue": "Does the court have jurisdiction to stay a departure order, and does the applicant demonstrate irreparable harm?",
            "Governing_Law": "Federal Court Act, s. 18.2",
            "Application_Facts": "Applicant overstayed visa, married, had child; husband faced misrepresentation charges; joint inquiry led to departure order. Claims harm from family separation and inability to return without Minister’s Permit.",
            "Decision_Outcome": "Stay request denied",
            "Remedy_Requested": "Stay of departure order to challenge procedural fairness of joint inquiry",
            "Court_Ruling": "Jurisdiction exists but no irreparable harm demonstrated",
            "Claimant_Status": "Spouse of individual accused of misrepresentation, overstayed visitor status",
            "Defendant_Behavior": "Remained in Canada beyond visa expiry; linked to partner’s immigration proceedings involving misrepresentation",
            "Grounds_for_Claim": "Risk of family separation, difficulty re-entering Canada without authorization",
            "Legal_Standard": "Requirement to show irreparable harm for interim relief under s. 18.2",
            "Assessment_Factor": "Availability of voluntary departure, absence of physical or psychological endangerment",
            "Applicable_Legislation": "Federal Court Act, s. 18.2",
            "Procedural_Issue": "Judicial review of procedural aspects of immigration inquiry",
            "Review_Standard": "Standard of reasonableness and jurisdictional limits",
            "Credibility_Assessment": "Claims treated as genuine but not legally compelling",
            "Evidence_Used": "Affidavits regarding family life, marriage, and child custody",
            "Legal_Provision_Cited": "Federal Court Act, s. 18.2",
            "Application_Basis": "Seeking interim relief during appeal or review process",
            "Evidence_Assessed": "Personal affidavits on familial bonds and emotional hardship",
            "Relief_Sought": "Interim stay of removal order",
            "Governing_Rule": "Interim relief only if irreparable harm is proven",
            "Evidentiary_Deficiency": "No medical records or expert testimony on psychological impact",
            "Outcome": "Application dismissed; no stay granted",
            "Decisional_Body": "Federal Court",
            "Harm_Assessment": "Emotional hardship recognized but not classified as irreparable under law",
            "Cause_Description": "Applicant overstayed visa and sought stay of departure order amid spouse's misrepresentation proceedings",
            "Evidence_Handling": "Documentary evidence reviewed but deemed insufficient to meet legal burden",
            "Legal_Provision_Violated": "Immigration and Refugee Protection Act (misrepresentation provisions, implied via spouse’s case)",
            "Evidence_Issues": "Lack of objective corroboration for claimed harm",
            "Residency_Compliance": "Unauthorized stay following visa expiration",
            "Misrepresentation_Element": "Alleged indirect implication through association with spouse under investigation",
            "Legal_Provision": "Federal Court Act, s. 18.2",
            "Jurisdictional_Issue": "Existence of court power to issue stay of departure order",
            "Evidence_Assessment": "Subjective hardship noted but not meeting threshold for irreparable harm",
            "Decision_Rationale": "Voluntary compliance avoids penalties; no evidence of extreme consequences",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Federal Court of Canada",
            "Evidentiary_Issues": "Failure to provide clinical or documentary support for psychological harm",
            "Legal_Standard_Applied": "Irreparable harm standard under s. 18.2 of the Federal Court Act"
        }
    ]
}