{
    "Case ID": "021370",
    "Crime_Name": [
        "Citizenship Residency Requirement"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Citizenship Court err in assessing Ms. Mueller's claim to constructive residency under the Citizenship Act?"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Ms. Mueller was absent from Canada for 783 days during the required period but maintained significant ties, including employment with the Canadian High Commission, paying Canadian taxes, and preserving a Canadian household."
    ],
    "Decision_Outcome": [
        "The Citizenship Court erred by not clearly applying the centralized mode of living test or explaining why Ms. Mueller's evidence was insufficient."
    ],
    "Remedy_Requested": [
        "Appeal to Federal Court arguing error in residency assessment"
    ],
    "Court_Ruling": [
        "Appeal allowed; case remanded to a different Citizenship Court judge for reassessment."
    ],
    "Claimant_Status": [
        "Ms. Mueller"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Failure to meet physical residency requirement despite maintaining strong residential ties to Canada."
    ],
    "Legal_Standard": [
        "Constructive residency can be established if an applicant centralizes their ordinary mode of living in Canada, even without meeting the physical presence requirement."
    ],
    "Assessment_Factor": [
        "Centralized mode of living in Canada",
        "Employment with Canadian High Commission",
        "Payment of Canadian taxes",
        "Maintenance of Canadian household"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Remand to a different Citizenship Court judge for re-determination"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Employment records with Canadian High Commission",
        "Tax filings in Canada",
        "Proof of maintained Canadian household"
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act – Constructive Residency"
    ],
    "Application_Basis": [
        "Claim for citizenship based on constructive residency"
    ],
    "Evidence_Assessed": [
        "Duration of absence (783 days)",
        "Ties to Canada including employment, taxation, and residence"
    ],
    "Relief_Sought": [
        "Grant of citizenship following proper assessment of constructive residency"
    ],
    "Governing_Rule": [
        "Constructive residency based on centralization of mode of living"
    ],
    "Evidentiary_Deficiency": [
        "Citizenship Court failed to adequately explain rejection of evidence or apply correct legal test"
    ],
    "Outcome": [
        "Appeal allowed; case remanded"
    ],
    "Decisional_Body": [
        "Citizenship Court",
        "Federal Court (Judge Barnes)"
    ],
    "Harm_Assessment": [
        "Unjust denial of citizenship due to incorrect application of residency rules"
    ],
    "Cause_Description": [
        "Ms. Mueller's application for citizenship was denied due to failure to meet the residency requirement."
    ],
    "Evidence_Handling": [
        "Evidence of ties to Canada was presented but not properly assessed by the Citizenship Court"
    ],
    "Legal_Provision_Violated": [
        "Citizenship Act – Residency requirements for naturalization"
    ],
    "Evidence_Issues": [
        "Insufficient explanation from Citizenship Court regarding why evidence did not meet constructive residency standard"
    ],
    "Residency_Compliance": [
        "Physical presence not met, but constructive residency potentially established"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act, constructive residency provisions"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Evidence of employment, taxes, and household ties were relevant and sufficient to require reconsideration"
    ],
    "Decision_Rationale": [
        "The Court must clearly apply the centralized mode of living test when assessing constructive residency claims."
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Court",
        "Federal Court"
    ],
    "Evidentiary_Issues": [
        "Lack of clear reasoning on why applicant’s evidence failed to establish constructive residency"
    ],
    "Legal_Standard_Applied": [
        "Centralized mode of living test for constructive residency"
    ]
}