{
    "Case ID": "023842",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Board erred in determining that the respondents were Convention refugees due to inadequate state protection and indirect persecution"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The mother's fear of spousal abuse was found justified, based on her Roma ethnicity and societal attitudes. The daughter’s claim was based on witnessing abuse. Police reports indicated some state intervention but no conclusive outcomes."
    ],
    "Decision_Outcome": [
        "The Federal Court allowed the judicial review, finding the Board erred by relying on subjective feelings and setting too high a standard for state protection."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "The Board's decision was quashed, and the case was remanded for redetermination."
    ],
    "Claimant_Status": [
        "Mother and daughter claiming refugee status as Convention refugees"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Well-founded fear of persecution based on spousal abuse (mother), indirect persecution through witnessing abuse (daughter), Roma ethnicity, and lack of adequate state protection"
    ],
    "Legal_Standard": [
        "A claimant must demonstrate a well-founded fear of persecution and lack of adequate state protection; subjective feelings alone are insufficient—objective evidence is required."
    ],
    "Assessment_Factor": [
        "Credibility of fear, Roma ethnicity, societal attitudes toward domestic violence, effectiveness of state protection, police response"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Judicial review before the Federal Court of Canada, Trial Division, analyzing the Board's reasoning and evidence"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [
        "The Board found the mother's fear justified, but the Court found overreliance on subjective feelings"
    ],
    "Evidence_Used": [
        "Police reports showing some state intervention but no conclusive outcomes"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Fear of persecution due to domestic violence, Roma identity, and failure of state protection"
    ],
    "Evidence_Assessed": [
        "Police reports, personal testimony regarding abuse and ethnic background"
    ],
    "Relief_Sought": [
        "Recognition as Convention refugees and protection under Canadian immigration law"
    ],
    "Governing_Rule": [
        "A claimant must show a well-founded fear of persecution and absence of adequate state protection with objective evidence"
    ],
    "Evidentiary_Deficiency": [
        "Subjective feelings considered without sufficient objective corroboration"
    ],
    "Outcome": [
        "Decision quashed, case remanded for redetermination"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Risk of domestic violence and indirect persecution to the daughter"
    ],
    "Cause_Description": [
        "The Minister challenged the Board's decision, arguing errors in assessing state protection and indirect persecution"
    ],
    "Evidence_Handling": [
        "Board relied on subjective elements; insufficient evaluation of objective evidence on state protection"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Insufficient objective evidence to support claims; overreliance on subjective fear"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Objective evidence such as police records was present but not determinative; Board failed to properly assess adequacy of state protection"
    ],
    "Decision_Rationale": [
        "The Board erred by considering subjective feelings and applying an overly stringent standard for state protection"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Lack of conclusive outcomes in police reports, insufficient corroboration of state protection failure"
    ],
    "Legal_Standard_Applied": [
        "Well-founded fear of persecution, need for objective evidence, adequacy of state protection"
    ]
}