{
    "Case ID": "024022",
    "Crime_Name": [
        "Pre-Removal Risk Assessment (PRRA) Appeal"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Officer's decision to deny PRRA was reasonable, considering new evidence of gender-based violence"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The principal applicant claimed rape-related scars as new evidence; however, the RPD had already considered her rape allegation. The Officer found no significant new evidence or personalized risk in Albania."
    ],
    "Decision_Outcome": [
        "The Officer's decision was reasonable as it adhered to legal standards and considered all presented evidence."
    ],
    "Remedy_Requested": [
        "Judicial review after PRRA denial due to alleged blood feud and gender-based violence risks in Albania"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed; no certification question proposed"
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Alleged blood feud and gender-based violence risks in Albania"
    ],
    "Legal_Standard": [
        "A PRRA is not an appeal of a previous RPD decision but assesses new risks since the rejection. The applicant must demonstrate changed conditions or circumstances."
    ],
    "Assessment_Factor": [
        "Presence of new evidence, personalized risk, changed country conditions"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Procedural fairness in the PRRA assessment"
    ],
    "Review_Standard": [
        "Reasonableness of the Officer's decision"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Rape-related scars, allegations of gender-based violence"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "New evidence of gender-based violence and fear of return to Albania"
    ],
    "Evidence_Assessed": [
        "Rape allegation previously considered by RPD, lack of new or specific evidence of current risk"
    ],
    "Relief_Sought": [
        "Overturning of PRRA denial and recognition of risk upon removal to Albania"
    ],
    "Governing_Rule": [
        "PRRA assesses new risks since the last decision; does not re-litigate prior claims"
    ],
    "Evidentiary_Deficiency": [
        "No significant new evidence or personalized risk demonstrated"
    ],
    "Outcome": [
        "PRRA denied; judicial review dismissed"
    ],
    "Decisional_Body": [
        "Immigration Officer, Federal Court (on judicial review)"
    ],
    "Harm_Assessment": [
        "Risk of gender-based violence and blood feud in Albania"
    ],
    "Cause_Description": [
        "Applicants sought judicial review after PRRA denial due to alleged blood feud and gender-based violence risks in Albania"
    ],
    "Evidence_Handling": [
        "Officer considered all evidence, determined prior allegations were already assessed and no new evidence established heightened risk"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Duplication of previously considered evidence, lack of corroboration or specificity for current risk"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The Officer assessed that the evidence did not establish a new or increased personal risk in Albania"
    ],
    "Decision_Rationale": [
        "The decision was reasonable because the Officer applied the correct legal framework and found no new evidence indicating a substantial risk upon return"
    ],
    "Country_of_Origin": [
        "Albania"
    ],
    "Decision_Making_Body": [
        "Immigration Officer conducting PRRA, Federal Court on judicial review"
    ],
    "Evidentiary_Issues": [
        "Failure to present new, credible, and specific evidence of personal risk since the RPD decision"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard in administrative decision-making; requirement to show changed circumstances or new evidence"
    ]
}