{
    "Case ID": "024384",
    "Crime_Name": [
        "Discrimination in Employment"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Tribunal erred in dismissing the Applicant's claim of discrimination based on race, ethnic or national origin, and colour"
    ],
    "Governing_Law": [
        "Canadian Human Rights Act"
    ],
    "Application_Facts": [
        "Mr. Khiamal alleged racial bias in Greyhound's hiring process, claiming he was not promoted to Foreman due to his race"
    ],
    "Decision_Outcome": [
        "The Tribunal's decision was found unreasonable; judicial review granted"
    ],
    "Remedy_Requested": [
        "Re-determination of the discrimination complaint"
    ],
    "Court_Ruling": [
        "The matter is remitted to a differently constituted tribunal for re-determination"
    ],
    "Claimant_Status": [
        "Applicant: Mr. Khiamal"
    ],
    "Defendant_Behavior": [
        "Greyhound's hiring decision influenced by personal animosity; potential racial bias not adequately assessed"
    ],
    "Grounds_for_Claim": [
        "Race, national or ethnic origin, colour"
    ],
    "Legal_Standard": [
        "Prima facie case of discrimination; burden shifting framework"
    ],
    "Assessment_Factor": [
        "Influence of personal animosity vs. racial factors in hiring decision"
    ],
    "Applicable_Legislation": [
        "Canadian Human Rights Act"
    ],
    "Procedural_Issue": [
        "Judicial review under section 18.1 of the Federal Courts Act"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Statistical evidence of minority under-representation",
        "Tribunal findings on personal animosity"
    ],
    "Legal_Provision_Cited": [
        "Section 18.1, Federal Courts Act",
        "Canadian Human Rights Act provisions on employment discrimination"
    ],
    "Application_Basis": [
        "Refusal of promotion based on protected grounds"
    ],
    "Evidence_Assessed": [
        "Failure to consider statistical data and whether race was a contributing factor"
    ],
    "Relief_Sought": [
        "Judicial review and re-determination of discrimination claim"
    ],
    "Governing_Rule": [
        "It is discriminatory under the Canadian Human Rights Act to refuse employment based on race, national or ethnic origin, or colour"
    ],
    "Evidentiary_Deficiency": [
        "Tribunal failed to analyze whether race was a factor and ignored statistical evidence"
    ],
    "Outcome": [
        "Judicial review granted; case remitted for re-determination"
    ],
    "Decisional_Body": [
        "Human Rights Tribunal"
    ],
    "Harm_Assessment": [
        "Potential discriminatory denial of promotion affecting employment opportunity"
    ],
    "Cause_Description": [
        "Alleged racial bias in Greyhound's failure to promote Mr. Khiamal to Foreman"
    ],
    "Evidence_Handling": [
        "Statistical evidence of under-representation not properly considered"
    ],
    "Legal_Provision_Violated": [
        "Canadian Human Rights Act - Prohibition of employment discrimination based on race, colour, national or ethnic origin"
    ],
    "Evidence_Issues": [
        "Insufficient analysis of race as a factor; omission of relevant statistical data"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Canadian Human Rights Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Tribunal did not adequately assess whether discrimination played a role"
    ],
    "Decision_Rationale": [
        "Decision unreasonable due to failure to assess animus in context of discrimination and ignoring key evidence"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Human Rights Tribunal"
    ],
    "Evidentiary_Issues": [
        "Failure to consider statistical evidence and intersection of animosity with racial factors"
    ],
    "Legal_Standard_Applied": [
        "Prima facie discrimination standard under human rights law"
    ]
}