{
    "Case ID": "025277",
    "Crime_Name": [
        "Trademark Infringement"
    ],
    "Crime_Type": [
        "Property Crimes"
    ],
    "Dispute_Type": [
        "Trademark infringement liability"
    ],
    "Legal_Issue": [
        "Personal liability of director for trademark infringement"
    ],
    "Governing_Law": [
        "Common law principles on personal liability of directors in intellectual property infringement"
    ],
    "Procedural_Stage": [
        "Summary judgment"
    ],
    "Evidence_Assessment": [
        "Mr. Kichuk conducted a trademark search, had no prior knowledge of 'ISO-FLEX', and made inquiries after receiving a cease and desist letter; plaintiffs provided no contradictory evidence"
    ],
    "Decision_Outcome": [
        "No genuine issue for trial"
    ],
    "Burden_of_Proof": [
        "Plaintiffs failed to meet burden of showing genuine issue of material fact"
    ],
    "Credibility_Factor": [
        "No evidence undermining Mr. Kichuk's assertions was presented"
    ],
    "Legal_Rule": [
        "Directors and officers are personally liable if they deliberately, willfully, and knowingly pursue conduct likely to infringe or show indifference to the risk of infringement"
    ],
    "Standard_of_Review": [
        "Summary judgment standard – whether a genuine issue for trial exists"
    ],
    "Procedural_Issue": [
        "Motion for summary judgment"
    ],
    "Grounds_for_Claim": [
        "Alleged deliberate actions by Mr. Kichuk leading to trademark infringement"
    ],
    "Outcome_on_Merits": [
        "Claim dismissed against Mr. Kichuk and Mr. Glover"
    ],
    "Decision_Maker": [
        "Court"
    ],
    "Judicial_Review_Outcome": [
        "Summary judgment granted in favor of defendants"
    ],
    "Review_Standard": [
        "De novo review of legal standards, factual disputes assessed for materiality"
    ],
    "Procedural_Fairness_Assessment": [
        "Defendant given opportunity to respond; plaintiffs failed to produce counterevidence"
    ],
    "Key_Evidence_Considered": [
        "Trademark search conducted by Mr. Kichuk, lack of prior knowledge, post-notice inquiries"
    ],
    "Legal_Framework": [
        "Intellectual property law, corporate officer liability doctrine"
    ],
    "Applicant_Challenge": [
        "Plaintiffs' inability to demonstrate personal involvement or intent by Mr. Kichuk"
    ],
    "Court_Result": [
        "Action dismissed with costs"
    ],
    "Legal_Rule_Source": [
        "Case law on personal liability in trademark infringement"
    ],
    "Standard_of_Proof": [
        "Preponderance of evidence"
    ],
    "Defendant_Response": [
        "Mr. Kichuk acted without knowledge and conducted due diligence"
    ],
    "Evidence_Type": [
        "Documentary evidence (trademark search), conduct after notice"
    ],
    "Remedy_Requested": [
        "Injunctive relief and damages (implied from cease and desist)"
    ],
    "Outcome": [
        "Summary judgment granted; claim dismissed"
    ],
    "Decision_Authority": [
        "Trial court"
    ],
    "Remedy_Sought": [
        "Dismissal of claims"
    ],
    "Resolution_Mechanism": [
        "Summary judgment"
    ],
    "Legal_Provision": [
        "Implied under trademark law and principles of corporate liability"
    ],
    "Authority": [
        "Court"
    ],
    "Claimant_Status": [
        "Trademark owner alleging infringement"
    ],
    "Legal_Provision_Cited": [],
    "Grounds_for_Inadmissibility_or_Allegation": [
        "Lack of evidence supporting personal liability"
    ],
    "Applicable_Process": [
        "Civil litigation procedure"
    ],
    "Outcome_of_Review": [
        "Defendants prevail"
    ],
    "Pending_Relief_or_Application": [
        "Motion for summary judgment"
    ],
    "Jurisdiction": [
        "Implied: Federal or state court with IP jurisdiction"
    ],
    "Governing_Rule": [
        "Personal liability requires deliberate, willful, and knowing conduct or indifference to infringement risk"
    ]
}