{
    "Case ID": "025444",
    "Crime_Name": [
        "Refugee Protection Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the PRRA officer's decision to reject Ms. Augusto's application for protection was based on insufficient evidence and unreasonable"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Application_Facts": [
        "Ms. Augusto feared persecution in Angola due to her cousin's murder and mother's imprisonment; she sought refugee protection in Canada"
    ],
    "Decision_Outcome": [
        "PRRA application rejected"
    ],
    "Remedy_Requested": [
        "Judicial review of the PRRA officer's decision"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed"
    ],
    "Claimant_Status": [
        "Refugee claimant"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Risk of persecution or danger upon return to Angola"
    ],
    "Legal_Standard": [
        "Reasonableness standard"
    ],
    "Assessment_Factor": [
        "Evidence of risk, credibility of personal claims vs. documentary evidence"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Procedural_Issue": [
        "Refugee claim dismissed by RPD, PRRA application rejected, judicial review sought in Federal Court"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "PRRA officer gave little weight to personal claims due to credible documentary evidence showing peace and amnesty in Angola"
    ],
    "Evidence_Used": [
        "Police notification, friend's letter, reports of human rights abuses, documentary evidence of peace and amnesty in Angola"
    ],
    "Legal_Provision_Cited": [
        "IRPA provisions on PRRA and risk assessment"
    ],
    "Application_Basis": [
        "Fear of persecution based on family incidents and political situation in Angola"
    ],
    "Evidence_Assessed": [
        "Personal affidavits, third-party letters, country condition reports"
    ],
    "Relief_Sought": [
        "Granting of refugee protection or reversal of PRRA rejection"
    ],
    "Governing_Rule": [
        "PRRA officer must assess evidence of risk of persecution or danger upon return under IRPA"
    ],
    "Evidentiary_Deficiency": [
        "Insufficient evidence to overcome country condition reports"
    ],
    "Outcome": [
        "Claim for protection denied"
    ],
    "Decisional_Body": [
        "PRRA Officer, Federal Court"
    ],
    "Harm_Assessment": [
        "Alleged risk of persecution in Angola"
    ],
    "Cause_Description": [
        "Ms. Augusto feared persecution in Angola after her cousin's murder and mother's imprisonment"
    ],
    "Evidence_Handling": [
        "PRRA officer considered all evidence but prioritized credible documentary evidence over personal claims"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Weight given to personal testimony versus official country documentation"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "IRPA sections related to Pre-Removal Risk Assessment"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Balanced assessment conducted; documentary evidence deemed more reliable"
    ],
    "Decision_Rationale": [
        "Decision was reasonable as it considered all evidence and relied on credible country condition reports"
    ],
    "Country_of_Origin": [
        "Angola"
    ],
    "Decision_Making_Body": [
        "PRRA Officer, Federal Court of Canada"
    ],
    "Evidentiary_Issues": [
        "Discrepancy between personal claims and official reports on country conditions"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness of administrative decision under IRPA"
    ]
}