{
    "Case ID": "",
    "Crime_Name": [
        "Refugee Claim Based on Spousal Abuse"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the applicant's failure to seek state protection in Korea due to societal stigma and emotional dependence is a reasonable basis for claiming non-availability of state protection"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The applicant suffered spousal abuse from 1995 to 2003 but never sought state protection, citing societal stigma and emotional dependence. Her mother intervened in 2003, providing support and moving her to Canada."
    ],
    "Decision_Outcome": [
        "The court dismissed the judicial review application, finding the RPD's decision reasonable and balanced."
    ],
    "Remedy_Requested": [
        "Refugee status"
    ],
    "Court_Ruling": [
        "The court upheld the RPD's decision, dismissing the application for judicial review."
    ],
    "Claimant_Status": [
        "Applicant claiming refugee status based on spousal abuse"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Spousal abuse, perceived unavailability of state protection in Korea due to societal stigma and emotional dependence"
    ],
    "Legal_Standard": [
        "The burden of proving non-existent or inadequate state protection lies with the applicant. Subjective reluctance is not sufficient to conclude unavailability of state protection. The standard of review is patent unreasonableness."
    ],
    "Assessment_Factor": [
        "Adequacy of state protection structures in Korea for abused women"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Judicial review of the RPD's decision"
    ],
    "Review_Standard": [
        "Patent unreasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "U.S. DOS reports, applicant's testimony"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Fear of persecution due to spousal abuse and lack of access to state protection in country of origin"
    ],
    "Evidence_Assessed": [
        "Testimony of applicant, country condition reports (U.S. DOS)"
    ],
    "Relief_Sought": [
        "Refugee protection in Canada"
    ],
    "Governing_Rule": [
        "Subjective reluctance such as emotional dependence or societal stigma is insufficient to establish that state protection is unavailable without objective evidence of ineffectiveness."
    ],
    "Evidentiary_Deficiency": [
        "Lack of evidence showing that state protection in Korea was ineffective or inaccessible"
    ],
    "Outcome": [
        "Application for judicial review dismissed; RPD decision upheld"
    ],
    "Decisional_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Harm_Assessment": [
        "History of spousal abuse from 1995 to 2003"
    ],
    "Cause_Description": [
        "The applicant claimed refugee status due to spousal abuse, arguing state protection was unavailable in Korea"
    ],
    "Evidence_Handling": [
        "The RPD considered U.S. DOS reports and applicant’s testimony in assessing availability of state protection"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Reliance on subjective reasons for not accessing protection without corroboration of systemic failure"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The RPD found state protection mechanisms in Korea to be adequate based on country evidence"
    ],
    "Decision_Rationale": [
        "No evidence suggested that state protection in Korea was ineffective; applicant's failure to seek help was attributed to personal and social factors, not systemic unavailability"
    ],
    "Country_of_Origin": [
        "Korea"
    ],
    "Decision_Making_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Evidentiary_Issues": [
        "Applicant did not provide objective evidence that state protection was inaccessible despite available legal frameworks"
    ],
    "Legal_Standard_Applied": [
        "Patent unreasonableness"
    ]
}