{
    "Case ID": "026652",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Board err in determining that the applicant did not qualify as a Convention refugee or person in need of protection?"
    ],
    "Governing_Law": [
        "s 96 and s 97 of the Immigration and Refugee Protection Act"
    ],
    "Application_Facts": [
        "The applicant was targeted by MS 13 due to his refusal to join and later involvement in anti-gang operations."
    ],
    "Decision_Outcome": [
        "The Board found this constituted a generalized risk rather than a personalized one."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "The Court allowed the judicial review, finding the Board erred in concluding the risk was generalized and not personalized due to the applicant's specific actions against MS 13."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [
        "MS 13 targeted the applicant for refusing to join and participating in anti-gang efforts."
    ],
    "Grounds_for_Claim": [
        "Persecution based on a Convention ground or a personalized risk not faced generally by others."
    ],
    "Legal_Standard": [
        "A person must demonstrate persecution based on a Convention ground or a personalized risk not faced generally by others."
    ],
    "Assessment_Factor": [
        "Whether the risk faced by the applicant was generalized or personalized."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act"
    ],
    "Procedural_Issue": [
        "Judicial review under s 72(1) of the Act"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [],
    "Legal_Provision_Cited": [
        "s 96, s 97, s 72(1)"
    ],
    "Application_Basis": [
        "Fear of persecution by MS 13 in El Salvador due to anti-gang activities"
    ],
    "Evidence_Assessed": [],
    "Relief_Sought": [
        "Refugee status"
    ],
    "Governing_Rule": [
        "Under s 96 and s 97 of the Immigration and Refugee Protection Act, a person must demonstrate persecution based on a Convention ground or a personalized risk not faced generally by others."
    ],
    "Evidentiary_Deficiency": [],
    "Outcome": [
        "Application for judicial review granted; Board's decision overturned"
    ],
    "Decisional_Body": [
        "The Board (IRB)"
    ],
    "Harm_Assessment": [
        "Threats from MS 13 due to refusal to join and participation in anti-gang operations"
    ],
    "Cause_Description": [
        "The applicant sought refugee status after facing threats from MS 13 in El Salvador."
    ],
    "Evidence_Handling": [],
    "Legal_Provision_Violated": [
        "None found; Board made an error in application of legal standard"
    ],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "s 96, s 97, s 72(1) of the Immigration and Refugee Protection Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [],
    "Decision_Rationale": [
        "The Court found that the applicant's risk was personalized due to his active opposition to MS 13, not a generalized risk."
    ],
    "Country_of_Origin": [
        "El Salvador"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board (IRB)"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Whether the applicant faced a personalized risk of persecution on a Convention ground"
    ]
}