{
    "Case ID": "027062",
    "Crime_Name": [
        "Negligence in Search and Rescue Duties"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Can the Federal Court hear an action against federal and provincial defendants for damages arising from a boating accident under maritime law?"
    ],
    "Governing_Law": [
        "Federal Courts Act",
        "Marine Liability Act",
        "Admiralty jurisdiction"
    ],
    "Application_Facts": [
        "The ship was sold before the action commenced, disallowing in rem claims. However, the in personam claim remains valid as it falls under federal navigation and shipping jurisdiction."
    ],
    "Decision_Outcome": [
        "The motion to strike the in personam action is dismissed; the in rem action is dismissed due to lack of continuous ownership."
    ],
    "Remedy_Requested": [],
    "Court_Ruling": [
        "In personam action continues in Federal Court; in rem action dismissed."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Alleged negligence in search and rescue duties following a boating accident resulting in death."
    ],
    "Legal_Standard": [
        "Admiralty jurisdiction governs maritime actions; in rem claims require continuous ownership of the vessel."
    ],
    "Assessment_Factor": [],
    "Applicable_Legislation": [
        "Federal Courts Act",
        "Marine Liability Act"
    ],
    "Procedural_Issue": [
        "Defendants moved to strike or stay the action based on jurisdictional grounds."
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [],
    "Legal_Provision_Cited": [
        "Federal Courts Act",
        "Marine Liability Act"
    ],
    "Application_Basis": [
        "Action falls within federal navigation and shipping jurisdiction."
    ],
    "Evidence_Assessed": [],
    "Relief_Sought": [
        "Damages arising from a boating accident under maritime law."
    ],
    "Governing_Rule": [
        "The Federal Courts Act, Marine Liability Act, and Admiralty jurisdiction govern maritime actions. Actions in rem require continuous ownership of the vessel."
    ],
    "Evidentiary_Deficiency": [],
    "Outcome": [
        "In personam action continues; in rem action dismissed."
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Death of Janessa Lynn Toney after a boating accident."
    ],
    "Evidence_Handling": [],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Federal Courts Act",
        "Marine Liability Act",
        "Admiralty jurisdiction"
    ],
    "Jurisdictional_Issue": [
        "Whether the Federal Court has jurisdiction over claims involving both federal and provincial defendants in a maritime incident."
    ],
    "Evidence_Assessment": [],
    "Decision_Rationale": [
        "In personam claims are valid under federal maritime jurisdiction; in rem claims fail due to sale of vessel prior to action."
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Federal Court"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Admiralty jurisdiction standards; requirements for in rem and in personam actions."
    ]
}