{
    "Case ID": "028675",
    "Crime_Name": [
        "Election Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Electoral Supervisor exceed his jurisdiction by disqualifying Simon after the nomination meeting?"
    ],
    "Governing_Law": [
        "Election Law"
    ],
    "Application_Facts": [
        "Simon was nominated but complaints arose about her residency. The Supervisor removed her name based on new evidence."
    ],
    "Decision_Outcome": [
        "The court dismissed Simon's application, ruling the Electoral Supervisor acted within jurisdiction."
    ],
    "Remedy_Requested": [
        "Judicial review"
    ],
    "Court_Ruling": [
        "The court upheld the Electoral Supervisor's decision; application dismissed with costs."
    ],
    "Claimant_Status": [
        "Simon, a nominated candidate"
    ],
    "Defendant_Behavior": [
        "Electoral Supervisor disqualified Simon based on residency concerns after the nomination meeting."
    ],
    "Grounds_for_Claim": [
        "Alleged jurisdictional overreach by the Electoral Supervisor in disqualifying a candidate post-nomination."
    ],
    "Legal_Standard": [
        "Authority granted under Section 16 of the Election Law to administer elections and disqualify ineligible candidates."
    ],
    "Assessment_Factor": [
        "Purpose of the Election Law to maintain electoral integrity by preventing unqualified candidates."
    ],
    "Applicable_Legislation": [
        "Section 16 of the Election Law"
    ],
    "Procedural_Issue": [
        "Whether judicial review is appropriate for challenging administrative decisions made by the Electoral Supervisor."
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "New evidence regarding Simon's residency"
    ],
    "Legal_Provision_Cited": [
        "Section 16 of the Election Law"
    ],
    "Application_Basis": [
        "Broad authority of the Electoral Supervisor to disqualify ineligible candidates"
    ],
    "Evidence_Assessed": [
        "Residency status of Simon as per submitted evidence"
    ],
    "Relief_Sought": [
        "Removal of disqualification and reinstatement as candidate"
    ],
    "Governing_Rule": [
        "The Election Law grants the Electoral Supervisor broad authority under Section 16 to administer elections, including disqualification of ineligible candidates."
    ],
    "Evidentiary_Deficiency": [],
    "Outcome": [
        "Application dismissed with costs"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Potential undermining of election integrity if unqualified candidates remain on ballot"
    ],
    "Cause_Description": [
        "Simon's name was removed from the candidate list due to residency concerns."
    ],
    "Evidence_Handling": [
        "The Supervisor considered new evidence of residency post-nomination"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [
        "Questioned – basis for disqualification"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Section 16 of the Election Law"
    ],
    "Jurisdictional_Issue": [
        "Whether the Electoral Supervisor exceeded jurisdiction by acting after the nomination meeting"
    ],
    "Evidence_Assessment": [
        "Court found Supervisor’s use of new evidence justified under the law"
    ],
    "Decision_Rationale": [
        "Allowing unqualified candidates would undermine the integrity of the Election Law"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Electoral Supervisor (administrative), Federal Court (judicial)"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Scope of administrative authority under Section 16 of the Election Law"
    ]
}