{
    "Case ID": "029577",
    "Crime_Name": [
        "Citizenship Residency Requirement"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the citizenship judge err by failing to apply the qualitative test for residency when assessing Mr. Dedaj's application?"
    ],
    "Governing_Law": [
        "The Citizenship Act"
    ],
    "Application_Facts": [
        "Mr. Dedaj met the physical presence requirement of 1,095 days in Canada but had post-application ties to the U.S."
    ],
    "Decision_Outcome": [
        "Appeal allowed; case remanded for reconsideration"
    ],
    "Remedy_Requested": [
        "Reassessment of citizenship application using both quantitative and qualitative residency tests"
    ],
    "Court_Ruling": [
        "The judge erred in law by not applying the qualitative test for residency as established in the Koo case"
    ],
    "Claimant_Status": [
        "Applicant for Canadian citizenship"
    ],
    "Defendant_Behavior": [
        "Citizenship judge focused on post-application U.S. ties without considering qualitative residency factors"
    ],
    "Grounds_for_Claim": [
        "Failure to apply the qualitative test for residency despite meeting physical presence requirements"
    ],
    "Legal_Standard": [
        "Residency must be assessed using both physical presence (1,095 days) and qualitative factors to determine if residency was established and maintained"
    ],
    "Assessment_Factor": [
        "Ties to Canada, duration and nature of absences, intention to reside in Canada"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Appeal from dismissal of citizenship application"
    ],
    "Review_Standard": [
        "Correctness, due to legal error in application of residency test"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence of physical presence in Canada, evidence of post-application ties to the U.S."
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act – residency requirements"
    ],
    "Application_Basis": [
        "Meeting 1,095-day physical presence requirement and maintaining factual residence in Canada"
    ],
    "Evidence_Assessed": [
        "Duration of stay in Canada, connections to the U.S. after application"
    ],
    "Relief_Sought": [
        "Granting of citizenship following proper assessment of residency"
    ],
    "Governing_Rule": [
        "Qualitative test for residency as per Koo case must be applied alongside physical presence"
    ],
    "Evidentiary_Deficiency": [
        "Failure to consider qualitative evidence of residency despite sufficient physical presence"
    ],
    "Outcome": [
        "Appeal allowed; application remanded for reassessment"
    ],
    "Decisional_Body": [
        "Citizenship Commission / Citizenship Judge"
    ],
    "Harm_Assessment": [
        "Unfair denial of citizenship due to incorrect legal interpretation"
    ],
    "Cause_Description": [
        "Mr. Dedaj's citizenship application was dismissed due to perceived insufficient physical presence, despite meeting the 1,095-day requirement"
    ],
    "Evidence_Handling": [
        "Post-application conduct given undue weight; pre- and during-application residency factors inadequately assessed"
    ],
    "Legal_Provision_Violated": [
        "Failure to comply with the full residency assessment under the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Overemphasis on post-application U.S. ties without evaluating totality of residency indicators"
    ],
    "Residency_Compliance": [
        "Met quantitative requirement (1,095 days); qualitative compliance requires further assessment"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act, residency clause"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Incomplete assessment of residency based on selective consideration of ties"
    ],
    "Decision_Rationale": [
        "Legal error occurred by omitting the qualitative test for residency; reassessment required"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Judge"
    ],
    "Evidentiary_Issues": [
        "Insufficient consideration of qualitative factors from Koo case"
    ],
    "Legal_Standard_Applied": [
        "Two-part test: physical presence + qualitative assessment of residency"
    ]
}