{
    "Case ID": "033470",
    "Crime_Name": [
        "Refugee Status Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the RPD improperly refused to admit a document due to non-compliance with Rule 29(4)"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The RPD refused a 1994 summons document solely because it existed before the hearing, ignoring Rule 30's required considerations"
    ],
    "Decision_Outcome": [
        "The RPD erred in refusing the document and its decision is set aside"
    ],
    "Remedy_Requested": [
        "Judicial review of the RPD's decision"
    ],
    "Court_Ruling": [
        "The court allowed the judicial review, invalidating the RPD's decision and ordering reconsideration by a new panel"
    ],
    "Claimant_Status": [
        "Mr. Khan claimed refugee status based on fearing persecution"
    ],
    "Defendant_Behavior": [
        "RPD dismissed the claim based on adverse credibility inference due to exclusion of late-submitted document"
    ],
    "Grounds_for_Claim": [
        "Fear of persecution in country of origin"
    ],
    "Legal_Standard": [
        "Rule 30 allows late documents if relevant factors are considered, including probative value and reasonable effort"
    ],
    "Assessment_Factor": [
        "Probative value of the document, reasonable effort to submit earlier"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Failure to consider Rule 30 when refusing a late document"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Adverse credibility inference was improperly drawn against Mr. Khan"
    ],
    "Evidence_Used": [
        "1994 summons document"
    ],
    "Legal_Provision_Cited": [
        "Rule 29(4), Rule 30"
    ],
    "Application_Basis": [
        "Document existed before hearing but was submitted late"
    ],
    "Evidence_Assessed": [
        "1994 summons document"
    ],
    "Relief_Sought": [
        "Redetermination of refugee claim by a new RPD panel"
    ],
    "Governing_Rule": [
        "Rule 30 of the IRB Rules"
    ],
    "Evidentiary_Deficiency": [
        "Document not admitted without assessing relevance or effort"
    ],
    "Outcome": [
        "Decision set aside, case remitted for redetermination"
    ],
    "Decisional_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Harm_Assessment": [
        "Adverse credibility finding central to dismissal of claim"
    ],
    "Cause_Description": [
        "Mr. Khan claimed refugee status based on fearing persecution but faced dismissal of his claim due to alleged lack of credibility"
    ],
    "Evidence_Handling": [
        "RPD refused to admit the document without applying Rule 30 analysis"
    ],
    "Legal_Provision_Violated": [
        "Rule 29(4), Rule 30"
    ],
    "Evidence_Issues": [
        "Late submission of relevant evidence"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Immigration and Refugee Protection Act (IRPA), Rule 29(4), Rule 30"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Failure to assess probative value and reason for late submission"
    ],
    "Decision_Rationale": [
        "RPD focused only on timing of document, not on Rule 30 factors"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Evidentiary_Issues": [
        "Exclusion of key document without proper justification under procedural rules"
    ]
}