{
    "Case ID": "035327",
    "Crime_Name": [
        "Refugee Protection Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the applicants successfully rebut the presumption of state protection in Poland?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act"
    ],
    "Application_Facts": [
        "Ms. Polak and Mr. Musialek claimed refugee status due to fear of persecution by Ms. Polak's father in Poland."
    ],
    "Decision_Outcome": [
        "The application for judicial review was dismissed."
    ],
    "Remedy_Requested": [
        "Judicial review of the Refugee Protection Division's decision."
    ],
    "Court_Ruling": [
        "The Federal Court upheld the Board's decision."
    ],
    "Claimant_Status": [
        "Applicants: Ms. Polak and Mr. Musialek"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Fear of persecution by Ms. Polak's father in Poland."
    ],
    "Legal_Standard": [
        "Under subsection 108(4) of the Act, claimants must prove compelling reasons for refusing state protection if they left their country due to persecution."
    ],
    "Assessment_Factor": [
        "Existence of state protection mechanisms in Poland, delays in seeking protection, testimonial inconsistencies."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act, subsection 108(4)"
    ],
    "Procedural_Issue": [
        "Review by the Refugee Protection Division followed by judicial review at the Federal Court."
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Testimonial inconsistencies noted, but not determinative alone."
    ],
    "Evidence_Used": [
        "Evidence regarding domestic violence mechanisms in Poland, applicant testimony."
    ],
    "Legal_Provision_Cited": [
        "Subsection 108(4) of the Immigration and Refugee Protection Act"
    ],
    "Application_Basis": [
        "Claim that state protection in Poland was inadequate due to risk from family member."
    ],
    "Evidence_Assessed": [
        "Board assessed evidence on functioning of Polish legal system in domestic violence cases."
    ],
    "Relief_Sought": [
        "Grant of refugee protection in Canada."
    ],
    "Governing_Rule": [
        "Claimants must show compelling reasons for rejecting state protection under s. 108(4)."
    ],
    "Evidentiary_Deficiency": [
        "Failure to seek state protection in Poland."
    ],
    "Outcome": [
        "Dismissal of judicial review application."
    ],
    "Decisional_Body": [
        "Refugee Protection Division, reviewed by Federal Court."
    ],
    "Harm_Assessment": [
        "Risk of domestic violence by family member in Poland."
    ],
    "Cause_Description": [
        "Ms. Polak and Mr. Musialek claimed refugee status due to fear of persecution by Ms. Polak's father in Poland."
    ],
    "Evidence_Handling": [
        "Board considered delays and inconsistencies but found sufficient evidence of state protection."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Inconsistencies in testimony, lack of evidence showing failure of Polish state protection."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Subsection 108(4), Immigration and Refugee Protection Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The Board concluded that adequate state protection existed in Poland."
    ],
    "Decision_Rationale": [
        "The decision was reasonable based on evidence that Poland has mechanisms to address domestic violence and the applicants did not demonstrate compelling reasons for rejecting state protection."
    ],
    "Country_of_Origin": [
        "Poland"
    ],
    "Decision_Making_Body": [
        "Refugee Protection Division"
    ],
    "Evidentiary_Issues": [
        "Delays in seeking protection, inconsistent testimony."
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard applied by Federal Court; burden on claimants under s. 108(4)"
    ]
}