{
    "Case ID": "039526",
    "Crime_Name": [
        "Citizenship Residency Requirement"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Failure to meet residency requirement for citizenship"
    ],
    "Legal_Issue": [
        "Whether Mr. Nandre met the residency requirement under the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Mr. Nandre was physically present in Canada for 763 days over four years; maintained property ownership and cultural involvement; spent significant time abroad due to employment"
    ],
    "Decision_Outcome": [
        "Appeal allowed; application remanded for further consideration"
    ],
    "Remedy_Requested": [
        "Minister's appeal against approval of citizenship application"
    ],
    "Court_Ruling": [
        "Appeal allowed"
    ],
    "Claimant_Status": [
        "Citizenship Judge initially approved application"
    ],
    "Defendant_Behavior": [
        "Mr. Nandre applied for citizenship but could not prove when residence was established"
    ],
    "Grounds_for_Claim": [
        "Failure to establish date of establishment of residence despite strong ties to Canada"
    ],
    "Legal_Standard": [
        "Three years of residence in Canada during previous four years; physical presence or qualitative test based on strong ties"
    ],
    "Assessment_Factor": [
        "Physical presence, property ownership, cultural involvement, duration of absences, employment-related travel"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Federal Court review of Citizenship Judge's decision"
    ],
    "Review_Standard": [
        "Interpretation and application of residency requirements under the Citizenship Act"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Record of physical presence (763 days), proof of property ownership, evidence of cultural involvement, employment records"
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act - residency requirement"
    ],
    "Application_Basis": [
        "Qualitative test for residence considered due to insufficient physical presence"
    ],
    "Evidence_Assessed": [
        "Duration of stay, connections to Canada, timing of establishment of residence"
    ],
    "Relief_Sought": [
        "Overturning of Citizenship Judge’s approval of Mr. Nandre’s application"
    ],
    "Governing_Rule": [
        "Residence requires either three years of physical presence or demonstration of strong ties with establishment of residence"
    ],
    "Evidentiary_Deficiency": [
        "Failure to prove when Mr. Nandre established residence in Canada"
    ],
    "Outcome": [
        "Appeal allowed; remanded for determination of when residence was established"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Minister appealed Citizenship Judge's approval of Mr. Nandre's citizenship application over residency concerns"
    ],
    "Evidence_Handling": [
        "Court reviewed evidence of presence and ties but found gap in proving establishment of residence"
    ],
    "Legal_Provision_Violated": [
        "Citizenship Act residency requirement"
    ],
    "Evidence_Issues": [
        "Insufficient evidence regarding the date residence was established"
    ],
    "Residency_Compliance": [
        "Not fully established; physical presence below threshold, qualitative factors present but key element missing"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act - Section on residency for citizenship eligibility"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Strong ties acknowledged, but lack of evidence on timing of residence establishment deemed critical"
    ],
    "Decision_Rationale": [
        "Qualitative test may apply, but applicant must still prove when residence was established; failure to do so necessitates remand"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Federal Court"
    ],
    "Evidentiary_Issues": [
        "Lack of documentation or testimony establishing when Mr. Nandre began residing in Canada"
    ],
    "Legal_Standard_Applied": [
        "Dual test for residence: physical presence or strong ties with demonstrated establishment"
    ]
}