{
    "Case ID": "042935",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the tribunal erred in determining that the male applicant was not a person in need of protection under IRPA subsection 97(1)?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act (IRPA) subsection 97(1)"
    ],
    "Application_Facts": [
        "The male applicant faced threats due to his appointment as a land surveyor, which stemmed from political connections."
    ],
    "Decision_Outcome": [
        "The tribunal's decision was unreasonable; the male applicant faced a personalized risk qualifying him for protection under IRPA subsection 97(1)."
    ],
    "Remedy_Requested": [
        "Judicial review"
    ],
    "Court_Ruling": [
        "Judicial review granted; case remanded to a differently constituted tribunal for reevaluation."
    ],
    "Claimant_Status": [
        "Male applicant seeking refugee protection"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Persecution due to political ties related to role as land surveyor in Haiti"
    ],
    "Legal_Standard": [
        "To qualify as a person in need of protection, an individual must face a personalized risk distinct from generalized risks affecting the population."
    ],
    "Assessment_Factor": [
        "Personalized risk vs. generalized risk"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Procedural_Issue": [
        "Judicial review filed under IRPA subsection 72(1)"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence of threats due to appointment as land surveyor and political connections"
    ],
    "Legal_Provision_Cited": [
        "IRPA subsection 97(1)",
        "IRPA subsection 72(1)"
    ],
    "Application_Basis": [
        "Risk of persecution based on political opinion and personal targeting"
    ],
    "Evidence_Assessed": [
        "Specific evidence of personal targeting was present but overlooked by the tribunal"
    ],
    "Relief_Sought": [
        "Recognition as a person in need of protection; refugee status"
    ],
    "Governing_Rule": [
        "An individual must face a personalized risk to qualify as a person in need of protection under IRPA"
    ],
    "Evidentiary_Deficiency": [
        "Tribunal failed to properly consider specific evidence of personal targeting"
    ],
    "Outcome": [
        "Judicial review granted; decision set aside"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board (IRB) Refugee Protection Division"
    ],
    "Harm_Assessment": [
        "Risk of harm due to political association and role as land surveyor"
    ],
    "Cause_Description": [
        "Male applicant claimed persecution after being appointed as a land surveyor in Haiti, allegedly due to political ties."
    ],
    "Evidence_Handling": [
        "Tribunal overlooked specific evidence of personal targeting"
    ],
    "Legal_Provision_Violated": [
        "IRPA subsection 97(1)"
    ],
    "Evidence_Issues": [
        "Failure to recognize personalized nature of risk despite supporting evidence"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "IRPA subsection 97(1)",
        "IRPA subsection 72(1)"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Evidence indicated personalized risk, but tribunal treated it as generalized"
    ],
    "Decision_Rationale": [
        "The tribunal unreasonably concluded the risk was generalized without adequately addressing evidence of personal targeting"
    ],
    "Country_of_Origin": [
        "Haiti"
    ],
    "Decision_Making_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Evidentiary_Issues": [
        "Insufficient consideration of evidence showing personalization of risk"
    ],
    "Legal_Standard_Applied": [
        "Personalized risk standard under IRPA s. 97(1)"
    ]
}