{
    "Case ID": "044136",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Board err in applying res judicata and assessing evidence of changed country conditions?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The applicants are Sri Lankan Tamils who claimed refugee status based on race and political opinion. This was a subsequent claim subject to res judicata."
    ],
    "Decision_Outcome": [
        "The Board dismissed the claim based on res judicata without adequately analyzing new evidence."
    ],
    "Remedy_Requested": [
        "Judicial review to quash the Board’s decision and remand for redetermination."
    ],
    "Court_Ruling": [
        "The application for judicial review is granted; the Board's decision is quashed."
    ],
    "Claimant_Status": [
        "Sri Lankan Tamil refugees with a prior claim, mother has a disability, daughter’s age is a factor."
    ],
    "Defendant_Behavior": [
        "The Board failed to assess credible evidence linking personal circumstances to changed country conditions."
    ],
    "Grounds_for_Claim": [
        "Risk based on race, political opinion, mother's disability, and daughter's age in context of deteriorating conditions in Sri Lanka."
    ],
    "Legal_Standard": [
        "Res judicata applies unless there are significant changes in country conditions or personal circumstances."
    ],
    "Assessment_Factor": [
        "Credible evidence linking personal circumstances (disability, age) with changed country conditions in Sri Lanka."
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Application of res judicata in a subsequent refugee claim."
    ],
    "Review_Standard": [
        "Reasonableness of the Board’s decision; adequacy of evidence assessment."
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence of deteriorating conditions in Sri Lanka, mother's disability, daughter's age."
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Race, political opinion, and personal vulnerabilities in light of changed country conditions."
    ],
    "Evidence_Assessed": [
        "The Board did not properly analyze evidence linking personal factors to country conditions."
    ],
    "Relief_Sought": [
        "Quashing of decision, remand for redetermination by a different panel."
    ],
    "Governing_Rule": [
        "Res judicata applies unless significant changes in country conditions or personal circumstances are credibly demonstrated."
    ],
    "Evidentiary_Deficiency": [
        "Failure to analyze credible evidence connecting personal circumstances to changed country conditions."
    ],
    "Outcome": [
        "Decision quashed, case remanded for redetermination."
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Potential risk to applicants due to return to Sri Lanka under deteriorating conditions."
    ],
    "Cause_Description": [
        "Applicants' second refugee claim was denied despite potential new evidence of risk due to changed circumstances."
    ],
    "Evidence_Handling": [
        "Inadequate assessment of evidence regarding changed country conditions and personal vulnerabilities."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Lack of analysis connecting evidence to the legal standard for overcoming res judicata."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Board failed to assess whether new evidence was sufficient to overcome res judicata."
    ],
    "Decision_Rationale": [
        "Errors in applying res judicata and failing to evaluate credible evidence of changed circumstances."
    ],
    "Country_of_Origin": [
        "Sri Lanka"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Insufficient linkage analysis between personal circumstances and country condition changes."
    ],
    "Legal_Standard_Applied": [
        "Res judicata in refugee claims with exception for significant changes in circumstances."
    ]
}