{
    "Case ID": "045773",
    "Crime_Name": [
        "Asylum Claim Rejection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Was the Board's rejection of the applicant's refugee claim due to failure to establish identity patently unreasonable?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Applicant failed to provide acceptable identification, lacked corroborating documents, and had inconsistencies in testimony about UDPS membership and travel documents."
    ],
    "Decision_Outcome": [
        "The Board's decision was not patently unreasonable; judicial review application dismissed."
    ],
    "Remedy_Requested": [
        "Judicial review of the Immigration and Refugee Board's decision"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed"
    ],
    "Claimant_Status": [
        "Applicant claimed asylum"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Failure to establish identity and provide credible evidence for asylum claim"
    ],
    "Legal_Standard": [
        "Patent unreasonableness"
    ],
    "Assessment_Factor": [
        "Credibility of testimony, lack of identification, absence of corroborating documentation"
    ],
    "Applicable_Legislation": [
        "Section 106 of IRPA (Immigration and Refugee Protection Act)"
    ],
    "Procedural_Issue": [
        "Judicial review under IRPA"
    ],
    "Review_Standard": [
        "Patent unreasonableness"
    ],
    "Credibility_Assessment": [
        "Inconsistencies in testimony regarding UDPS membership and travel documents"
    ],
    "Evidence_Used": [
        "Testimony about UDPS membership, travel documents"
    ],
    "Legal_Provision_Cited": [
        "Section 106 of IRPA"
    ],
    "Application_Basis": [
        "Refugee protection claim based on alleged risk upon return"
    ],
    "Evidence_Assessed": [
        "Lack of acceptable identification, lack of credible documentation or reasonable explanation"
    ],
    "Relief_Sought": [
        "Overturning of the Board's rejection of the asylum claim"
    ],
    "Governing_Rule": [
        "Standard of patent unreasonableness applies to review of IRB decisions"
    ],
    "Evidentiary_Deficiency": [
        "No acceptable ID, no corroborating documents, inconsistent statements"
    ],
    "Outcome": [
        "Application for judicial review dismissed; Board's decision upheld"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board (IRB)"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Applicant claimed asylum but could not prove identity or provide credible evidence"
    ],
    "Evidence_Handling": [
        "Board required credible documentation or reasonable explanation for lack thereof; applicant failed to meet burden"
    ],
    "Legal_Provision_Violated": [
        "Section 106 of IRPA – failure to establish identity with credible evidence"
    ],
    "Evidence_Issues": [
        "Inadequate identification, lack of corroboration, inconsistent testimony"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Section 106 of IRPA"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Negative assessment due to lack of credibility and supporting evidence"
    ],
    "Decision_Rationale": [
        "Board's conclusion that identity was not established was not patently unreasonable"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Failure to produce acceptable identification or reasonable explanation"
    ],
    "Legal_Standard_Applied": [
        "Patent unreasonableness"
    ]
}