{
    "Case ID": "046148",
    "Crime_Name": [
        "Refugee Status Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Failure to meet refugee eligibility criteria"
    ],
    "Legal_Issue": [
        "Entitlement to refugee status under IRPA sections 96 and 97"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act (IRPA) sections 96, 97, and 72"
    ],
    "Application_Facts": [
        "Applicant fled Haiti in 1991, lived illegally in the US for 15 years without seeking asylum, and applied for refugee status in Canada in 2006 claiming persecution due to Lavalas party involvement"
    ],
    "Decision_Outcome": [
        "Application for refugee status denied; judicial review dismissed"
    ],
    "Remedy_Requested": [
        "Judicial review of the Refugee Protection Division's decision"
    ],
    "Court_Ruling": [
        "Dismissed; Board's decision was reasonable"
    ],
    "Claimant_Status": [
        "Haitian national, previously residing illegally in the US"
    ],
    "Defendant_Behavior": [
        "Failed to apply for asylum during prolonged stay in the US"
    ],
    "Grounds_for_Claim": [
        "Fear of persecution based on political opinion (Lavalas party)"
    ],
    "Legal_Standard": [
        "Credibility, subjective fear, particularized risk, Convention grounds"
    ],
    "Assessment_Factor": [
        "Credibility of claim, length of time in another country without seeking protection, generalized vs. particularized risk"
    ],
    "Applicable_Legislation": [
        "IRPA sections 96, 97, 72"
    ],
    "Procedural_Issue": [
        "Judicial review under section 72 of IRPA"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Claim lacked credible evidence; inconsistent behavior undermined credibility"
    ],
    "Evidence_Used": [
        "Applicant's testimony, country condition reports on Haiti"
    ],
    "Legal_Provision_Cited": [
        "IRPA s. 96 (refugee definition), s. 97 (protection), s. 72 (judicial review)"
    ],
    "Application_Basis": [
        "Claim of persecution due to political opinion in Haiti"
    ],
    "Evidence_Assessed": [
        "Applicant’s delay in seeking protection, lack of documentation supporting political involvement"
    ],
    "Relief_Sought": [
        "Recognition as a protected person and grant of refugee status"
    ],
    "Governing_Rule": [
        "Board must assess credibility, subjective fear, and particularized risk; generalized violence insufficient"
    ],
    "Evidentiary_Deficiency": [
        "No proof of active Lavalas involvement, no attempt to seek asylum in the US"
    ],
    "Outcome": [
        "Refugee claim rejected; application for judicial review dismissed"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board (IRB)"
    ],
    "Harm_Assessment": [
        "Fear of generalized violence in Haiti, not linked to a Convention ground"
    ],
    "Cause_Description": [
        "Applicant fled Haiti in 1991, resided unlawfully in the US for 15 years, then sought refugee status in Canada in 2006 based on alleged political persecution"
    ],
    "Evidence_Handling": [
        "Board evaluated applicant's testimony and found it lacking in credibility and corroboration"
    ],
    "Legal_Provision_Violated": [
        "None directly violated; failure to satisfy IRPA s. 96 requirements"
    ],
    "Evidence_Issues": [
        "Lack of corroborative evidence, inconsistencies in timeline and behavior"
    ],
    "Residency_Compliance": [
        "Unlawful presence in the United States for 15 years"
    ],
    "Misrepresentation_Element": [
        "Potential misrepresentation by omission regarding asylum opportunities in the US"
    ],
    "Legal_Provision": [
        "IRPA s. 96, s. 97, s. 72"
    ],
    "Jurisdictional_Issue": [
        "Whether Canadian refugee protection applies given prolonged stay in third country"
    ],
    "Evidence_Assessment": [
        "Testimony deemed insufficient to establish a well-founded fear on a Convention ground"
    ],
    "Decision_Rationale": [
        "Generalized country conditions do not constitute persecution; applicant failed to demonstrate particularized risk or credible fear"
    ],
    "Country_of_Origin": [
        "Haiti"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Insufficient evidence to prove political activism or targeted risk"
    ],
    "Legal_Standard_Applied": [
        "Well-founded fear of persecution on a Convention ground under IRPA s. 96"
    ]
}