{
    "Case ID": "047838",
    "Crime_Name": [
        "Citizenship Residency Requirement Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency Requirement Non-Compliance"
    ],
    "Legal_Issue": [
        "Whether the citizenship judge correctly applied the residency requirement under the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Dr. Udwadia was physically present in Canada for 717 days during the four-year period preceding the application, falling short of the required 1,095 days (three out of four years)"
    ],
    "Decision_Outcome": [
        "The citizenship judge's decision was found to be unreasonable"
    ],
    "Remedy_Requested": [
        "The Minister appealed the grant of citizenship"
    ],
    "Court_Ruling": [
        "The Federal Court overturned the citizenship judge's decision"
    ],
    "Claimant_Status": [
        "Dr. Udwadia, citizenship applicant"
    ],
    "Defendant_Behavior": [
        "Applied for citizenship while not meeting the statutory physical presence requirement"
    ],
    "Grounds_for_Claim": [
        "Failure to meet the three-out-of-four-year residency requirement under the Citizenship Act"
    ],
    "Legal_Standard": [
        "Two-step test: (1) establishing residence in Canada; (2) meeting the 1,095-day physical presence requirement"
    ],
    "Assessment_Factor": [
        "Duration and continuity of physical presence in Canada"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "The citizenship judge failed to determine when Dr. Udwadia established residence in Canada"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Record of Dr. Udwadia’s physical presence (717 days) in Canada"
    ],
    "Legal_Provision_Cited": [
        "Residency requirement under the Citizenship Act – three out of four years"
    ],
    "Application_Basis": [
        "Naturalization through citizenship application"
    ],
    "Evidence_Assessed": [
        "Days of physical presence in Canada as documented in immigration records"
    ],
    "Relief_Sought": [
        "Overturning of the granted citizenship and requirement to reapply"
    ],
    "Governing_Rule": [
        "Applicant must reside in Canada for 1,095 days within the four years preceding the application"
    ],
    "Evidentiary_Deficiency": [
        "Lack of determination on when residence was established; insufficient days of presence"
    ],
    "Outcome": [
        "Appeal allowed; citizenship revoked; Dr. Udwadia must reapply after meeting requirements"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Granting citizenship contrary to statutory requirements undermines integrity of citizenship process"
    ],
    "Cause_Description": [
        "Dr. Udwadia's citizenship was granted despite not meeting the statutory residency requirement"
    ],
    "Evidence_Handling": [
        "Physical presence data was reviewed but residence establishment was not properly assessed"
    ],
    "Legal_Provision_Violated": [
        "Section of the Citizenship Act requiring 1,095 days of physical presence"
    ],
    "Evidence_Issues": [
        "Subjective assessment used without objective determination of residence commencement"
    ],
    "Residency_Compliance": [
        "Non-compliant – only 717 days present"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act – Residency Requirement (3 of 4 years)"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Insufficient evaluation of when residence began; focus only on subjective intent"
    ],
    "Decision_Rationale": [
        "The judge failed to apply the two-step test correctly, particularly step one (establishing residence); decision was unreasonable"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship judge (initial), Federal Court (appellate)"
    ],
    "Evidentiary_Issues": [
        "Failure to objectively assess establishment of residence despite clear physical absence"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard in reviewing administrative decision"
    ]
}