{
    "Case ID": "",
    "Crime_Name": [
        "Tax Evasion / Jeopardy Order"
    ],
    "Crime_Type": [
        "Property Crimes"
    ],
    "Dispute_Type": [
        "Tax collection dispute"
    ],
    "Legal_Issue": [
        "Whether the Minister met the legal standard for issuing a jeopardy order under s. 225.2(2) of the Income Tax Act"
    ],
    "Governing_Law": [
        "Income Tax Act, s. 225.2(2) and s. 225.2(8)"
    ],
    "Procedural_Stage": [
        "Judicial review of ex parte jeopardy order"
    ],
    "Evidence_Assessment": [
        "Inaccuracies and omissions in CRA's affidavits; misleading characterization of re-assessments; lack of evidence regarding asset liquidation or relocation; no intent to flee by Mr. Proulx"
    ],
    "Decision_Outcome": [
        "Jeopardy order set aside"
    ],
    "Burden_of_Proof": [
        "On the Minister to show reasonable grounds for belief that delay would jeopardize collection"
    ],
    "Credibility_Factor": [
        "CRA affidavits found lacking in credibility due to misleading statements and omissions"
    ],
    "Legal_Rule": [
        "Under s. 225.2(2), a judge may authorize immediate collection if delay would jeopardize tax collection; full and fair disclosure required in ex parte applications"
    ],
    "Standard_of_Review": [
        "Reasonable grounds to believe jeopardy to collection"
    ],
    "Procedural_Issue": [
        "Failure of full and fair disclosure in ex parte application"
    ],
    "Grounds_for_Claim": [
        "Allegation that Mr. Proulx might evade taxes by liquidating assets or moving abroad"
    ],
    "Outcome_on_Merits": [
        "Claim dismissed; jeopardy order revoked due to insufficient evidence and procedural unfairness"
    ],
    "Decision_Maker": [
        "Judge reviewing the judicial review application"
    ],
    "Judicial_Review_Outcome": [
        "Jeopardy order set aside"
    ],
    "Review_Standard": [
        "Judicial review of administrative decision"
    ],
    "Procedural_Fairness_Assessment": [
        "Violation of procedural fairness due to inadequate disclosure by CRA"
    ],
    "Key_Evidence_Considered": [
        "Affidavits from CRA; evidence of Mr. Proulx’s intention to appeal assessments; lack of proof of asset movement or flight risk"
    ],
    "Legal_Framework": [
        "Administrative law principles applied to tax enforcement powers"
    ],
    "Applicant_Challenge": [
        "Mr. Proulx challenged the validity of the jeopardy order"
    ],
    "Court_Result": [
        "Collection actions halted unless new circumstances arise"
    ],
    "Legal_Rule_Source": [
        "Income Tax Act, Canadian jurisprudence on ex parte applications"
    ],
    "Standard_of_Proof": [
        "Reasonable grounds to believe"
    ],
    "Defendant_Response": [
        "Mr. Proulx demonstrated intent to comply with tax process and pursue appeals"
    ],
    "Evidence_Type": [
        "Affidavit evidence, documentary records, representations"
    ],
    "Remedy_Requested": [
        "Judicial review and cancellation of the jeopardy order"
    ],
    "Outcome": [
        "Jeopardy order revoked"
    ],
    "Decision_Authority": [
        "Federal Court or Tax Court of Canada (implied)"
    ],
    "Remedy_Sought": [
        "Halt to collection actions pending reassessment or new evidence"
    ],
    "Resolution_Mechanism": [
        "Judicial review"
    ],
    "Legal_Provision": [
        "s. 225.2(2) and s. 225.2(8) of the Income Tax Act"
    ],
    "Authority": [
        "Minister of National Revenue"
    ],
    "Claimant_Status": [
        "Taxpayer (Mr. Proulx) as applicant for judicial review"
    ],
    "Legal_Provision_Cited": [
        "s. 225.2(2), s. 225.2(8)"
    ],
    "Grounds_for_Inadmissibility_or_Allegation": [
        "Risk of tax evasion through asset disposal or departure from Canada"
    ],
    "Applicable_Process": [
        "Ex parte application followed by judicial review"
    ],
    "Outcome_of_Review": [
        "Order set aside"
    ],
    "Pending_Relief_or_Application": [
        "No active collection allowed unless new circumstances emerge"
    ],
    "Jurisdiction": [
        "Canada, federal tax jurisdiction"
    ],
    "Governing_Rule": [
        "Full and fair disclosure required in ex parte matters; burden on Crown to justify urgent collection"
    ]
}