{
    "Case ID": "050167",
    "Crime_Name": [
        "Trademark Infringement"
    ],
    "Crime_Type": [
        "Property Crimes"
    ],
    "Dispute_Type": [
        "Intellectual Property Dispute"
    ],
    "Legal_Issue": [
        "Whether the defendants infringed the plaintiffs' rights under s. 19, 20, or 22 of the Trademarks Act or committed passing-off"
    ],
    "Governing_Law": [
        "Trademarks Act"
    ],
    "Procedural_Stage": [
        "Trial/Adjudication Stage"
    ],
    "Evidence_Assessment": [
        "Visual similarity between Explore Canada logo and Hilfiger's TMA '095; lack of evidence on goodwill depreciation or passing-off"
    ],
    "Decision_Outcome": [
        "Infringement under s. 20 for TMA '095 established; no infringement under s. 19, s. 22, or passing-off; personal liability dismissed"
    ],
    "Burden_of_Proof": [
        "On claimant (Tommy Hilfiger) to prove infringement and likelihood of confusion"
    ],
    "Credibility_Factor": [
        "Court found sufficient visual similarity to cause confusion but insufficient evidence to support goodwill depreciation or passing-off"
    ],
    "Legal_Rule": [
        "Under s. 19: Exclusive right to use a registered trademark unless invalid",
        "Under s. 20: Unauthorized use causing confusion constitutes infringement",
        "Under s. 22: Prohibits depreciation of goodwill through misuse of a trademark"
    ],
    "Standard_of_Review": [
        "Reasonableness / Correctness (as applicable to statutory interpretation and factual findings)"
    ],
    "Procedural_Issue": [
        "Personal liability against Harold Rosen; admissibility and sufficiency of evidence on goodwill and confusion"
    ],
    "Grounds_for_Claim": [
        "Unauthorized use of similar mark causing consumer confusion with registered trademark (TMA '095)"
    ],
    "Outcome_on_Merits": [
        "Partial success for plaintiff: s. 20 infringement upheld; other claims dismissed"
    ],
    "Decision_Maker": [
        "Court"
    ],
    "Judicial_Review_Outcome": [
        "Not applicable – this was the initial decision"
    ],
    "Review_Standard": [
        "N/A"
    ],
    "Procedural_Fairness_Assessment": [
        "Parties had opportunity to present arguments and evidence; no noted procedural unfairness"
    ],
    "Key_Evidence_Considered": [
        "Visual design of Explore Canada logo vs. TMA '095; product categories; market presence; absence of goodwill damage evidence"
    ],
    "Legal_Framework": [
        "Canadian Trademarks Act, ss. 19, 20, 22; common law passing-off"
    ],
    "Applicant_Challenge": [
        "Tommy Hilfiger alleged infringement and sought legal remedies"
    ],
    "Court_Result": [
        "Liability for s. 20 infringement; counterclaim dismissed; remaining issues deferred"
    ],
    "Legal_Rule_Source": [
        "Statutory (Trademarks Act), Common Law (passing-off)"
    ],
    "Standard_of_Proof": [
        "Balance of probabilities"
    ],
    "Defendant_Response": [
        "Denial of infringement, passing-off, and goodwill depreciation; challenged personal liability"
    ],
    "Evidence_Type": [
        "Documentary evidence, visual comparison, trademark registration records"
    ],
    "Remedy_Requested": [
        "Legal action including damages and injunction"
    ],
    "Outcome": [
        "Quality Goods liable for s. 20 infringement; no liability for s. 19, s. 22, or passing-off; Harold Rosen not personally liable"
    ],
    "Decision_Authority": [
        "Trial Court"
    ],
    "Remedy_Sought": [
        "Injunction, damages, and other legal remedies for trademark infringement"
    ],
    "Resolution_Mechanism": [
        "Judicial determination"
    ],
    "Legal_Provision": [
        "Trademarks Act, ss. 19, 20, 22"
    ],
    "Authority": [
        "Statutory authority (Trademarks Act), Judicial precedent"
    ],
    "Claimant_Status": [
        "Registered trademark owner (Tommy Hilfiger)"
    ],
    "Legal_Provision_Cited": [
        "s. 19, s. 20, s. 22 of the Trademarks Act"
    ],
    "Grounds_for_Inadmissibility_or_Allegation": [
        "Allegation of unauthorized use causing confusion; no proven grounds for goodwill depreciation"
    ],
    "Applicable_Process": [
        "Civil litigation process under Canadian intellectual property law"
    ],
    "Outcome_of_Review": [
        "N/A"
    ],
    "Pending_Relief_or_Application": [
        "Further resolution deferred on remaining issues"
    ],
    "Jurisdiction": [
        "Canada"
    ],
    "Governing_Rule": [
        "Trademarks Act provisions on infringement and passing-off"
    ]
}