{
    "Case ID": "050190",
    "Crime_Name": [
        "Citizenship Application Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Minister has authority to delay granting citizenship after a citizenship judge's approval"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Stanizai’s application was approved by a citizenship judge in 2012, but processing was delayed due to cessation proceedings. No new information emerged post-approval, and the Minister failed to appeal within 60 days."
    ],
    "Decision_Outcome": [
        "The Federal Court granted mandamus, ordering the Minister to grant citizenship within 30 days."
    ],
    "Remedy_Requested": [
        "Mandamus"
    ],
    "Court_Ruling": [
        "The court ordered the Minister to grant citizenship, citing delays and lack of new evidence."
    ],
    "Claimant_Status": [
        "Citizenship applicant"
    ],
    "Defendant_Behavior": [
        "The Minister delayed granting citizenship without new evidence and did not appeal within the statutory period."
    ],
    "Grounds_for_Claim": [
        "Dispute over whether Stanizai met residency requirements and concerns about his refugee status."
    ],
    "Legal_Standard": [
        "Under the Citizenship Act, if an applicant meets statutory requirements, the Minister 'shall' grant citizenship. Mandamus may issue if there is a clear public duty and no other adequate remedy."
    ],
    "Assessment_Factor": [
        "Compliance with statutory requirements, timeliness of decision, availability of new evidence"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Judicial review involving analysis of statutory duties and discretionary powers under the Citizenship Act"
    ],
    "Review_Standard": [
        "Statutory interpretation, standard for issuing mandamus"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Citizenship judge's approval, lack of new information post-approval, failure to appeal within 60 days"
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act – Minister 'shall' grant citizenship if requirements are met"
    ],
    "Application_Basis": [
        "Statutory compliance with residency and other citizenship requirements as determined by the citizenship judge"
    ],
    "Evidence_Assessed": [
        "No new evidence emerged after the judge’s approval"
    ],
    "Relief_Sought": [
        "Order compelling the Minister to grant citizenship"
    ],
    "Governing_Rule": [
        "If statutory requirements are met, the Minister must grant citizenship; delay without cause violates statutory duty"
    ],
    "Evidentiary_Deficiency": [
        "Lack of new evidence to justify delay"
    ],
    "Outcome": [
        "Mandamus granted; Minister ordered to grant citizenship within 30 days"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Unjustified delay in obtaining citizenship rights despite meeting legal requirements"
    ],
    "Cause_Description": [
        "Dispute over residency compliance and refugee status affecting citizenship eligibility"
    ],
    "Evidence_Handling": [
        "Court found no new evidence justified the delay post-approval"
    ],
    "Legal_Provision_Violated": [
        "Citizenship Act – Minister’s duty to grant citizenship when requirements are met"
    ],
    "Evidence_Issues": [
        "No new evidence provided to support delay"
    ],
    "Residency_Compliance": [
        "Alleged non-compliance, but approved by citizenship judge"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Post-approval delay unjustified due to absence of new information"
    ],
    "Decision_Rationale": [
        "Statutory duty to grant citizenship when requirements are met; no valid basis for delay or override of judge’s decision"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Federal Court"
    ],
    "Evidentiary_Issues": [
        "Failure to present new evidence to justify administrative delay"
    ],
    "Legal_Standard_Applied": [
        "Mandamus: clear public duty, absence of alternative remedy"
    ]
}