{
    "Case ID": "055154",
    "Crime_Name": [
        "Citizenship Residency Requirement Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency requirement non-compliance allegation"
    ],
    "Legal_Issue": [
        "Reasonableness of citizenship judge's decision on residency requirement"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Ms. Kettani applied for Canadian citizenship; claimed 1,095 days of physical presence in Canada within four years prior to application"
    ],
    "Decision_Outcome": [
        "Citizenship judge approved application; court upheld decision"
    ],
    "Remedy_Requested": [
        "Judicial review of citizenship judge's decision"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed"
    ],
    "Claimant_Status": [
        "Minister of Citizenship and Immigration"
    ],
    "Defendant_Behavior": [
        "Ms. Kettani provided evidence and testimony regarding her residency"
    ],
    "Grounds_for_Claim": [
        "Allegation that citizenship judge made unreasonable findings on residency compliance"
    ],
    "Legal_Standard": [
        "Reasonableness standard"
    ],
    "Assessment_Factor": [
        "Credibility of applicant, consistency of evidence, physical presence test"
    ],
    "Applicable_Legislation": [
        "Citizenship Act, section 22.1 (judicial review)"
    ],
    "Procedural_Issue": [
        "Judicial review process under section 22.1 of the Citizenship Act"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Citizenship judge found Ms. Kettani credible despite inconsistencies"
    ],
    "Evidence_Used": [
        "Applicant's testimony, supporting documents on travel and residence"
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act - residency requirement (1,095 days in 4 years)"
    ],
    "Application_Basis": [
        "Physical presence test applied by citizenship judge"
    ],
    "Evidence_Assessed": [
        "Travel records, personal testimony, residency declarations"
    ],
    "Relief_Sought": [
        "Overturn of citizenship judge’s approval of Ms. Kettani’s application"
    ],
    "Governing_Rule": [
        "Applicant must reside in Canada for at least 1,095 days in the four years preceding application"
    ],
    "Evidentiary_Deficiency": [
        "Alleged inconsistencies in Ms. Kettani's account, but deemed resolved by judge"
    ],
    "Outcome": [
        "Decision upheld; Ms. Kettani's citizenship application remains approved"
    ],
    "Decisional_Body": [
        "Citizenship judge, Federal Court (on judicial review)"
    ],
    "Harm_Assessment": [
        "No harm established; Minister failed to prove unreasonableness"
    ],
    "Cause_Description": [
        "Minister challenged approval of citizenship based on alleged failure to meet residency requirement"
    ],
    "Evidence_Handling": [
        "Judge assessed credibility and reconciled inconsistencies in applicant's favor"
    ],
    "Legal_Provision_Violated": [
        "None found"
    ],
    "Evidence_Issues": [
        "Inconsistencies in applicant's statements, but not sufficient to undermine credibility"
    ],
    "Residency_Compliance": [
        "Found to be satisfied based on evidence and credibility"
    ],
    "Misrepresentation_Element": [
        "Not established"
    ],
    "Legal_Provision": [
        "Citizenship Act - residency requirement"
    ],
    "Jurisdictional_Issue": [
        "Federal Court jurisdiction under section 22.1 of the Citizenship Act"
    ],
    "Evidence_Assessment": [
        "Comprehensive evaluation of applicant's evidence by citizenship judge"
    ],
    "Decision_Rationale": [
        "Decision was reasonable and within acceptable range of outcomes"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Commission (via citizenship judge), Federal Court"
    ],
    "Evidentiary_Issues": [
        "Minor inconsistencies addressed and resolved by judge"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness"
    ]
}