{
    "Case ID": "056693",
    "Crime_Name": [
        "Immigration and Refugee Protection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Does Section 97(1)(b)(ii) of the IRPA apply to subgroups facing heightened risks in countries with generalized crime?"
    ],
    "Governing_Law": [
        "Section 97(1)(b)(ii) of the IRPA"
    ],
    "Application_Facts": [
        "The applicant, a Haitian businessman, claimed persecution due to perceived wealth. The Board found his risk generalized, as all Haitians face similar dangers."
    ],
    "Decision_Outcome": [
        "The application for judicial review was dismissed"
    ],
    "Remedy_Requested": [
        "Judicial review of the IRB's denial of asylum claim"
    ],
    "Court_Ruling": [
        "Dismissed the application but certified the legal question for broader consideration"
    ],
    "Claimant_Status": [
        "Haitian businessman seeking asylum"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Persecution based on perceived wealth in Haiti"
    ],
    "Legal_Standard": [
        "Section 97(1)(b)(ii) requires a personalized risk not faced generally by others in the country"
    ],
    "Assessment_Factor": [
        "Risk level in Haiti; whether the applicant faces a personalized risk distinct from the general population"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Procedural_Issue": [
        "Judicial review in Federal Court analyzing IRB decision"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Information about generalized violence in Haiti; applicant's profile as a businessman"
    ],
    "Legal_Provision_Cited": [
        "Section 97(1)(b)(ii) of the IRPA"
    ],
    "Application_Basis": [
        "Asylum claim under IRPA based on fear of persecution"
    ],
    "Evidence_Assessed": [
        "Nature and extent of risk to the applicant versus general population in Haiti"
    ],
    "Relief_Sought": [
        "Allowance of asylum claim and reversal of IRB decision"
    ],
    "Governing_Rule": [
        "Section 97(1)(b)(ii) of the IRPA"
    ],
    "Evidentiary_Deficiency": [
        "Failure to demonstrate a personalized risk beyond general danger in Haiti"
    ],
    "Outcome": [
        "Application dismissed"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board (IRB), reviewed by Federal Court"
    ],
    "Harm_Assessment": [
        "Generalized crime and violence in Haiti affecting all citizens"
    ],
    "Cause_Description": [
        "Applicant's asylum claim denied by IRB due to lack of personalized risk"
    ],
    "Evidence_Handling": [
        "Board assessed whether applicant’s risk was distinct from general population"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Section 97(1)(b)(ii) of the IRPA"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Risk was found to be generalized, not particularized to the applicant"
    ],
    "Decision_Rationale": [
        "The applicant did not establish a personalized risk under Section 97(1)(b)(ii); the danger he faces is shared by the general population in Haiti"
    ],
    "Country_of_Origin": [
        "Haiti"
    ],
    "Decision_Making_Body": [
        "Federal Court"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Requirement of a personalized risk under Section 97(1)(b)(ii) of the IRPA"
    ]
}