{
    "Case ID": "",
    "Crimes": [
        {
            "Crime_Name": "Indignity to a dead body",
            "Crime_Type": "Property Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review challenged the Acting Warden’s dismissal of ETA applications and NPB’s adjournment of the parole hearing",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998 and 2004) were insufficient for current risk evaluation. His violent history and diagnosed personality disorders justified new assessments",
            "Decision_Outcome": "The Acting Warden and NPB reasonably required updated assessments. The judicial review application was dismissed"
        },
        {
            "Crime_Name": "Escaping lawful custody",
            "Crime_Type": "Property Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122; CCRR sections 155, 157; Commissioner's Directives 710-3 and 712-1",
            "Procedural_Stage": "Judicial review challenged decisions of the Acting Warden and NPB. Court analyzed procedural issues, statutory discretion, and reasonableness of decisions",
            "Evidence_Assessment": "Mr. McDougall’s outdated assessments (1998 and 2004) were insufficient for current risk evaluation. The Acting Warden and NPB required new assessments to fulfill their statutory duty of ensuring public safety",
            "Decision_Outcome": "The Acting Warden and NPB acted reasonably within their jurisdiction. Mr. McDougall's application for judicial review was dismissed"
        },
        {
            "Crime_Name": "Impersonation with intent",
            "Crime_Type": "Security Threats and Terrorism",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release?",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review analyzed whether the Acting Warden and NPB decisions were procedurally sound and substantively reasonable under the CCRA",
            "Evidence_Assessment": "Mr. McDougall's outdated 1998 and 2004 assessments raised concerns about his risk level. The Acting Warden and NPB followed CCRA guidelines and Commissioner Directives to ensure current risk evaluations were conducted",
            "Decision_Outcome": "The Acting Warden and NPB reasonably exercised their authority under the CCRA by requiring updated risk assessments before granting conditional release or day parole"
        },
        {
            "Crime_Name": "Robbery with violence",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA mandates protection of society as paramount, allowing authorities to require risk assessments for conditional release decisions",
            "Procedural_Stage": "Judicial review challenged Acting Warden's dismissal of ETAs and NPB's adjournment of day parole hearing",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998 & 2004) were insufficient for current risk evaluation given his violent history and diagnosed personality disorders",
            "Decision_Outcome": "The Acting Warden and NPB reasonably required updated assessments thus, the judicial review application was dismissed"
        },
        {
            "Crime_Name": "Unlawful confinement",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA s.17(1)(a), CCRA s.102",
            "Procedural_Stage": "Judicial review challenged the Acting Warden’s dismissal of ETA applications and NPB’s adjournment of parole hearing",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998, 2004) were insufficient for current risk evaluation given his history of violent crimes and personality disorders",
            "Decision_Outcome": "The Acting Warden and NPB reasonably required updated risk assessments the judicial review application is dismissed"
        },
        {
            "Crime_Name": "Forcible confinement",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA mandates protection of society as paramount, allowing authorities to require risk assessments for conditional release decisions",
            "Procedural_Stage": "Judicial review analyzed CCRA provisions, Commissioner Directives, and case law to assess the legality of decisions",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998 & 2004) were insufficient for current risk evaluation, justifying the Acting Warden’s refusal and NPB’s adjournment",
            "Decision_Outcome": "The Acting Warden and NPB reasonably exercised their authority thus, the judicial review application is dismissed"
        },
        {
            "Crime_Name": "Kidnapping",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review challenged decisions by the Acting Warden and NPB. The court analyzed whether internal remedies were exhausted, if the case was moot, and the reasonableness of the decisions",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998 and 2004) were insufficient for current risk evaluation. His history of violent crimes and personality disorders justified new assessments. The NPB reasonably adjourned hearings to await updated reports",
            "Decision_Outcome": "The Acting Warden and NPB acted reasonably and within their statutory authority. Mr. McDougall’s application for judicial review is dismissed"
        },
        {
            "Crime_Name": "Second degree murder",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review challenged the Acting Warden's and NPB's decisions. The court analyzed statutory discretion, mootness, and adequacy of internal remedies",
            "Evidence_Assessment": "Mr. McDougall's outdated assessments (1998 and 2004) were insufficient for current risk evaluation. His history of violent crimes and personality disorders justified new assessments. The NPB adjourned hearings to obtain necessary information",
            "Decision_Outcome": "The Acting Warden and NPB reasonably exercised their authority under CCRA. Mr. McDougall’s application for judicial review is dismissed"
        },
        {
            "Crime_Name": "Dangerous operation of a motor vehicle",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Can the Acting Warden and NPB require updated risk assessments before considering conditional release applications?",
            "Governing_Law": "CCRA s.17, CCRR s.157",
            "Procedural_Stage": "Judicial review challenged the Acting Warden's and NPB's decisions. The Court analyzed statutory discretion and reasonableness of decisions",
            "Evidence_Assessment": "Mr. McDougall's outdated 1998 psychiatric and 2004 psychological reports were insufficient for current risk assessment. His history of violent crimes and personality disorders justified new assessments",
            "Decision_Outcome": "The Acting Warden and NPB acted reasonably in requiring updated risk assessments before considering Mr. McDougall's ETA and day parole applications"
        },
        {
            "Crime_Name": "Theft",
            "Crime_Type": "Organized Crime and Smuggling",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring risk assessments before considering conditional release",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review challenged decisions of Acting Warden and NPB. Court analyzed procedural issues, legal interpretations, and reasonableness of decisions",
            "Evidence_Assessment": "Mr. McDougall's outdated psychological reports (1998, 2004) were insufficient for current risk assessment. The Acting Warden and NPB required updated assessments to fulfill their statutory duty to protect society",
            "Decision_Outcome": "The Acting Warden and NPB reasonably exercised their authority under CCRA. Application for judicial review dismissed"
        },
        {
            "Crime_Name": "Breaking and entering",
            "Crime_Type": "Violent Crimes",
            "Legal_Issue": "Whether the Acting Warden's decision to deny ETAs and the NPB's adjournment of the day parole hearing were reasonable exercises of their statutory authority under the CCRA?",
            "Governing_Law": "CCRA sections 17, 101, 102, and 122",
            "Procedural_Stage": "Judicial review challenged the Acting Warden's and NPB's decisions. The court analyzed statutory authority, internal remedies, and mootness before reviewing the merits of the case",
            "Evidence_Assessment": "Mr. McDougall's outdated psychological and psychiatric reports (1998 and 2004) were insufficient for current risk assessment. The Acting Warden and NPB acted within their authority by requiring updated assessments before granting conditional release or making a parole decision",
            "Decision_Outcome": "The Acting Warden's dismissal of ETA applications and the NPB's adjournment of the day parole hearing were reasonable and lawful. The judicial review application is dismissed"
        },
        {
            "Crime_Name": "Possession of cannabis",
            "Crime_Type": "Property Crimes",
            "Legal_Issue": "Whether the Acting Warden and NPB acted within their jurisdiction by requiring updated risk assessments before considering conditional release",
            "Governing_Law": "CCRA s.17(1)(a), CCRR s.157(4)(a)",
            "Procedural_Stage": "Judicial review challenged decisions of Acting Warden and NPB. Court analyzed statutory powers and reasonableness of decisions",
            "Evidence_Assessment": "Mr. McDougall's outdated 1998 and 2004 assessments were insufficient for current risk evaluation, justifying the Acting Warden’s decision and NPB’s adjournment",
            "Decision_Outcome": "The Acting Warden and NPB reasonably exercised their authority under applicable laws. Judicial review application dismissed"
        },
        {
            "Crime_Name": "Possession of stolen property",
            "Crime_Type": "Property Crimes",
            "Legal_Issue": "Can the Warden or NPB require mental health assessments before considering conditional release?",
            "Governing_Law": "CCRA allows conditional release if no undue risk to society exists. Risk assessments are necessary for decision-making",
            "Procedural_Stage": "Judicial review challenged Warden and NPB decisions. Court analyzed CCRA provisions, relevance of assessments, and procedural issues",
            "Evidence_Assessment": "McDougall refused assessments, citing them as intrusive. Outdated reports were insufficient for risk analysis, justifying the Acting Warden's and NPB's decisions",
            "Decision_Outcome": "The Acting Warden and NPB acted reasonably in requiring updated assessments before granting conditional release. Judicial review dismissed"
        }
    ]
}