{
    "Case ID": "058304",
    "Crime_Name": [
        "Discrimination in Employment"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Canadian Human Rights Commission err in dismissing Mr. Niaki's complaints of employment discrimination?"
    ],
    "Governing_Law": [
        "The Canadian Human Rights Act"
    ],
    "Application_Facts": [
        "Mr. Niaki alleged discrimination during job interviews and applications due to his Iranian background."
    ],
    "Decision_Outcome": [
        "The Commission's decision was reasonable and did not breach procedural fairness; the application for judicial review was dismissed."
    ],
    "Remedy_Requested": [
        "Judicial review of the Commission's decision"
    ],
    "Court_Ruling": [
        "The court upheld the Commission's decision, dismissing Mr. Niaki's application for judicial review."
    ],
    "Claimant_Status": [
        "Mr. Niaki, applicant alleging discrimination"
    ],
    "Defendant_Behavior": [
        "Department of National Defence's hiring practices during job interviews and applications"
    ],
    "Grounds_for_Claim": [
        "Race, national or ethnic origin (Iranian background)"
    ],
    "Legal_Standard": [
        "Prohibition of discriminatory practices in employment under the Canadian Human Rights Act"
    ],
    "Assessment_Factor": [
        "Presence or absence of evidence supporting discrimination claims"
    ],
    "Applicable_Legislation": [
        "Canadian Human Rights Act"
    ],
    "Procedural_Issue": [
        "Alleged lack of procedural fairness in the Commission's dismissal of complaints"
    ],
    "Review_Standard": [
        "Reasonableness of the Commission's decision"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Findings from investigations and reviews by the Canadian Human Rights Commission"
    ],
    "Legal_Provision_Cited": [
        "Sections of the Canadian Human Rights Act prohibiting employment discrimination"
    ],
    "Application_Basis": [
        "Complaints filed by Mr. Niaki with the Canadian Human Rights Commission"
    ],
    "Evidence_Assessed": [
        "No evidence found to support claims of discrimination"
    ],
    "Relief_Sought": [
        "Overturning of the Commission's decision through judicial review"
    ],
    "Governing_Rule": [
        "The Canadian Human Rights Act prohibits discriminatory practices based on race, national or ethnic origin, and other grounds in employment."
    ],
    "Evidentiary_Deficiency": [
        "Lack of supporting evidence for discrimination allegations"
    ],
    "Outcome": [
        "Application for judicial review dismissed"
    ],
    "Decisional_Body": [
        "Canadian Human Rights Commission"
    ],
    "Harm_Assessment": [
        "Perceived harm due to alleged discriminatory treatment in employment process"
    ],
    "Cause_Description": [
        "Mr. Niaki felt discriminated against during job applications and interviews with the Department of National Defence."
    ],
    "Evidence_Handling": [
        "Investigations and reviews conducted by the Commission prior to dismissal"
    ],
    "Legal_Provision_Violated": [
        "Provisions of the Canadian Human Rights Act related to employment discrimination"
    ],
    "Evidence_Issues": [
        "Insufficient evidence to substantiate discrimination claims"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Canadian Human Rights Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Commission concluded non-discriminatory factors led to disqualification"
    ],
    "Decision_Rationale": [
        "No evidence of discrimination; decision was reasonable and procedurally fair"
    ],
    "Country_of_Origin": [
        "Iran"
    ],
    "Decision_Making_Body": [
        "Canadian Human Rights Commission"
    ],
    "Evidentiary_Issues": [
        "Absence of credible or sufficient evidence to prove discriminatory intent"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard applied to administrative decision-making"
    ]
}