{
    "Case ID": "059253",
    "Crimes": [
        {
            "Crime_Name": "Overstaying visa",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration Violation",
            "Legal_Issue": "Mootness of judicial review application after removal date passed with stay in place",
            "Governing_Law": "Immigration and Refugee Protection Act (IRPA)",
            "Application_Facts": "Applicants overstayed their visas, applied for refugee protection (which was refused), and sought deferral of removal based on pending humanitarian and compassionate (H&C) application. A stay of removal was granted by the court.",
            "Decision_Outcome": "Application for judicial review dismissed as moot",
            "Remedy_Requested": "Judicial review of refusal to defer removal",
            "Court_Ruling": "The application is moot because there is no live controversy; the applicants remain in Canada due to the stay, and the enforcement officer’s refusal has no practical effect.",
            "Claimant_Status": "Foreign nationals with expired visas, claimants of refugee protection and H&C relief",
            "Defendant_Behavior": "Enforcement officer refused to defer removal despite pending H&C application",
            "Grounds_for_Claim": "Pending humanitarian and compassionate application warranting deferral of removal",
            "Legal_Standard": "An application for judicial review becomes moot if there is no live controversy affecting the rights of the parties",
            "Assessment_Factor": "Whether adjudicating the issue would serve a useful purpose or resolve an ongoing dispute",
            "Applicable_Legislation": "IRPA, sections related to removal orders and H&C considerations",
            "Procedural_Issue": "Timing of judicial review relative to scheduled removal date and issuance of stay",
            "Review_Standard": "Reasonableness or correctness, depending on nature of decision under review",
            "Credibility_Assessment": "Not applicable – case dismissed on procedural grounds",
            "Evidence_Used": "Existence of pending H&C application, removal order, stay granted by court",
            "Legal_Provision_Cited": "Section 248 of IRPA (deferral of removal)",
            "Application_Basis": "Request for deferral based on humanitarian and compassionate grounds",
            "Evidence_Assessed": "Pending status of H&C application and compliance with interim stay",
            "Relief_Sought": "Deferral of removal and judicial review of refusal decision",
            "Governing_Rule": "A court will not decide a moot issue unless it serves a public interest or resolves a recurring controversy",
            "Evidentiary_Deficiency": "None identified – dismissal not based on lack of evidence",
            "Outcome": "Dismissal of judicial review application without addressing merits",
            "Decisional_Body": "Federal Court of Canada",
            "Harm_Assessment": "No immediate harm established due to continued presence in Canada under stay",
            "Cause_Description": "Applicants overstayed visas, were denied refugee status, and sought deferral of removal based on pending H&C application",
            "Evidence_Handling": "Court acknowledged administrative record including removal order and stay",
            "Legal_Provision_Violated": "IRPA provisions regarding unauthorized stay (s. 117)",
            "Evidence_Issues": "None – matter turned on legal mootness, not factual disputes",
            "Residency_Compliance": "Non-compliant – overstayed authorized period",
            "Misrepresentation_Element": "Not alleged in this context",
            "Legal_Provision": "IRPA s. 117(1) – obligation to leave after expiry of status",
            "Jurisdictional_Issue": "Federal Court jurisdiction over immigration matters and judicial review",
            "Evidence_Assessment": "Limited – focused on procedural posture rather than factual evaluation",
            "Decision_Rationale": "No live controversy exists; deciding the issue would not affect the rights of the parties or provide practical benefit",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Immigration Enforcement Officer (initial), Federal Court (review)",
            "Evidentiary_Issues": "None raised",
            "Legal_Standard_Applied": "Mootness doctrine in administrative law"
        },
        {
            "Crime_Name": "Failure to comply with removal order",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Non-compliance with removal order",
            "Legal_Issue": "Whether judicial review of refusal to defer removal is moot after scheduled removal date passes and applicant remains in Canada",
            "Governing_Law": "Immigration and Refugee Protection Act (IRPA)",
            "Application_Facts": "Applicants subject to removal order remained in Canada due to court-issued stay. Enforcement officer denied request to defer removal based on pending H&C application. Judicial review filed but removal date had passed before hearing.",
            "Decision_Outcome": "Application dismissed as moot",
            "Remedy_Requested": "Judicial review of enforcement officer's refusal to defer removal",
            "Court_Ruling": "The issue is moot because the removal did not occur and the申请人 already benefit from de facto deferral via court stay",
            "Claimant_Status": "Foreign nationals under removal order with pending H&C application",
            "Defendant_Behavior": "Enforcement officer exercised discretion not to defer removal despite H&C application",
            "Grounds_for_Claim": "Pending humanitarian and compassionate application requiring consideration prior to removal",
            "Legal_Standard": "An application for judicial review must involve a live controversy to be justiciable",
            "Assessment_Factor": "Whether resolution of the issue would have any practical legal effect on the parties",
            "Applicable_Legislation": "IRPA, particularly sections governing removal deferrals and H&C applications",
            "Procedural_Issue": "Timing of judicial review following expiration of scheduled removal date",
            "Review_Standard": "Standard of review depends on nature of administrative decision, typically reasonableness",
            "Credibility_Assessment": "Not applicable – case decided on procedural mootness grounds",
            "Evidence_Used": "Removal order, record of pending H&C application, court-issued stay of removal",
            "Legal_Provision_Cited": "IRPA s. 248 – authority to defer removal",
            "Application_Basis": "Request for deferral based on humanitarian and compassionate grounds",
            "Evidence_Assessed": "Existence and status of H&C application, validity of stay order",
            "Relief_Sought": "Deferral of removal and quashing of refusal decision via judicial review",
            "Governing_Rule": "Courts generally decline to hear cases lacking a live controversy unless they present issues of public importance",
            "Evidentiary_Deficiency": "None found – dismissal based on procedural mootness",
            "Outcome": "Dismissal of judicial review application without reaching merits",
            "Decisional_Body": "Federal Court of Canada",
            "Harm_Assessment": "No immediate harm demonstrated given ongoing stay preventing removal",
            "Cause_Description": "Applicants failed to comply with removal order due to pending H&C claims and court-issued stay",
            "Evidence_Handling": "Court reviewed administrative file and judicial stay documentation",
            "Legal_Provision_Violated": "IRPA provisions concerning compliance with removal orders (e.g., s. 117, s. 44)",
            "Evidence_Issues": "None – matter resolved on legal basis",
            "Residency_Compliance": "Non-compliant – remained beyond authorized period and under active removal order",
            "Misrepresentation_Element": "Not alleged",
            "Legal_Provision": "IRPA s. 44 – effect of removal order; s. 248 – deferral of removal",
            "Jurisdictional_Issue": "Federal Court jurisdiction over immigration decisions and stays",
            "Evidence_Assessment": "Focused on procedural record, not credibility or new evidence",
            "Decision_Rationale": "No practical impact would result from ruling on the refusal since removal did not occur and applicants remain legally present under stay",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Immigration Enforcement Officer (initial), Federal Court (review)",
            "Evidentiary_Issues": "None identified",
            "Legal_Standard_Applied": "Doctrine of mootness in administrative and judicial review contexts"
        }
    ]
}