{
    "Case ID": "061541",
    "Crime_Name": [
        "Citizenship Residency Requirement Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency Requirement Non-Compliance"
    ],
    "Legal_Issue": [
        "Whether the Citizenship Judge correctly applied the residency requirements under s. 5(1)(c) of the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act, s. 5(1)(c)"
    ],
    "Application_Facts": [
        "Applicant must accumulate 1,095 days of physical presence in Canada within 4 years preceding application",
        "Applicant owned property in Canada and returned after absences",
        "Citizenship Judge focused solely on physical presence"
    ],
    "Decision_Outcome": [
        "Denial of citizenship application due to insufficient physical presence"
    ],
    "Remedy_Requested": [
        "Appeal of the Citizenship Judge's decision"
    ],
    "Court_Ruling": [
        "Appeal granted; case remanded for new determination"
    ],
    "Claimant_Status": [
        "Citizenship applicant"
    ],
    "Defendant_Behavior": [
        "Citizenship Judge failed to consider quality of connection and pre-existing residency"
    ],
    "Grounds_for_Claim": [
        "Legal error in assessing residency by ignoring non-physical indicators of residence"
    ],
    "Legal_Standard": [
        "Residency may be established through physical presence, quality of attachment, or centralized mode of living"
    ],
    "Assessment_Factor": [
        "Physical presence, quality of connection to Canada, property ownership, pattern of return after travel"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Federal Court review of administrative decision"
    ],
    "Review_Standard": [
        "Reasonableness or correctness (implied by court identifying legal error)"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence of property ownership, travel history, ties to Canada"
    ],
    "Legal_Provision_Cited": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Application_Basis": [
        "Failure to meet 1,095-day physical presence requirement as narrowly interpreted"
    ],
    "Evidence_Assessed": [
        "Physical presence records, evidence of ongoing connections to Canada"
    ],
    "Relief_Sought": [
        "Grant of citizenship or reassessment of application"
    ],
    "Governing_Rule": [
        "Residency requires 1,095 days in Canada within 4 years, assessed holistically"
    ],
    "Evidentiary_Deficiency": [
        "Failure to consider evidence of quality of connection"
    ],
    "Outcome": [
        "Appeal granted, case referred back for new assessment"
    ],
    "Decisional_Body": [
        "Citizenship Judge (initial), Federal Court (appellate)"
    ],
    "Harm_Assessment": [
        "Unfair denial of citizenship due to incomplete legal analysis"
    ],
    "Cause_Description": [
        "Applicant's citizenship application was denied due to perceived failure to meet residency requirements"
    ],
    "Evidence_Handling": [
        "Incomplete consideration of relevant evidence regarding residency"
    ],
    "Legal_Provision_Violated": [
        "s. 5(1)(c) of the Citizenship Act (alleged)"
    ],
    "Evidence_Issues": [
        "Overemphasis on physical presence; disregard of other residency indicators"
    ],
    "Residency_Compliance": [
        "Disputed – applicant met qualitative but not strictly quantitative criteria"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Insufficient evaluation of non-physical residency factors"
    ],
    "Decision_Rationale": [
        "Judge erred in law by failing to consider all aspects of residency"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Commission (via Citizenship Judge), reviewed by Federal Court"
    ],
    "Evidentiary_Issues": [
        "Narrow interpretation of residency excluding relevant contextual evidence"
    ],
    "Legal_Standard_Applied": [
        "Objective assessment of residency based on totality of circumstances"
    ]
}