{
    "Case ID": "067027",
    "Crime_Name": [
        "Citizenship Application Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the citizenship judge correctly determine that Dr. Ahmed failed to meet the residence requirements under paragraph 5(1)(c) of the Citizenship Act?"
    ],
    "Governing_Law": [
        "Citizenship Act, paragraph 5(1)(c)"
    ],
    "Application_Facts": [
        "Dr. Ahmed was present for only 235 days in the four years before his application. Evidence showed he did not establish residence before leaving for Afghanistan."
    ],
    "Decision_Outcome": [
        "The citizenship judge's decision was correct; Dr. Ahmed did not meet the residence requirement."
    ],
    "Remedy_Requested": [
        "Appeal to Federal Court to overturn the citizenship judge's decision"
    ],
    "Court_Ruling": [
        "Appeal dismissed"
    ],
    "Claimant_Status": [
        "Dr. Ahmed, citizenship applicant"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Inadequate analysis and failure to consider surrounding circumstances by the citizenship judge"
    ],
    "Legal_Standard": [
        "Applicant must accumulate at least 1095 days of residence in Canada within four years preceding the application"
    ],
    "Assessment_Factor": [
        "Number of days physically present in Canada",
        "Establishment of residence in Canada"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Appeal to Federal Court challenging administrative decision"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Record of Dr. Ahmed’s physical presence (235 days)",
        "Evidence regarding lack of established residence in Canada"
    ],
    "Legal_Provision_Cited": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Application_Basis": [
        "Residence requirement for citizenship eligibility"
    ],
    "Evidence_Assessed": [
        "Dr. Ahmed’s residency history and ties to Canada"
    ],
    "Relief_Sought": [
        "Overturning of the citizenship judge’s decision and approval of citizenship application"
    ],
    "Governing_Rule": [
        "Paragraph 5(1)(c) of the Citizenship Act requires 1095 days of physical residence within four years prior to application"
    ],
    "Evidentiary_Deficiency": [
        "Failure to provide sufficient evidence of residence in Canada"
    ],
    "Outcome": [
        "Appeal dismissed"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Dr. Ahmed's citizenship application was denied due to insufficient residency days"
    ],
    "Evidence_Handling": [
        "The court reviewed the evidence of Dr. Ahmed’s presence and residence patterns"
    ],
    "Legal_Provision_Violated": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Lack of proof establishing residential ties in Canada"
    ],
    "Residency_Compliance": [
        "Failed – only 235 days of residence in the required period"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Evidence showed Dr. Ahmed did not establish residence in Canada prior to departure"
    ],
    "Decision_Rationale": [
        "Dr. Ahmed did not meet the statutory residence requirement of 1095 days and failed to prove establishment of residence"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship judge, reviewed by Federal Court"
    ],
    "Evidentiary_Issues": [
        "Insufficient documentation or proof of Canadian residence"
    ],
    "Legal_Standard_Applied": [
        "Objective assessment of physical presence and residence establishment under the Citizenship Act"
    ]
}