{
    "Case ID": "067018",
    "Crimes": [
        {
            "Crime_Name": "Impaired driving over 80 mg of alcohol in 100 ml of blood",
            "Crime_Type": "Violations of Immigration Regulations",
            "Legal_Issue": "Was the revocation of the applicant's pardon based on his impaired driving conviction reasonable under section 7(b) of the Criminal Records Act?",
            "Governing_Law": "Section 7(b) of the Criminal Records Act",
            "Application_Facts": "The applicant was convicted of driving with a blood alcohol level of 147mg/100ml, nearly twice the legal limit. The Board considered this, along with other factors like endangering public safety, in concluding he was no longer of good conduct.",
            "Decision_Outcome": "The Board reasonably exercised its discretion, and the revocation of the pardon was lawful.",
            "Cause_Description": "The applicant's conviction for impaired driving led to the pardon revocation process.",
            "Procedure": "Judicial review analyzed whether the Board's decision was reasonable or violated procedural fairness.",
            "Outcome": "The application for judicial review was dismissed, upholding the pardon revocation.",
            "Decisional_Body": "Parole Board",
            "Legal_Provision_Cited": "Section 7(b) of the Criminal Records Act",
            "Governing_Rule": "Under section 7(b) of the Criminal Records Act, the Parole Board has exclusive jurisdiction and discretion to revoke a pardon if it finds the person is no longer of good conduct.",
            "Assessment_Factor": "Seriousness of the offence, blood alcohol level, public safety risk",
            "Defendant_Behavior": "Driving with a blood alcohol concentration of 147mg/100ml",
            "Review_Standard": "Reasonableness of the Board's decision",
            "Remedy_Requested": "Judicial review of the pardon revocation",
            "Court_Ruling": "Dismissed the application for judicial review"
        },
        {
            "Crime_Name": "Conspiracy to export pseudoephedrine",
            "Crime_Type": "Property Crimes",
            "Legal_Issue": "Did the Parole Board of Canada reasonably revoke the applicant's pardon based on his subsequent conviction for driving with a blood alcohol level exceeding the legal limit?",
            "Governing_Law": "Section 2.1 and paragraph 7(b) of the Criminal Records Act",
            "Procedural_Stage": "Judicial review following pardon revocation",
            "Evidence_Assessment": "Conviction in 2007 for conspiring to export pseudoephedrine; pardon granted in 2011; 2012 conviction for impaired driving with BAC nearly twice the legal limit",
            "Decision_Outcome": "The Board's decision to revoke the pardon was reasonable, as it properly exercised its discretion under the Act by considering all relevant factors, including the seriousness of the offence and its implications for public safety.",
            "Cause_Description": "The applicant's conviction for driving with a high blood alcohol level led to the revocation of his pardon.",
            "Applicant_Challenge": "Argued lack of procedural fairness and unreasonable exercise of discretion by the Board",
            "Outcome_on_Merits": "The court dismissed the application for judicial review, upholding the Board's decision to revoke the pardon.",
            "Decision_Authority": "Parole Board of Canada",
            "Judicial_Review_Outcome": "Application dismissed",
            "Legal_Framework": "Criminal Records Act, sections 2.1 and 7(b)",
            "Standard_of_Review": "Reasonableness",
            "Procedural_Fairness_Assessment": "Board's procedures were found to be fair",
            "Key_Evidence_Considered": "2012 impaired driving conviction, prior criminal history, public safety concerns",
            "Legal_Provision_Cited": "Sections 2.1 and 7(b) of the Criminal Records Act",
            "Remedy_Sought": "Restoration of the record suspension (pardon)",
            "Resolution_Mechanism": "Judicial review",
            "Jurisdiction": "Parole Board of Canada",
            "Claimant_Status": "Individual with a previously granted pardon"
        }
    ]
}