{
    "Case ID": "067942",
    "Crime_Name": [
        "Unknown (Labour Law Dispute)"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Was the termination of Spencer's term employment an improper lay-off under the Work Force Adjustment provisions?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Spencer worked under secondment agreements with Parks as her home employer until August 20, 2004; afterward, she became a dual employee of Environment Canada. The indicia of employment showed Parks as her primary employer during the secondment period."
    ],
    "Decision_Outcome": [
        "The Federal Court dismissed the application, finding the ADM's decision reasonable and within the acceptable range of outcomes based on facts and law."
    ],
    "Remedy_Requested": [
        "Judicial review of the ADM's decision denying Spencer's grievance over her employment termination."
    ],
    "Court_Ruling": [
        "The application for judicial review was dismissed, upholding the ADM's decision."
    ],
    "Claimant_Status": [
        "Spencer, former term employee seeking conversion to indeterminate status."
    ],
    "Defendant_Behavior": [
        "ADM denied Spencer's grievance regarding termination of employment."
    ],
    "Grounds_for_Claim": [
        "Alleged improper lay-off contrary to Work Force Adjustment provisions and Term Employment Policy."
    ],
    "Legal_Standard": [
        "Reasonableness standard applied in judicial review."
    ],
    "Assessment_Factor": [
        "Three years of cumulative employment in the same department without a break exceeding 60 days required for conversion to indeterminate status."
    ],
    "Applicable_Legislation": [
        "Term Employment Policy"
    ],
    "Procedural_Issue": [
        "Judicial review process involved analyzing the standard of review, applicability of the Term Employment Policy, and factual circumstances of Spencer's employment."
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Indicia of employment showing Parks as primary employer during secondment."
    ],
    "Legal_Provision_Cited": [
        "Work Force Adjustment provisions",
        "Term Employment Policy"
    ],
    "Application_Basis": [
        "Eligibility for conversion to indeterminate status under the Term Employment Policy."
    ],
    "Evidence_Assessed": [
        "Factual circumstances of Spencer's employment, including secondment agreements and dual employment status."
    ],
    "Relief_Sought": [
        "Judicial review of administrative decision denying grievance."
    ],
    "Governing_Rule": [
        "The Term Employment Policy requires three years of cumulative employment in the same department without a break exceeding 60 days for conversion to indeterminate status."
    ],
    "Evidentiary_Deficiency": [],
    "Outcome": [
        "Application for judicial review dismissed."
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Spencer's grievance over her employment termination was denied by the ADM, leading to judicial review."
    ],
    "Evidence_Handling": [
        "Analysis of employment records and secondment agreements to determine primary employer and eligibility."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Term Employment Policy",
        "Work Force Adjustment provisions"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Employment relationships and duration assessed to determine compliance with policy."
    ],
    "Decision_Rationale": [
        "ADM's decision was found to be reasonable and within the acceptable range of outcomes based on facts and law."
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Assistant Deputy Minister (ADM)"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Reasonableness"
    ]
}