{
    "Case ID": "073195",
    "Crime_Name": [
        "Citizenship Residency Requirement Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency Requirement Non-Compliance"
    ],
    "Legal_Issue": [
        "Whether Mr. Cheung met the residency requirement under s. 5(1)(c) of the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act, s. 5(1)(c)"
    ],
    "Application_Facts": [
        "Mr. Cheung was absent from Canada for 1,054 days during the four-year period before applying; held a Returning Resident Permit and maintained ties to Canada"
    ],
    "Decision_Outcome": [
        "Appeal allowed; Mr. Cheung deemed eligible for Canadian citizenship"
    ],
    "Remedy_Requested": [
        "Grant of Canadian citizenship"
    ],
    "Court_Ruling": [
        "The appeal judge concluded that absences were temporary and residency in Canada was established"
    ],
    "Claimant_Status": [
        "Applicant for Canadian citizenship"
    ],
    "Defendant_Behavior": [
        "Extended absences from Canada exceeding 1,000 days within the required period"
    ],
    "Grounds_for_Claim": [
        "Denial of citizenship due to alleged failure to meet minimum physical presence requirement"
    ],
    "Legal_Standard": [
        "Minimum three years (1,095 days) of physical residence in Canada within four years prior to application"
    ],
    "Assessment_Factor": [
        "Nature and purpose of absences, maintenance of residential ties in Canada"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Appeal from citizenship judge’s decision via trial de novo"
    ],
    "Review_Standard": [
        "Correctness and factual sufficiency"
    ],
    "Credibility_Assessment": [
        "Not explicitly challenged; evidence of ties to Canada accepted"
    ],
    "Evidence_Used": [
        "Returning Resident Permit, proof of property ownership, family ties, employment links in Canada"
    ],
    "Legal_Provision_Cited": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Application_Basis": [
        "Accrual of residency days under the Citizenship Act"
    ],
    "Evidence_Assessed": [
        "Duration and character of absences, strength of connections to Canada"
    ],
    "Relief_Sought": [
        "Overturning of citizenship refusal and approval of application"
    ],
    "Governing_Rule": [
        "An applicant must have been physically present in Canada for at least 1,095 days within the four years preceding the application"
    ],
    "Evidentiary_Deficiency": [
        "Initial determination found insufficient residency days"
    ],
    "Outcome": [
        "Appeal granted; eligibility for citizenship confirmed"
    ],
    "Decisional_Body": [
        "Appeal Judge"
    ],
    "Harm_Assessment": [
        "Unjust denial of citizenship rights based on strict interpretation of residency"
    ],
    "Cause_Description": [
        "Mr. Cheung's application was denied due to insufficient residency days as per the Citizenship Act"
    ],
    "Evidence_Handling": [
        "Comprehensive review of all evidence regarding travel and residential ties"
    ],
    "Legal_Provision_Violated": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Dispute over whether absences were temporary or broke continuity of residence"
    ],
    "Residency_Compliance": [
        "Initially found non-compliant; ultimately determined compliant due to temporary nature of absences"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act, s. 5(1)(c)"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Absences considered temporary; strong residential ties supported continued residency status"
    ],
    "Decision_Rationale": [
        "Despite lengthy absences, Mr. Cheung maintained significant ties to Canada, indicating intent to reside permanently"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Canadian citizenship appeal authority"
    ],
    "Evidentiary_Issues": [
        "Weight given to Returning Resident Permit and ongoing personal/economic ties"
    ],
    "Legal_Standard_Applied": [
        "Interpretation of 'residence' under the Citizenship Act including intent and continuity"
    ]
}