{
    "Case ID": "073452",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Board erred in failing to assess Ms. Pastrana's fear of persecution as a member of a particular social group (common-law spouse of Mr. Malagon)"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Ms. Pastrana's claim was dismissed without considering her status as Mr. Malagon's spouse, despite evidence suggesting former conscripts and their families are targeted in Colombia"
    ],
    "Decision_Outcome": [
        "The application for judicial review is allowed, and the matter is remitted to the Board for reconsideration"
    ],
    "Remedy_Requested": [
        "Judicial review"
    ],
    "Court_Ruling": [
        "Allowed"
    ],
    "Claimant_Status": [
        "Refugee claimant, common-law spouse of Mr. Malagon"
    ],
    "Defendant_Behavior": [
        "Board dismissed claim without assessing membership in a particular social group"
    ],
    "Grounds_for_Claim": [
        "Fear of persecution as a member of a particular social group"
    ],
    "Legal_Standard": [
        "The Board must consider all grounds for refugee claims, even if not explicitly raised by the claimant"
    ],
    "Assessment_Factor": [
        "Membership in a particular social group, risk of persecution in Colombia"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Failure to assess a protected ground under the Refugee Convention"
    ],
    "Review_Standard": [
        "Reasonableness or correctness (implied by judicial review context)"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence suggesting former conscripts and their families are targeted in Colombia"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Refugee claim based on family relationship to a former conscript"
    ],
    "Evidence_Assessed": [
        "Insufficient evidence found initially; new assessment required on remittal"
    ],
    "Relief_Sought": [
        "Reconsideration of refugee claim"
    ],
    "Governing_Rule": [
        "The Board must consider all grounds for refugee claims, even if not explicitly raised by the claimant"
    ],
    "Evidentiary_Deficiency": [
        "Initial decision lacked assessment of key social group membership"
    ],
    "Outcome": [
        "Case remanded to the Board for reconsideration"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Risk of persecution due to association with a former conscript in Colombia"
    ],
    "Cause_Description": [
        "Ms. Pastrana's refugee claim was dismissed due to insufficient evidence of persecution on Convention grounds"
    ],
    "Evidence_Handling": [
        "Evidence of targeting of families of former conscripts was present but not adequately assessed"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Failure to consider relevant evidence regarding family-based persecution"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Board did not assess evidence related to membership in particular social group"
    ],
    "Decision_Rationale": [
        "Board has duty to proactively consider all possible Convention grounds for persecution"
    ],
    "Country_of_Origin": [
        "Colombia"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Key evidence regarding social group membership was overlooked"
    ],
    "Legal_Standard_Applied": [
        "Obligation to assess all potential grounds for refugee protection"
    ]
}