{
    "Case ID": "076089",
    "Crime_Name": [
        "Refugee Claim Rejection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Board's decision to deny the applicant's refugee claim based on lack of objective fear and existence of an internal flight alternative (IFA) was reasonable"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act"
    ],
    "Application_Facts": [
        "The applicant claimed persecution due to political affiliation but failed to provide sufficient evidence. The Board found Lahore as a viable IFA."
    ],
    "Decision_Outcome": [
        "The Board rejected the refugee claim."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "The application for judicial review was dismissed."
    ],
    "Claimant_Status": [
        "Applicant seeking refugee status"
    ],
    "Defendant_Behavior": [
        "Board denied the refugee claim based on lack of objective fear and existence of IFA"
    ],
    "Grounds_for_Claim": [
        "Persecution due to political affiliation"
    ],
    "Legal_Standard": [
        "Reasonableness"
    ],
    "Assessment_Factor": [
        "Justification, transparency, and intelligibility in the decision-making process"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act subsection 72(1)"
    ],
    "Procedural_Issue": [
        "Judicial review under subsection 72(1) of the Immigration and Refugee Protection Act"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Lack of sufficient evidence supporting political persecution; existence of internal flight alternative (Lahore)"
    ],
    "Legal_Provision_Cited": [
        "Immigration and Refugee Protection Act, subsection 72(1)"
    ],
    "Application_Basis": [
        "Applicant must prove persecution risk or unreasonable relocation within their country"
    ],
    "Evidence_Assessed": [
        "Evidence regarding political affiliation and safety in Lahore"
    ],
    "Relief_Sought": [
        "Overturning of the Board's decision denying refugee claim"
    ],
    "Governing_Rule": [
        "The standard of review is reasonableness, considering justification, transparency, and intelligibility in the decision-making process."
    ],
    "Evidentiary_Deficiency": [
        "Insufficient evidence provided by applicant to establish objective fear of persecution"
    ],
    "Outcome": [
        "Application for judicial review dismissed; Board's decision upheld"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "The applicant's refugee claim was denied by the Board, prompting a judicial review."
    ],
    "Evidence_Handling": [
        "Board assessed evidence and determined it insufficient to prove persecution risk"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Lack of objective evidence supporting fear of persecution"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Immigration and Refugee Protection Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The Board evaluated the applicant’s evidence and concluded that the fear was not objectively grounded and that relocation to Lahore was feasible"
    ],
    "Decision_Rationale": [
        "The Board found no objective basis for fear of persecution and identified Lahore as a viable internal flight alternative"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Failure to provide sufficient corroborating evidence for political persecution claim"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness"
    ]
}