{
    "Case ID": "076132",
    "Crime_Name": [
        "Citizenship Residency Requirement Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency Requirement Non-Compliance"
    ],
    "Legal_Issue": [
        "Whether Hsu met the residency requirement for Canadian citizenship under s. 5(1)(c) of the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act, s. 5(1)(c)"
    ],
    "Application_Facts": [
        "Hsu was absent from Canada for 976 days and present for only 119 days during the four-year period preceding his application; lived and worked in Taiwan with occasional visits to Canada"
    ],
    "Decision_Outcome": [
        "Appeal dismissed"
    ],
    "Remedy_Requested": [
        "Grant of Canadian citizenship"
    ],
    "Court_Ruling": [
        "Hsu did not meet the legal residency requirement for citizenship"
    ],
    "Claimant_Status": [
        "Applicant for Canadian citizenship"
    ],
    "Defendant_Behavior": [
        "Resided primarily in Taiwan, maintained employment there, and had limited physical presence in Canada"
    ],
    "Grounds_for_Claim": [
        "Failure to accumulate 1,095 days of physical residence in Canada within the required four-year period"
    ],
    "Legal_Standard": [
        "Must have at least 1,095 days of residence in Canada within four years before application"
    ],
    "Assessment_Factor": [
        "Centralized mode of living not established in Canada despite family ties"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Trial de novo before Federal Court Trial Division due to appeal timing under pre-1998 rules"
    ],
    "Review_Standard": [
        "Statutory interpretation and factual assessment under trial de novo standard"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Record of entries and exits, employment records in Taiwan, duration of stays in Canada"
    ],
    "Legal_Provision_Cited": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Application_Basis": [
        "Accrual of residency days under Canadian citizenship law"
    ],
    "Evidence_Assessed": [
        "Duration and pattern of physical presence in Canada"
    ],
    "Relief_Sought": [
        "Recognition as a Canadian citizen"
    ],
    "Governing_Rule": [
        "Applicant must accumulate at least 1,095 days of residence in Canada within four years preceding the application"
    ],
    "Evidentiary_Deficiency": [
        "Insufficient documentation or proof of physical residence meeting statutory threshold"
    ],
    "Outcome": [
        "Appeal dismissed; Hsu remains ineligible for citizenship"
    ],
    "Decisional_Body": [
        "Federal Court Trial Division"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Hsu's failure to establish a centralized mode of living in Canada despite having family there"
    ],
    "Evidence_Handling": [
        "Evaluation of residency patterns based on travel and employment records"
    ],
    "Legal_Provision_Violated": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Lack of sufficient evidence demonstrating compliance with residency requirement"
    ],
    "Residency_Compliance": [
        "Not satisfied – only 119 days physically present in Canada"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "s. 5(1)(c) of the Citizenship Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Factual determination based on official records of presence and absence"
    ],
    "Decision_Rationale": [
        "The applicant did not fulfill the statutory requirement of 1,095 days of residence and failed to demonstrate that Canada was the center of his daily life"
    ],
    "Country_of_Origin": [
        "Taiwan"
    ],
    "Decision_Making_Body": [
        "Federal Court Trial Division"
    ],
    "Evidentiary_Issues": [
        "Absence of corroborating evidence showing intent to reside in Canada or substantial physical presence"
    ],
    "Legal_Standard_Applied": [
        "Objective measurement of physical presence and centrality of mode of living"
    ]
}