{
    "Case ID": "076491",
    "Crime_Name": [
        "Pre-Removal Risk Assessment (PRRA) Rejection"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Officer apply the wrong legal test for, or entirely fail to conduct, a s. 96 analysis under the Immigration and Refugee Protection Act?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Application_Facts": [
        "The applicant claimed a well-founded fear of persecution upon return to Sri Lanka based on political opinion and membership in a particular social group."
    ],
    "Decision_Outcome": [
        "The PRRA officer concluded there was no credible evidence of personalized risk or Convention refugee status."
    ],
    "Remedy_Requested": [
        "Judicial review of the PRRA decision."
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [
        "The PRRA officer conducted an assessment and rejected the application based on lack of credible evidence."
    ],
    "Grounds_for_Claim": [
        "Well-founded fear of persecution based on political opinion and social group membership."
    ],
    "Legal_Standard": [
        "Under s. 96 of IRPA, an applicant must demonstrate a well-founded fear of persecution based on race, religion, nationality, social group, or political opinion."
    ],
    "Assessment_Factor": [
        "Credibility of the applicant's claims, evidence of personalized risk, country conditions in Sri Lanka."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act, Section 96"
    ],
    "Procedural_Issue": [
        "Judicial review in Federal Court to assess correctness of legal test and reasonableness of factual findings."
    ],
    "Review_Standard": [
        "Correctness for legal test application; reasonableness for factual application."
    ],
    "Credibility_Assessment": [
        "The officer found insufficient credible evidence supporting the applicant’s claimed risk."
    ],
    "Evidence_Used": [
        "Applicant's statements, country condition reports, documentation related to past incidents."
    ],
    "Legal_Provision_Cited": [
        "Section 96, IRPA"
    ],
    "Application_Basis": [
        "Personalized risk of persecution due to political activities and affiliation."
    ],
    "Evidence_Assessed": [
        "Affidavits, incident reports, country condition documentation."
    ],
    "Relief_Sought": [
        "Overturning of PRRA rejection and reassessment of risk."
    ],
    "Governing_Rule": [
        "An applicant must meet the definition of a Convention refugee under s. 96 IRPA by demonstrating a well-founded fear of persecution."
    ],
    "Evidentiary_Deficiency": [
        "Lack of corroborative evidence and inconsistencies in the applicant's narrative."
    ],
    "Outcome": [
        "Decision upheld; no error found in law or unreasonableness in fact."
    ],
    "Decisional_Body": [
        "PRRA Officer, Immigration, Refugees and Citizenship Canada"
    ],
    "Harm_Assessment": [
        "Alleged risk of torture or persecution upon return to Sri Lanka."
    ],
    "Cause_Description": [
        "The applicant claimed the PRRA officer incorrectly applied legal tests and made unreasonable decisions regarding his risk of persecution upon return to Sri Lanka."
    ],
    "Evidence_Handling": [
        "The officer considered all submissions but found them insufficient to establish a credible basis for fear."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Perceived lack of corroboration and credibility gaps in personal account."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Section 96, IRPA"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Reviewed for credibility, consistency, and alignment with country conditions."
    ],
    "Decision_Rationale": [
        "The decision was found to be within a reasonable range of outcomes despite minor errors."
    ],
    "Country_of_Origin": [
        "Sri Lanka"
    ],
    "Decision_Making_Body": [
        "Pre-Removal Risk Assessment Officer"
    ],
    "Evidentiary_Issues": [
        "Insufficient objective evidence to support subjective fear claims."
    ]
}