{
    "Case ID": "077314",
    "Crime_Name": [
        "Citizenship Residency Requirement Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Residency requirement failure"
    ],
    "Legal_Issue": [
        "Whether the citizenship judge correctly applied the residency requirement under the Citizenship Act"
    ],
    "Governing_Law": [
        "Citizenship Act"
    ],
    "Application_Facts": [
        "Dr. Udwadia was physically present in Canada for only 717 days during the four-year period preceding his application, falling short of the required 1095 days"
    ],
    "Decision_Outcome": [
        "The citizenship judge's decision was found unreasonable"
    ],
    "Remedy_Requested": [
        "Judicial review of the citizenship judge's decision"
    ],
    "Court_Ruling": [
        "Appeal granted; citizenship judge's decision overturned"
    ],
    "Claimant_Status": [
        "Minister of Immigration, Refugees and Citizenship"
    ],
    "Defendant_Behavior": [
        "Dr. Udwadia maintained connections to Canada but spent insufficient physical time in the country"
    ],
    "Grounds_for_Claim": [
        "Failure to meet statutory physical presence requirement for citizenship"
    ],
    "Legal_Standard": [
        "Three out of four years residency requirement (1095 days) under the Citizenship Act"
    ],
    "Assessment_Factor": [
        "Physical presence in Canada during the relevant period"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Judicial review of administrative decision by Federal Court"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Record of Dr. Udwadia's physical presence in Canada (717 days)"
    ],
    "Legal_Provision_Cited": [
        "Citizenship Act residency requirement (three out of four years)"
    ],
    "Application_Basis": [
        "Two-step test: establishing residence and meeting total days requirement"
    ],
    "Evidence_Assessed": [
        "Duration and pattern of physical presence in Canada"
    ],
    "Relief_Sought": [
        "Overturning of citizenship grant and requirement to reapply"
    ],
    "Governing_Rule": [
        "Applicant must reside in Canada for three out of four years (1095 days) before applying"
    ],
    "Evidentiary_Deficiency": [
        "Insufficient documentation or proof of required physical presence"
    ],
    "Outcome": [
        "Appeal allowed; Dr. Udwadia must reapply for citizenship"
    ],
    "Decisional_Body": [
        "Federal Court"
    ],
    "Harm_Assessment": [
        "Risk of granting citizenship contrary to statutory requirements"
    ],
    "Cause_Description": [
        "Dr. Udwadia's insufficient physical presence in Canada during the required period despite intentions to make Canada his home"
    ],
    "Evidence_Handling": [
        "Court assessed immigration records and travel history"
    ],
    "Legal_Provision_Violated": [
        "Citizenship Act - Residency Requirement"
    ],
    "Evidence_Issues": [
        "Discrepancy between claimed residency and actual physical presence"
    ],
    "Residency_Compliance": [
        "Not met"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Citizenship Act, residency requirement"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Objective measurement of days present in Canada"
    ],
    "Decision_Rationale": [
        "Statutory residency requirement is clear and must be strictly met; intent does not substitute for physical presence"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Judge (initial), Federal Court (on appeal)"
    ],
    "Evidentiary_Issues": [
        "Lack of sufficient evidence to support fulfillment of 1095-day requirement"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard in judicial review of administrative decisions"
    ]
}