{
    "Case ID": "079330",
    "Crime_Name": [
        "Disability Pension Eligibility"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Was the Designated Member's decision to grant leave to appeal reasonable?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "The Minister argued that the Review Tribunal ignored evidence about the applicant's capabilities, medical advice, and earnings."
    ],
    "Decision_Outcome": [
        "The Designated Member's decision was reasonable as it identified relevant facts not adequately considered by the Review Tribunal."
    ],
    "Remedy_Requested": [
        "Judicial review of the Designated Member's decision to grant leave to appeal"
    ],
    "Court_Ruling": [
        "Application for judicial review dismissed; leave to appeal granted."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Dispute over eligibility for Canada Pension Plan disability benefits due to alleged oversight of key evidence."
    ],
    "Legal_Standard": [
        "Reasonableness standard"
    ],
    "Assessment_Factor": [
        "Relevant significant facts not considered by the Review Tribunal"
    ],
    "Applicable_Legislation": [
        "Canada Pension Plan"
    ],
    "Procedural_Issue": [
        "Judicial review of the Designated Member's decision"
    ],
    "Review_Standard": [
        "Reasonableness standard"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Evidence about the applicant's capabilities, medical advice, and earnings"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Eligibility for disability pension under the Canada Pension Plan"
    ],
    "Evidence_Assessed": [
        "Capabilities, medical advice, and earnings of the applicant"
    ],
    "Relief_Sought": [
        "Leave to appeal"
    ],
    "Governing_Rule": [
        "The reasonableness standard applies to determine if an arguable case was raised, focusing on relevant significant facts not considered by the Review Tribunal."
    ],
    "Evidentiary_Deficiency": [
        "Failure by the Review Tribunal to consider key evidence regarding applicant's condition and work capacity"
    ],
    "Outcome": [
        "Leave to appeal granted"
    ],
    "Decisional_Body": [
        "Designated Member"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Dispute over eligibility for Canada Pension Plan disability benefits due to alleged oversight of key evidence."
    ],
    "Evidence_Handling": [
        "Review Tribunal allegedly failed to properly consider submitted evidence"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Omission of significant facts in the Review Tribunal’s assessment"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Designated Member found that relevant facts were not adequately considered"
    ],
    "Decision_Rationale": [
        "An arguable case was raised based on unconsidered significant facts"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Designated Member"
    ],
    "Evidentiary_Issues": [
        "Key evidence on capabilities, medical advice, and earnings not fully addressed by Review Tribunal"
    ]
}