{
    "Case ID": "084144",
    "Crimes": [
        {
            "Crime_Name": [
                "Failure to comply with immigration regulations"
            ],
            "Crime_Type": [
                "Violations of Immigration Regulations"
            ],
            "Violation_Type": [
                "Non-compliance with immigration obligations"
            ],
            "Legal_Issue": [
                "Whether the Court can exercise discretion to hear a moot case following removal from Canada"
            ],
            "Governing_Law": [
                "Immigration and Refugee Protection Act (IRPA)"
            ],
            "Application_Facts": [
                "Applicant, an Ethiopian citizen, remained in Canada after refusal of her Pre-Removal Risk Assessment (PRRA); she was subsequently removed to Ethiopia"
            ],
            "Decision_Outcome": [
                "Application dismissed"
            ],
            "Remedy_Requested": [
                "Judicial review of PRRA refusal"
            ],
            "Court_Ruling": [
                "Court declined to exercise discretion to hear the moot application"
            ],
            "Claimant_Status": [
                "Removed applicant"
            ],
            "Defendant_Behavior": [
                "Failed to depart Canada following PRRA refusal, leading to enforced removal"
            ],
            "Grounds_for_Claim": [
                "Alleged risk upon return to Ethiopia"
            ],
            "Legal_Standard": [
                "Mootness doctrine: adversarial context, judicial economy, respect for court's role"
            ],
            "Assessment_Factor": [
                "Existence of adversarial context, availability of practical remedy, risk of creating new legal categories"
            ],
            "Applicable_Legislation": [
                "IRPA, sections related to PRRA and removal orders"
            ],
            "Procedural_Issue": [
                "Application filed after removal, rendering it moot"
            ],
            "Review_Standard": [
                "Reasonableness and jurisdictional limits in moot cases"
            ],
            "Credibility_Assessment": [],
            "Evidence_Used": [
                "PRRA decision record, removal documentation"
            ],
            "Legal_Provision_Cited": [
                "Sections of IRPA governing PRRA eligibility and removal enforcement"
            ],
            "Application_Basis": [
                "Seeking quashing of PRRA refusal and stay of removal"
            ],
            "Evidence_Assessed": [
                "PRRA submission and supporting country condition evidence"
            ],
            "Relief_Sought": [
                "Judicial review of PRRA refusal, stay of removal"
            ],
            "Governing_Rule": [
                "Court may only hear moot cases if there is live controversy, adversarial interest, and utility in ruling"
            ],
            "Evidentiary_Deficiency": [],
            "Outcome": [
                "Dismissed without costs"
            ],
            "Decisional_Body": [
                "Federal Court of Canada"
            ],
            "Harm_Assessment": [
                "No irreparable harm established; no effective remedy available post-removal"
            ],
            "Cause_Description": [
                "PRRA application refused, leading to removal from Canada"
            ],
            "Evidence_Handling": [
                "Record considered but deemed insufficient to justify hearing a moot case"
            ],
            "Legal_Provision_Violated": [
                "IRPA provisions on compliance with removal orders"
            ],
            "Evidence_Issues": [],
            "Residency_Compliance": [
                "Failed to comply with conditions of stay and removal order"
            ],
            "Misrepresentation_Element": [],
            "Legal_Provision": [
                "IRPA s. 112, s. 159, and related PRRA provisions"
            ],
            "Jurisdictional_Issue": [
                "Court’s ability to intervene after removal"
            ],
            "Evidence_Assessment": [
                "Limited due to mootness"
            ],
            "Decision_Rationale": [
                "No practical remedy available; preservation of judicial resources"
            ],
            "Country_of_Origin": [
                "Ethiopia"
            ],
            "Decision_Making_Body": [
                "Canada Border Services Agency (CBSA), Immigration Division"
            ],
            "Evidentiary_Issues": [],
            "Legal_Standard_Applied": [
                "Discretionary power to hear moot appeals based on public interest and functional considerations"
            ]
        },
        {
            "Crime_Name": [
                "Overstaying visa"
            ],
            "Crime_Type": [
                "Violations of Immigration Regulations"
            ],
            "Violation_Type": [
                "Unlawful presence in Canada beyond authorized period"
            ],
            "Legal_Issue": [
                "Whether the court can hear a judicial review application after the applicant has been removed, rendering the case moot"
            ],
            "Governing_Law": [
                "Immigration and Refugee Protection Act (IRPA)"
            ],
            "Application_Facts": [
                "Applicant entered Canada multiple times, overstayed visa, withdrew refugee claims, PRRA refused, removed to Ethiopia"
            ],
            "Decision_Outcome": [
                "Application dismissed"
            ],
            "Remedy_Requested": [
                "Judicial review of PRRA refusal"
            ],
            "Court_Ruling": [
                "Court declined to exercise discretion due to mootness and lack of practical remedy"
            ],
            "Claimant_Status": [
                "Removed non-citizen"
            ],
            "Defendant_Behavior": [
                "Repeated entries, withdrawal of claims, failure to comply with immigration status"
            ],
            "Grounds_for_Claim": [
                "Risk upon return to Ethiopia"
            ],
            "Legal_Standard": [
                "Mootness doctrine: presence of adversarial context, judicial economy, institutional role"
            ],
            "Assessment_Factor": [
                "No ongoing violation in Canada, inability to provide effective relief"
            ],
            "Applicable_Legislation": [
                "IRPA, particularly sections on temporary resident status and removal"
            ],
            "Procedural_Issue": [
                "Judicial review initiated after removal, raising mootness concerns"
            ],
            "Review_Standard": [
                "Standard of reasonableness applied to PRRA decision; mootness affects justiciability"
            ],
            "Credibility_Assessment": [],
            "Evidence_Used": [
                "Immigration file, PRRA decision, travel history"
            ],
            "Legal_Provision_Cited": [
                "IRPA s. 24(1), s. 112, s. 159"
            ],
            "Application_Basis": [
                "Challenge to refusal of humanitarian and compassionate considerations and PRRA"
            ],
            "Evidence_Assessed": [
                "History of entries, claim withdrawals, and risk assessment in PRRA"
            ],
            "Relief_Sought": [
                "Quashing of PRRA refusal, stay of removal"
            ],
            "Governing_Rule": [
                "Courts may not adjudicate moot matters unless exceptional circumstances exist"
            ],
            "Evidentiary_Deficiency": [],
            "Outcome": [
                "Application dismissed without costs"
            ],
            "Decisional_Body": [
                "Federal Court of Canada"
            ],
            "Harm_Assessment": [
                "No irreparable harm demonstrated; removal already executed"
            ],
            "Cause_Description": [
                "Repeated unauthorized entries, withdrawal of refugee claims, and refusal of PRRA led to removal"
            ],
            "Evidence_Handling": [
                "Submitted but not fully assessed due to mootness"
            ],
            "Legal_Provision_Violated": [
                "IRPA provisions on temporary resident overstay and removal compliance"
            ],
            "Evidence_Issues": [],
            "Residency_Compliance": [
                "Failed to maintain lawful status or comply with removal directive"
            ],
            "Misrepresentation_Element": [],
            "Legal_Provision": [
                "IRPA s. 24(1) - status violation; s. 112 - removal order enforcement"
            ],
            "Jurisdictional_Issue": [
                "Court lacks jurisdiction to grant meaningful relief post-removal"
            ],
            "Evidence_Assessment": [
                "Considered in procedural context but not determinative due to mootness"
            ],
            "Decision_Rationale": [
                "No utility in reviewing a concluded matter where applicant is no longer in Canada"
            ],
            "Country_of_Origin": [
                "Ethiopia"
            ],
            "Decision_Making_Body": [
                "Immigration Division, CBSA"
            ],
            "Evidentiary_Issues": [],
            "Legal_Standard_Applied": [
                "Discretionary intervention in moot cases based on public interest and functional necessity"
            ]
        }
    ]
}