{
    "Case ID": "084418",
    "Crimes": [
        {
            "Crime_Name": "Overstaying visa",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration residency non-compliance",
            "Legal_Issue": "Did Ambat meet the residency requirements under s. 28 of the IRPA?",
            "Governing_Law": "Immigration and Refugee Protection Act (IRPA)",
            "Application_Facts": "Ambat spent only 312 days in Canada during the relevant five-year period and worked in the UAE.",
            "Decision_Outcome": "Federal Court dismissed Ambat's application for judicial review.",
            "Remedy_Requested": "Judicial review of IAD's decision denying residency compliance",
            "Court_Ruling": "Federal Court upheld the IAD's decision",
            "Claimant_Status": "Permanent resident of Canada",
            "Defendant_Behavior": "Resided outside Canada for extended period; claimed employment by Canadian business abroad",
            "Grounds_for_Claim": "Challenge to IAD’s finding of non-compliance with residency obligation",
            "Legal_Standard": "Physical presence in Canada for at least 730 days in any five-year period or full-time employment by a Canadian business outside Canada under s. 28 IRPA",
            "Assessment_Factor": "Duration of physical presence in Canada; legitimacy of foreign employment claim",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Alleged lack of procedural fairness in IAD proceedings",
            "Review_Standard": "Reasonableness standard applied to IAD's decision",
            "Credibility_Assessment": "IAD found that Ambat’s Canadian business was created to circumvent residency rules",
            "Evidence_Used": "Travel records, employment documentation, corporate filings of Canadian company",
            "Legal_Provision_Cited": "Section 28 of the IRPA",
            "Application_Basis": "Residency obligation based on physical presence or authorized absence due to employment",
            "Evidence_Assessed": "Nature and continuity of Canadian business operations abroad",
            "Relief_Sought": "Quashing of IAD decision and recognition of residency compliance",
            "Governing_Rule": "Under s. 28 of IRPA, permanent residents must be physically present in Canada for at least 730 days in any five-year period or employed full-time by a Canadian business outside Canada",
            "Evidentiary_Deficiency": "Lack of proof of genuine ongoing operations of Canadian business abroad",
            "Outcome": "Appeal dismissed; residency requirement not met",
            "Decisional_Body": "Immigration Appeal Division (IAD)",
            "Harm_Assessment": "Loss of travel document eligibility and risk of loss of permanent resident status",
            "Cause_Description": "Ambat's failure to meet residency obligations and the IAD's rejection of his appeal",
            "Evidence_Handling": "IAD evaluated documentary evidence regarding employment and corporate activity",
            "Legal_Provision_Violated": "Section 28 of the IRPA",
            "Evidence_Issues": "Disputed authenticity and operational reality of Canadian employer",
            "Residency_Compliance": "Not satisfied – only 312 days physically in Canada",
            "Misrepresentation_Element": "Implied attempt to misrepresent employment situation to meet residency exception",
            "Legal_Provision": "Section 28, IRPA",
            "Jurisdictional_Issue": "Authority of IAD to assess residency compliance under federal immigration law",
            "Evidence_Assessment": "IAD concluded employment claim lacked credibility",
            "Decision_Rationale": "Ambat did not meet physical presence requirement nor qualify under employment exception",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Immigration Appeal Division (IAD)",
            "Evidentiary_Issues": "Credibility of documents supporting foreign employment",
            "Legal_Standard_Applied": "Reasonableness of IAD's interpretation and application of s. 28 IRPA"
        },
        {
            "Crime_Name": "Failure to meet residency requirements under Immigration and Refugee Protection Act",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Immigration residency non-compliance",
            "Legal_Issue": "Did Ambat comply with the residency obligation under s. 28 of the IRPA?",
            "Governing_Law": "Immigration and Refugee Protection Act (IRPA)",
            "Application_Facts": "Ambat spent only 312 days in Canada during the relevant period and worked in the UAE. His claim of employment by a Canadian business was rejected as the company lacked ongoing operations in Canada.",
            "Decision_Outcome": "Federal Court dismissed Ambat's application for judicial review.",
            "Remedy_Requested": "Judicial review of IAD decision refusing travel document due to non-compliance",
            "Court_Ruling": "Federal Court upheld the IAD's decision",
            "Claimant_Status": "Permanent resident of Canada",
            "Defendant_Behavior": "Remained outside Canada without meeting physical presence or employment-based exemption criteria",
            "Grounds_for_Claim": "Dispute over whether employment abroad qualified under s. 28 exception",
            "Legal_Standard": "Permanent residents must be physically present in Canada for at least 730 days in a five-year period or employed full-time by a Canadian business outside Canada",
            "Assessment_Factor": "Actual days in Canada; validity of foreign employment arrangement",
            "Applicable_Legislation": "Immigration and Refugee Protection Act",
            "Procedural_Issue": "Allegation of errors in legal interpretation and procedural fairness before IAD",
            "Review_Standard": "Standard of reasonableness in reviewing administrative decisions",
            "Credibility_Assessment": "IAD determined the Canadian business had no real operations and was used to circumvent rules",
            "Evidence_Used": "Employment contracts, corporate registration, financial records, travel history",
            "Legal_Provision_Cited": "Section 28 of the IRPA",
            "Application_Basis": "Residency through physical presence or authorized absence via qualifying employment",
            "Evidence_Assessed": "Operational substance of the Canadian employer and nature of work performed abroad",
            "Relief_Sought": "Overturning of IAD decision and recognition of compliance with residency obligation",
            "Governing_Rule": "Under s. 28 of the IRPA, permanent residents must be physically present in Canada for at least 730 days in a five-year period or employed full-time by a Canadian business outside Canada",
            "Evidentiary_Deficiency": "Insufficient evidence of active Canadian business supporting foreign employment claim",
            "Outcome": "IAD's decision upheld; residency obligation unfulfilled",
            "Decisional_Body": "Immigration Appeal Division (IAD)",
            "Harm_Assessment": "Refusal of travel document and potential loss of permanent resident status",
            "Cause_Description": "Ambat's application for a travel document was refused due to non-compliance with residency obligations",
            "Evidence_Handling": "IAD reviewed and rejected documentary support for employment claim",
            "Legal_Provision_Violated": "Section 28 of the IRPA",
            "Evidence_Issues": "Authenticity and sufficiency of documents proving qualifying employment",
            "Residency_Compliance": "Failed – only 312 days in Canada, no valid employment exception",
            "Misrepresentation_Element": "Creation of shell Canadian business to falsely support residency exception",
            "Legal_Provision": "Section 28, IRPA",
            "Jurisdictional_Issue": "Federal jurisdiction over immigration residency determinations",
            "Evidence_Assessment": "IAD found insufficient proof of genuine employment relationship",
            "Decision_Rationale": "Ambat did not satisfy either prong of s. 28; decision was reasonable",
            "Country_of_Origin": "Not specified",
            "Decision_Making_Body": "Immigration Appeal Division (IAD)",
            "Evidentiary_Issues": "Lack of corroborating evidence for foreign employment claim",
            "Legal_Standard_Applied": "Reasonableness of IAD’s factual findings and legal interpretation"
        }
    ]
}