{
    "Case ID": "086095",
    "Crime_Name": [
        "Tax Dispute"
    ],
    "Crime_Type": [
        "Property Crimes"
    ],
    "Dispute_Type": [
        "Tax Dispute"
    ],
    "Legal_Issue": [
        "Whether Mr. Phillips' chief source of income was farming, allowing him to deduct farm losses under the Income Tax Act"
    ],
    "Governing_Law": [
        "Income Tax Act"
    ],
    "Procedural_Stage": [
        "Appeal"
    ],
    "Evidence_Assessment": [
        "Time spent on farming, capital committed, profitability, income comparison"
    ],
    "Decision_Outcome": [
        "Appeal granted; Mr. Phillips allowed farm loss deductions"
    ],
    "Burden_of_Proof": [
        "On Mr. Phillips to demonstrate farming as chief source of income"
    ],
    "Credibility_Factor": [
        "Consistency of Mr. Phillips' dedication to farming despite lower income"
    ],
    "Legal_Rule": [
        "Chief source of income determined by time, capital, and profitability, not solely income amount"
    ],
    "Standard_of_Review": [
        "Reasonableness or correctness of the original assessment"
    ],
    "Procedural_Issue": [
        "Disproportionate weight given to income by initial judge"
    ],
    "Grounds_for_Claim": [
        "Denial of farm loss deductions due to reassessment"
    ],
    "Outcome_on_Merits": [
        "In favor of Mr. Phillips"
    ],
    "Decision_Maker": [
        "Appeal Judge"
    ],
    "Judicial_Review_Outcome": [
        "Original reassessment overturned"
    ],
    "Review_Standard": [
        "Assessment of whether the original decision correctly applied the legal test"
    ],
    "Procedural_Fairness_Assessment": [
        "Initial ruling did not adequately consider non-financial factors"
    ],
    "Key_Evidence_Considered": [
        "Time devoted to farming, capital investment in farm, profitability of farm operations, income from teaching vs. farming"
    ],
    "Legal_Framework": [
        "Canadian Income Tax Act – Deductibility of farm losses"
    ],
    "Applicant_Challenge": [
        "Challenged tax reassessment denying farm loss deductions"
    ],
    "Court_Result": [
        "Appeal allowed"
    ],
    "Legal_Rule_Source": [
        "Statutory interpretation of the Income Tax Act"
    ],
    "Standard_of_Proof": [
        "Balance of probabilities"
    ],
    "Defendant_Response": [
        "CRA maintained that teaching was chief source due to higher income"
    ],
    "Evidence_Type": [
        "Documentary evidence, financial records, time allocation records"
    ],
    "Remedy_Requested": [
        "Overturn of tax reassessment"
    ],
    "Outcome": [
        "Mr. Phillips permitted to claim farm loss deductions"
    ],
    "Decision_Authority": [
        "Appeal Court Judge"
    ],
    "Remedy_Sought": [
        "Farm loss deductions recognized for tax purposes"
    ],
    "Resolution_Mechanism": [
        "Judicial appeal"
    ],
    "Legal_Provision": [
        "Sections of the Income Tax Act relating to farm loss deductions and chief source of income"
    ],
    "Authority": [
        "Canada Revenue Agency (CRA), Tax Court, Appellate Court"
    ],
    "Claimant_Status": [
        "Taxpayer (Mr. Phillips)"
    ],
    "Legal_Provision_Cited": [
        "Income Tax Act – provisions on farm losses and source of income"
    ],
    "Grounds_for_Inadmissibility_or_Allegation": [
        "Allegation: CRA incorrectly assessed chief source of income"
    ],
    "Applicable_Process": [
        "Administrative tax reassessment followed by judicial appeal"
    ],
    "Outcome_of_Review": [
        "Reassessment set aside"
    ],
    "Pending_Relief_or_Application": [
        "None – matter resolved on appeal"
    ],
    "Jurisdiction": [
        "Canadian federal tax jurisdiction"
    ],
    "Governing_Rule": [
        "Under the Income Tax Act, chief source of income based on time, effort, capital, and intent, not just income"
    ]
}