{
    "Case ID": "088654",
    "Crime_Name": [
        "Refugee Status Determination"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the RAD err in upholding the RPD's decision regarding the internal flight alternative (IFA)?"
    ],
    "Governing_Law": [
        "IRPA"
    ],
    "Application_Facts": [
        "Applicants claimed religious persecution in India and Botswana but had IFAs in Mumbai and New Delhi."
    ],
    "Decision_Outcome": [
        "The RAD's decision was reasonable; judicial review application dismissed."
    ],
    "Remedy_Requested": [
        "Judicial review of the RAD's decision."
    ],
    "Court_Ruling": [
        "Federal Court dismissed the judicial review application, upholding the RAD's decision."
    ],
    "Claimant_Status": [
        "Applicants seeking refugee status in Canada."
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Alleged religious persecution in country of origin."
    ],
    "Legal_Standard": [
        "Reasonableness standard for RAD review of RPD decisions."
    ],
    "Assessment_Factor": [
        "Existence of a viable Internal Flight Alternative (IFA)."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Procedural_Issue": [
        "RPD rejected claims, RAD upheld decision, applicants sought judicial review."
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Claims of religious persecution, locations of IFA within home country."
    ],
    "Legal_Provision_Cited": [
        "IRPA provisions on Convention refugees and persons in need of protection."
    ],
    "Application_Basis": [
        "Fear of religious persecution in India and Botswana."
    ],
    "Evidence_Assessed": [
        "Risk assessment related to IFA in Mumbai and New Delhi."
    ],
    "Relief_Sought": [
        "Refugee status in Canada."
    ],
    "Governing_Rule": [
        "If an IFA exists and is reasonable, claimants are not considered Convention refugees or persons in need of protection."
    ],
    "Evidentiary_Deficiency": [
        "Applicants did not directly challenge the IFA finding."
    ],
    "Outcome": [
        "Application for judicial review dismissed."
    ],
    "Decisional_Body": [
        "Refugee Appeal Division (RAD), Federal Court"
    ],
    "Harm_Assessment": [
        "Alleged risk of religious persecution if returned to original regions."
    ],
    "Cause_Description": [
        "Applicants sought refugee status due to alleged religious persecution but were denied based on available IFAs."
    ],
    "Evidence_Handling": [
        "RPD and RAD found IFAs reasonable despite applicants' contestations."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Mischaracterization of risks by RAD, according to applicants."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "IRPA sections relating to refugee status and internal flight alternative."
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Findings that IFAs in Mumbai and New Delhi were reasonable."
    ],
    "Decision_Rationale": [
        "Existence of a reasonable IFA is dispositive under IRPA."
    ],
    "Country_of_Origin": [
        "India, Botswana"
    ],
    "Decision_Making_Body": [
        "Refugee Protection Division (RPD), Refugee Appeal Division (RAD), Federal Court"
    ],
    "Evidentiary_Issues": [
        "Applicants contested the characterization of risk but did not directly challenge IFA reasonableness."
    ],
    "Legal_Standard_Applied": [
        "Reasonableness of administrative decision-making by RAD."
    ]
}