{
    "Case ID": "",
    "Crime_Name": [
        "Detention Hearing Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the National Parole Board violated principles of natural justice, fundamental justice, or fettered its discretion by refusing oral psychiatric evidence"
    ],
    "Governing_Law": [
        "Corrections and Conditional Release Act"
    ],
    "Application_Facts": [
        "The applicant's psychiatrist submitted a written report but was not allowed to testify orally. The Board followed its policy, allowing the applicant and his assistant to clarify the report. The applicant’s finite sentence differs from cases involving indeterminate sentences."
    ],
    "Decision_Outcome": [
        "The Board did not fetter its discretion, breach natural justice, or violate Charter rights."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "The application for judicial review was dismissed, affirming the Board's decision."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [
        "The National Parole Board refused to allow oral testimony from the applicant's psychiatrist, adhering to its procedural policies."
    ],
    "Grounds_for_Claim": [
        "Alleged violation of natural justice, fundamental justice, and fettering of discretion by the Board"
    ],
    "Legal_Standard": [
        "Natural justice standards vary based on case specifics; fundamental justice balances individual and societal interests"
    ],
    "Assessment_Factor": [
        "Nature of the sentence (finite vs. indeterminate), availability of alternative means to present evidence (written report with clarification)"
    ],
    "Applicable_Legislation": [
        "Corrections and Conditional Release Act",
        "Canadian Charter of Rights and Freedoms (implied)"
    ],
    "Procedural_Issue": [
        "Refusal to admit oral psychiatric evidence at a detention hearing"
    ],
    "Review_Standard": [
        "Reasonableness standard applied in judicial review of administrative decisions"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Written psychiatric report, applicant's and assistant's clarifications"
    ],
    "Legal_Provision_Cited": [
        "Sections of the Corrections and Conditional Release Act regarding parole board procedures"
    ],
    "Application_Basis": [
        "Request for statutory release and challenge to procedural fairness"
    ],
    "Evidence_Assessed": [
        "Written psychiatric evidence was considered; oral testimony was excluded per policy"
    ],
    "Relief_Sought": [
        "Overturning the Board's decision and granting statutory release"
    ],
    "Governing_Rule": [
        "Administrative bodies may establish procedural policies; natural justice does not always require oral hearings"
    ],
    "Evidentiary_Deficiency": [
        "Absence of oral testimony from the psychiatrist, though written report was provided"
    ],
    "Outcome": [
        "Application dismissed"
    ],
    "Decisional_Body": [
        "National Parole Board"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "The applicant sought judicial review after being denied statutory release due to the Board's refusal to hear oral psychiatric evidence"
    ],
    "Evidence_Handling": [
        "The Board accepted a written psychiatric report and permitted clarification from the applicant and his assistant, but did not allow live testimony"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [
        "Limitation on oral presentation of expert psychiatric evidence"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Corrections and Conditional Release Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "The Board assessed the written psychiatric evidence along with statements from the applicant and his assistant"
    ],
    "Decision_Rationale": [
        "The Board acted within its procedural authority; no breach of natural or fundamental justice occurred given the context and available avenues to present evidence"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "National Parole Board"
    ],
    "Evidentiary_Issues": [
        "Restriction on oral psychiatric testimony despite submission of a written report"
    ],
    "Legal_Standard_Applied": [
        "Principles of natural justice, fundamental justice under the Charter, reasonableness of administrative decision-making"
    ]
}