{
    "Case ID": "091913",
    "Crime_Name": [
        "Discrimination in Employment"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the Tribunal erred in determining Dr. Sangha had a serious possibility of obtaining the RO position and whether the remedy was appropriate"
    ],
    "Governing_Law": [
        "Canadian Human Rights Act"
    ],
    "Application_Facts": [
        "Dr. Sangha, a visible minority immigrant, was not hired for an entry-level position due to being overqualified; statistical analysis was considered but deemed insufficient alone"
    ],
    "Decision_Outcome": [
        "Tribunal found no serious possibility of employment but acknowledged discrimination"
    ],
    "Remedy_Requested": [
        "Compensation for lost wages"
    ],
    "Court_Ruling": [
        "Judicial review granted; case remitted for reconsideration"
    ],
    "Claimant_Status": [
        "Dr. Sangha, qualified professional from a visible minority group"
    ],
    "Defendant_Behavior": [
        "Did not hire Dr. Sangha citing overqualification, which disproportionately affected a visible minority immigrant"
    ],
    "Grounds_for_Claim": [
        "National or ethnic origin"
    ],
    "Legal_Standard": [
        "Discrimination on prohibited grounds under the Canadian Human Rights Act is illegal"
    ],
    "Assessment_Factor": [
        "Serious possibility of obtaining employment, over-qualification as a factor"
    ],
    "Applicable_Legislation": [
        "Canadian Human Rights Act",
        "Federal Courts Act"
    ],
    "Procedural_Issue": [
        "Judicial review of Tribunal decision"
    ],
    "Review_Standard": [
        "Reasonableness or correctness in Tribunal's legal and factual interpretation"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Statistical analysis of hiring patterns, qualifications of Dr. Sangha"
    ],
    "Legal_Provision_Cited": [
        "Sections of the Canadian Human Rights Act prohibiting discrimination in employment"
    ],
    "Application_Basis": [
        "Disproportionate impact of overqualification on visible minority immigrants"
    ],
    "Evidence_Assessed": [
        "Qualifications of Dr. Sangha, rationale for non-hiring, discriminatory effect"
    ],
    "Relief_Sought": [
        "Judicial review, reassessment of employment possibility, compensation"
    ],
    "Governing_Rule": [
        "Under the Canadian Human Rights Act, discrimination on prohibited grounds is illegal; remedies may include lost wages if serious possibility of employment existed"
    ],
    "Evidentiary_Deficiency": [
        "Reliance on over-qualification without proper assessment of actual suitability"
    ],
    "Outcome": [
        "Application for judicial review allowed; matter remitted to Tribunal"
    ],
    "Decisional_Body": [
        "Human Rights Tribunal"
    ],
    "Harm_Assessment": [
        "Loss of opportunity and potential lost wages due to discriminatory hiring practice"
    ],
    "Cause_Description": [
        "Dr. Sangha alleged discrimination after not being hired despite qualifications, due to being overqualified—a factor with adverse impact on immigrants"
    ],
    "Evidence_Handling": [
        "Statistical evidence considered but not determinative; individual suitability not properly assessed"
    ],
    "Legal_Provision_Violated": [
        "Section 3 of the Canadian Human Rights Act (prohibition of discrimination in employment)"
    ],
    "Evidence_Issues": [
        "Over-reliance on over-qualification as a proxy for unsuitability without individualized assessment"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Canadian Human Rights Act, Section 3"
    ],
    "Jurisdictional_Issue": [
        "Federal jurisdiction under Federal Courts Act for judicial review of Tribunal decision"
    ],
    "Evidence_Assessment": [
        "Tribunal failed to adequately assess whether over-qualification was a pretext for discrimination"
    ],
    "Decision_Rationale": [
        "Error in considering over-qualification when assessing serious possibility of employment; discrimination acknowledged but remedy not properly linked"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Human Rights Tribunal"
    ],
    "Evidentiary_Issues": [
        "Insufficient individualized assessment of Dr. Sangha’s suitability despite strong qualifications"
    ],
    "Legal_Standard_Applied": [
        "Serious possibility of employment standard in discrimination cases"
    ]
}