{
    "Case ID": "092047",
    "Crime_Name": [
        "Immigration Application Refusal"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Failure to assess eligibility under country of asylum class"
    ],
    "Legal_Issue": [
        "Did the officer err in refusing the application by failing to assess under country of asylum class?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act (IRPA), section 115(2) - Country of Asylum Class"
    ],
    "Application_Facts": [
        "Applicants are from Afghanistan; Hazara ethnic group facing discrimination; conditions of conflict and instability in Afghanistan"
    ],
    "Decision_Outcome": [
        "Officer's decision set aside; case referred back for fresh determination"
    ],
    "Remedy_Requested": [
        "Judicial review of refusal decision"
    ],
    "Court_Ruling": [
        "Judicial review granted; decision overturned due to reviewable error"
    ],
    "Claimant_Status": [
        "Permanent residence applicants under humanitarian and compassionate grounds"
    ],
    "Defendant_Behavior": [
        "Officer assessed only Convention refugee criteria, ignored country of asylum class"
    ],
    "Grounds_for_Claim": [
        "Failure to consider country of asylum class despite evidence of serious personal effects from armed conflict"
    ],
    "Legal_Standard": [
        "Country of asylum class requires risk of serious personal harm from conflict, not persecution"
    ],
    "Assessment_Factor": [
        "Conditions in Afghanistan, ethnic vulnerability of Hazara, impact of conflict on individual safety"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act (IRPA)"
    ],
    "Procedural_Issue": [
        "Incomplete assessment leading to procedural unfairness"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Country condition reports, evidence of Hazara persecution, personal affidavits"
    ],
    "Legal_Provision_Cited": [
        "IRPA s. 115(2)(a)(ii) – Country of Asylum Class"
    ],
    "Application_Basis": [
        "Humanitarian and compassionate considerations under country of asylum class"
    ],
    "Evidence_Assessed": [
        "Evidence of generalized violence, ethnic targeting, and personal risk in Afghanistan"
    ],
    "Relief_Sought": [
        "Permanent resident status based on country of asylum class"
    ],
    "Governing_Rule": [
        "Applicants must meet either Convention refugee or country of asylum class criteria"
    ],
    "Evidentiary_Deficiency": [
        "Officer failed to analyze evidence under country of asylum class framework"
    ],
    "Outcome": [
        "Decision set aside; remitted for re-determination"
    ],
    "Decisional_Body": [
        "Immigration Officer, Immigration Division"
    ],
    "Harm_Assessment": [
        "Risk of serious personal harm due to armed conflict and ethnic targeting"
    ],
    "Cause_Description": [
        "Refusal based solely on lack of Convention refugee status without assessing country of asylum eligibility"
    ],
    "Evidence_Handling": [
        "Relevant evidence present but not properly applied to correct legal test"
    ],
    "Legal_Provision_Violated": [
        "IRPA s. 115(2) - Failure to apply country of asylum class"
    ],
    "Evidence_Issues": [
        "Failure to consider available evidence under appropriate class"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "IRPA s. 115(2)(a)(ii)"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Incomplete; limited to refugee definition, excluded asylum class analysis"
    ],
    "Decision_Rationale": [
        "Officer concluded no refugee status without analyzing alternative grounds for protection"
    ],
    "Country_of_Origin": [
        "Afghanistan"
    ],
    "Decision_Making_Body": [
        "Immigration Officer at visa office"
    ],
    "Evidentiary_Issues": [
        "Omission of relevant legal framework in evaluating evidence"
    ],
    "Legal_Standard_Applied": [
        "Convention refugee definition only, not country of asylum class"
    ]
}