{
    "Case ID": "093403",
    "Crime_Name": [
        "Citizenship Application Dispute"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [
        "Failure to meet residency requirements",
        "Failure to centralize life in Canada"
    ],
    "Legal_Issue": [
        "Whether the Citizenship judge erred in refusing Mr. Chen's application based on residential requirements and procedural fairness"
    ],
    "Governing_Law": [
        "Citizenship Act, paragraph 5(1)(c)"
    ],
    "Application_Facts": [
        "Mr. Chen was 31 days short of the required 1095 days of residence; frequent trips abroad; lack of family or social ties in Canada"
    ],
    "Decision_Outcome": [
        "Appeal dismissed"
    ],
    "Remedy_Requested": [
        "Overturn of citizenship refusal, recognition of eligibility"
    ],
    "Court_Ruling": [
        "The judge's decision was reasonable; Mr. Chen did not meet residency requirements or demonstrate a centralized mode of existence in Canada"
    ],
    "Claimant_Status": [
        "Applicant for Canadian citizenship"
    ],
    "Defendant_Behavior": [
        "Refusal of citizenship application by Citizenship judge"
    ],
    "Grounds_for_Claim": [
        "Insufficient physical presence in Canada, lack of integration or connection to Canada"
    ],
    "Legal_Standard": [
        "Residency requirement of 1095 days within four years; 'centralized mode of existence' test"
    ],
    "Assessment_Factor": [
        "Duration of residence, frequency of travel abroad, family and social ties in Canada"
    ],
    "Applicable_Legislation": [
        "Citizenship Act"
    ],
    "Procedural_Issue": [
        "Allegation of procedural unfairness in the judge's assessment"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Residency records, travel history, personal ties in Canada"
    ],
    "Legal_Provision_Cited": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Application_Basis": [
        "Accumulation of 1095 days of residence and demonstration of life centered in Canada"
    ],
    "Evidence_Assessed": [
        "Travel patterns, absence of family or community connections in Canada"
    ],
    "Relief_Sought": [
        "Granting of Canadian citizenship"
    ],
    "Governing_Rule": [
        "Applicants must have 1095 days of residence and show their life is centralized in Canada"
    ],
    "Evidentiary_Deficiency": [
        "Lack of sufficient evidence of residency and integration into Canadian society"
    ],
    "Outcome": [
        "Refusal of citizenship upheld"
    ],
    "Decisional_Body": [
        "Citizenship Commission / Federal Court"
    ],
    "Harm_Assessment": [],
    "Cause_Description": [
        "Mr. Chen's application was refused due to insufficient residency and failure to centralize his life in Canada"
    ],
    "Evidence_Handling": [
        "Residency and travel evidence reviewed; credibility of claims assessed"
    ],
    "Legal_Provision_Violated": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Evidence_Issues": [
        "Disputed interpretation of time spent in Canada and significance of international travel"
    ],
    "Residency_Compliance": [
        "Not met – 31 days short of 1095-day requirement"
    ],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Paragraph 5(1)(c) of the Citizenship Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Judge found Mr. Chen’s life was not centered in Canada based on travel and lack of ties"
    ],
    "Decision_Rationale": [
        "Mr. Chen failed to meet statutory residency requirement and did not demonstrate a centralized mode of existence in Canada"
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Citizenship Judge, Federal Court"
    ],
    "Evidentiary_Issues": [
        "Inadequate documentation or proof of continuous residence and integration"
    ],
    "Legal_Standard_Applied": [
        "Reasonableness standard on judicial review; substantive residency and centrality tests"
    ]
}