{
    "Case ID": "094522",
    "Crime_Name": [
        "Immigration and Refugee Protection Act Violation"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Was the Board's decision to deny the applicant refugee status unreasonable?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act"
    ],
    "Application_Facts": [
        "Applicant alleged abuse by family members and sought refugee status in Canada."
    ],
    "Decision_Outcome": [
        "The Federal Court dismissed the application for judicial review."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision denying refugee status."
    ],
    "Court_Ruling": [
        "The Board's decision was reasonable and based on valid grounds."
    ],
    "Claimant_Status": [
        "Applicant seeking refugee status."
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Alleged abuse by family members leading to fear of persecution."
    ],
    "Legal_Standard": [
        "Reasonableness standard of review for administrative decisions."
    ],
    "Assessment_Factor": [
        "Credibility of testimony, plausibility of story, timing of claim, psychological evidence."
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act"
    ],
    "Procedural_Issue": [
        "Delay in filing the refugee claim."
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "Board found contradictions in testimony and implausibility in the applicant's story."
    ],
    "Evidence_Used": [
        "Testimony, psychological reports, details of alleged abuse."
    ],
    "Legal_Provision_Cited": [
        "Sections of the Immigration and Refugee Protection Act related to refugee eligibility and credibility assessment."
    ],
    "Application_Basis": [
        "Fear of persecution due to family abuse."
    ],
    "Evidence_Assessed": [
        "Contradictions in testimony, lack of corroboration, delay in filing, psychological state."
    ],
    "Relief_Sought": [
        "Grant of refugee status and successful judicial review."
    ],
    "Governing_Rule": [
        "Administrative decisions are reviewed on a reasonableness standard unless capricious or unsupported by evidence."
    ],
    "Evidentiary_Deficiency": [
        "Insufficient evidence linking psychological condition to fear of persecution."
    ],
    "Outcome": [
        "Application for judicial review dismissed; Board's decision upheld."
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Alleged past abuse and potential future harm if returned to country of origin."
    ],
    "Cause_Description": [
        "Applicant sought refugee status based on familial abuse but was denied due to credibility issues."
    ],
    "Evidence_Handling": [
        "Board assessed credibility and plausibility of evidence; court deferred to Board under reasonableness standard."
    ],
    "Legal_Provision_Violated": [
        "Immigration and Refugee Protection Act provisions regarding false or unfounded refugee claims."
    ],
    "Evidence_Issues": [
        "Inconsistencies in testimony, lack of supporting documentation, delayed claim."
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [
        "Implied through credibility findings and contradictory statements."
    ],
    "Legal_Provision": [
        "Immigration and Refugee Protection Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Negative credibility findings based on implausibility and inconsistencies."
    ],
    "Decision_Rationale": [
        "Decision was reasonable given credibility concerns, implausibility, and evidentiary gaps."
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Contradictions in testimony, lack of corroboration, delayed reporting."
    ],
    "Legal_Standard_Applied": [
        "Reasonableness"
    ]
}