{
    "Case ID": "095154",
    "Crimes": [
        {
            "Crime_Name": "Engaging in or instigating the subversion by force of any government",
            "Crime_Type": "Security Threats and Terrorism",
            "National_Security_Element": "Involvement with PKK, an organization using armed attacks against the Turkish government",
            "National_Security_Danger": "Potential threat posed by association with a designated terrorist organization",
            "Threat_Assessment": "Visa officer determined Suleyman's actions constituted a security risk",
            "Risk_Factor": "Participation in armed attacks and supply support to the PKK",
            "Nature_of_Acts": "Providing supplies and participating in armed attacks on Turkish military personnel"
        },
        {
            "Crime_Name": "Subversion by force of any government",
            "Crime_Type": "Violations of Immigration Regulations",
            "Violation_Type": "Inadmissibility under immigration law due to membership in a subversive organization",
            "Legal_Issue": "Whether Suleyman’s involvement with the PKK constitutes subversion by force under IRPA",
            "Governing_Law": "Immigration and Refugee Protection Act (IRPA), s. 34(1)(f)",
            "Application_Facts": "Suleyman admitted assisting the PKK, including during an armed attack",
            "Decision_Outcome": "Deemed inadmissible; judicial review dismissed"
        },
        {
            "Crime_Name": "Inadmissible on security grounds for being a member of an organization that there are reasonable grounds to believe engages in subversion by force of any government",
            "Crime_Type": "Security Threats and Terrorism",
            "Organization_Involved": "Kurdistan Workers' Party (PKK)",
            "Admission_or_Involvement": "Suleyman admitted to significant involvement with the PKK",
            "Individual_Behavior": "Assisted in propaganda, supplied materials, and participated in guerrilla activities",
            "Nature_of_Membership": "Active participation rather than passive affiliation",
            "Evidence_Type": "Admissions by Suleyman, intelligence reports on PKK activities"
        },
        {
            "Crime_Name": "Membership in an organization engaging in subversion by force.",
            "Crime_Type": "Violations of Immigration Regulations",
            "Legal_Provision_Cited": "Immigration and Refugee Protection Act, s. 34(1)(f)",
            "Application_Basis": "Suleyman’s membership in the PKK formed the basis for inadmissibility",
            "Evidence_Assessed": "Suleyman’s own admissions about his role in the PKK",
            "Decision_Rationale": "Reasonable grounds existed to believe the PKK engages in subversion by force",
            "Judicial_Review_Outcome": "Application for judicial review dismissed by the Federal Court"
        }
    ]
}