{
    "Case ID": "096494",
    "Crime_Name": [
        "Judicial Review of Removal Decision"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Can the court review the enforcement officer's decision not to defer removal due to pregnancy-related medical issues?"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Applicant sought deferral due to pregnancy complications; delivered a healthy baby; scheduled removal date passed."
    ],
    "Decision_Outcome": [
        "Application for judicial review dismissed as moot."
    ],
    "Remedy_Requested": [
        "Deferral of removal based on medical concerns during pregnancy."
    ],
    "Court_Ruling": [
        "Dismissed as moot due to absence of live controversy."
    ],
    "Claimant_Status": [],
    "Defendant_Behavior": [
        "Enforcement officer refused to defer removal despite pregnancy-related medical concerns."
    ],
    "Grounds_for_Claim": [
        "Pregnancy-related medical issues warranting humanitarian deferral of removal."
    ],
    "Legal_Standard": [
        "Judicial review available for administrative decisions; moot cases typically dismissed unless continuing controversy or public interest exists."
    ],
    "Assessment_Factor": [
        "Resolution of medical condition (birth of child), passage of removal date, lack of ongoing harm."
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Application for judicial review, stay order granted, case rendered moot after delivery and missed removal date."
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [],
    "Evidence_Used": [
        "Medical condition related to pregnancy, timing of birth, enforcement timeline."
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Humanitarian and compassionate grounds based on pregnancy complications."
    ],
    "Evidence_Assessed": [
        "Existence and severity of pregnancy complications, resolution upon delivery."
    ],
    "Relief_Sought": [
        "Judicial review of decision to proceed with removal."
    ],
    "Governing_Rule": [
        "Judicial review is unavailable if the matter is moot unless there is a continuing controversy or public interest."
    ],
    "Evidentiary_Deficiency": [
        "No ongoing medical issue after childbirth; no current risk of removal under original decision."
    ],
    "Outcome": [
        "Dismissal of application due to mootness."
    ],
    "Decisional_Body": [
        "Court"
    ],
    "Harm_Assessment": [
        "Alleged harm from removal during pregnancy, but harm no longer present post-delivery."
    ],
    "Cause_Description": [
        "Enforcement officer refused to defer removal despite pregnancy-related medical concerns."
    ],
    "Evidence_Handling": [
        "Court considered medical facts but found issue resolved by intervening events."
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Medical evidence acknowledged but deemed irrelevant post-resolution of condition."
    ],
    "Decision_Rationale": [
        "No live controversy remains; removal decision no longer operative; case moot."
    ],
    "Country_of_Origin": [],
    "Decision_Making_Body": [
        "Enforcement officer (initial decision); Court (judicial review)."
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Mootness doctrine in judicial review of administrative decisions."
    ]
}