{
    "Case ID": "099187",
    "Crime_Name": [
        "Refugee Protection Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Did the Board err in concluding that the applicant failed to rebut the presumption of state protection?"
    ],
    "Governing_Law": [
        "Immigration and Refugee Protection Act"
    ],
    "Application_Facts": [
        "Gonzalez fled Colombia due to threats from FARC and claimed refugee status in Canada, which was initially denied."
    ],
    "Decision_Outcome": [
        "The Federal Court allowed the application for judicial review, quashing the Board’s decision and remanding it for redetermination by another member."
    ],
    "Remedy_Requested": [
        "Judicial review of the Board's decision"
    ],
    "Court_Ruling": [
        "Court agreed with Gonzalez, finding the Board erred, and referred the case back for reconsideration."
    ],
    "Claimant_Status": [
        "Refugee claimant"
    ],
    "Defendant_Behavior": [],
    "Grounds_for_Claim": [
        "Inadequate consideration of evidence regarding effectiveness of state protection in Colombia"
    ],
    "Legal_Standard": [
        "Claimants must demonstrate inability or unwillingness of their country to protect them unless there is a complete state breakdown."
    ],
    "Assessment_Factor": [
        "Effectiveness of Colombia's protection programs for targeted individuals"
    ],
    "Applicable_Legislation": [
        "Immigration and Refugee Protection Act"
    ],
    "Procedural_Issue": [
        "Judicial review filed with the Federal Court challenging the Board’s decision based on inadequate consideration of evidence"
    ],
    "Review_Standard": [],
    "Credibility_Assessment": [
        "The Board found Gonzalez credible"
    ],
    "Evidence_Used": [
        "Evidence showed Colombia's protection programs were ineffective for targeted individuals"
    ],
    "Legal_Provision_Cited": [
        "Immigration and Refugee Protection Act"
    ],
    "Application_Basis": [
        "Fear of persecution by FARC in Colombia"
    ],
    "Evidence_Assessed": [
        "Evidence regarding state protection mechanisms in Colombia"
    ],
    "Relief_Sought": [
        "Allowance of refugee protection claim and redetermination by the Board"
    ],
    "Governing_Rule": [
        "Under the Immigration and Refugee Protection Act, claimants must demonstrate inability or unwillingness of their country to protect them unless there is a complete state breakdown."
    ],
    "Evidentiary_Deficiency": [
        "Board did not adequately consider evidence on ineffectiveness of state protection"
    ],
    "Outcome": [
        "Application for judicial review allowed; decision quashed and remanded"
    ],
    "Decisional_Body": [
        "Immigration and Refugee Board"
    ],
    "Harm_Assessment": [
        "Risk of harm from FARC due to lack of effective state protection"
    ],
    "Cause_Description": [
        "Gonzalez fled Colombia due to threats from FARC and claimed refugee status in Canada, which was initially denied."
    ],
    "Evidence_Handling": [
        "Board failed to properly assess evidence on state protection efficacy"
    ],
    "Legal_Provision_Violated": [
        "Immigration and Refugee Protection Act"
    ],
    "Evidence_Issues": [
        "Inadequate consideration of evidence on state protection"
    ],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [
        "Immigration and Refugee Protection Act"
    ],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Board did not sufficiently assess the effectiveness of state protection measures"
    ],
    "Decision_Rationale": [
        "Board erred in concluding applicant failed to rebut presumption of state protection despite credible evidence to the contrary"
    ],
    "Country_of_Origin": [
        "Colombia"
    ],
    "Decision_Making_Body": [
        "Immigration and Refugee Board"
    ],
    "Evidentiary_Issues": [
        "Failure to adequately consider evidence of ineffective state protection"
    ],
    "Legal_Standard_Applied": [
        "Presumption of state protection unless rebutted by evidence of inability or unwillingness to protect"
    ]
}