{
    "Case ID": "099494",
    "Crime_Name": [
        "Refugee Status Claim"
    ],
    "Crime_Type": [
        "Violations of Immigration Regulations"
    ],
    "Violation_Type": [],
    "Legal_Issue": [
        "Whether the RPD's decision that state protection exists for Ms. Williams in St. Vincent and the Grenadines is reasonable"
    ],
    "Governing_Law": [],
    "Application_Facts": [
        "Ms. Williams fears persecution from her brother due to his history of violence and mental instability; there was credible evidence of police intervention and her brother's institutionalization"
    ],
    "Decision_Outcome": [
        "The RPD's decision was found reasonable"
    ],
    "Remedy_Requested": [
        "Refugee protection based on fear of persecution by a family member"
    ],
    "Court_Ruling": [
        "The court upheld the RPD's decision"
    ],
    "Claimant_Status": [
        "Refugee claimant"
    ],
    "Defendant_Behavior": [
        "Brother's history of violence and mental instability"
    ],
    "Grounds_for_Claim": [
        "Fear of persecution by a non-state actor (brother) due to domestic violence"
    ],
    "Legal_Standard": [
        "Reasonableness of RPD's decision; presumption of state protection in democratic countries can be rebutted if ineffective or illusory"
    ],
    "Assessment_Factor": [
        "Effectiveness of state protection, credibility of fear, availability of police intervention, institutionalization of perpetrator"
    ],
    "Applicable_Legislation": [],
    "Procedural_Issue": [
        "Judicial review of RPD decision"
    ],
    "Review_Standard": [
        "Reasonableness"
    ],
    "Credibility_Assessment": [
        "The RPD found the evidence credible, including police response and brother's institutionalization"
    ],
    "Evidence_Used": [
        "Evidence of police intervention, documentation of brother's mental health institutionalization"
    ],
    "Legal_Provision_Cited": [],
    "Application_Basis": [
        "Claim based on well-founded fear of persecution by a family member in absence of state protection"
    ],
    "Evidence_Assessed": [
        "RPD assessed evidence of state action as sufficient to provide protection"
    ],
    "Relief_Sought": [
        "Recognition as a refugee under IRPA"
    ],
    "Governing_Rule": [
        "In democratic countries, there is a presumption of effective state protection, which may be rebutted with evidence of ineffectiveness"
    ],
    "Evidentiary_Deficiency": [],
    "Outcome": [
        "RPD decision dismissed claim; court upheld dismissal"
    ],
    "Decisional_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Harm_Assessment": [
        "Risk of harm from brother, but mitigated by state intervention"
    ],
    "Cause_Description": [
        "Ms. Williams filed a refugee claim fearing persecution by her violent brother in St. Vincent and the Grenadines"
    ],
    "Evidence_Handling": [
        "RPD considered and credited evidence of police involvement and brother’s institutionalization"
    ],
    "Legal_Provision_Violated": [],
    "Evidence_Issues": [],
    "Residency_Compliance": [],
    "Misrepresentation_Element": [],
    "Legal_Provision": [],
    "Jurisdictional_Issue": [],
    "Evidence_Assessment": [
        "Evidence showed state protection was available and effective"
    ],
    "Decision_Rationale": [
        "State protection was not illusory; police acted and brother was institutionalized, reducing risk"
    ],
    "Country_of_Origin": [
        "St. Vincent and the Grenadines"
    ],
    "Decision_Making_Body": [
        "Refugee Protection Division (RPD)"
    ],
    "Evidentiary_Issues": [],
    "Legal_Standard_Applied": [
        "Reasonableness standard applied to RPD's findings on state protection"
    ]
}